[{"title": "Revenue Strategy and Operations", "location": "\n            US National \n", "description": "\n            Centralize and automate emails for our customers and prospects. Implement lead scoring so that the sales team prioritizes the most important prospects. Use data to predict prospects' needs for staff, test and iterate on those predictions, integrate...\n        "}, {"title": "ETL Developer", "location": "\n            US National \n", "description": "\n            Design, development and maintenance of various ETL processes. Design and development of processes for various types of data (potentially large datasets and disparate data sources that require transformation and cleansing to become a usable data set).\n        "}, {"title": "Data Solution Architect", "location": "\n            United Kingdom \n", "description": "\n            Responsible for the development of data solution architecture as it relates to the Data Services projects which span multiple technology stacks. Responsible for understanding and translating the business problem to deliver the documented data ...\n        "}, {"title": "Solutions Architect", "location": "\n            Argentina, Bolivia, Brazil, Chile, Colombia, Ecuadaor, Guyana, Paraguay, Peru, Suriname, Uruguay, Venezeula, Canada, Mexico, or US National \n", "description": "\n            Successful experience partnering with Global GSIs to create and consume services. Provides technical leadership and direction to partners and internal staff in the development of fully integrated technology solutions. 5-10 years of sales engineering...\n        "}, {"title": "Data Engineer", "location": "\n            US National \n", "description": "\n            Collaborate closely with operations, IT and vendor partners to understand the data landscape and contribute to the vision, development and implementation of the Data Warehouse solution. Recommend technologies and tools to support the future state...\n        "}, {"title": "Global Insights and Analytics Manager - Global Marketing Organization", "location": "\n            US National \n", "description": "\n            Pursue opportunities to develop existing and new skills outside of comfort zone. Act to resolve issues which prevent effective team working, even during times of change and uncertainty. Coach others and encourage them to take ownership of their...\n        "}, {"title": "Front-End Developer", "location": "\n            US National \n", "description": "\n            You will be responsible for understanding the reporting need of the business and own the creation of the various reports and dashboards utilizing your knowledge of data warehousing concepts, market leading business intelligence capabilities, and quality.\n        "}, {"title": "Schedule Analyst", "location": "\n            US National \n", "description": "\n            As a project and schedule analyst on our team, you'll analyze your client's operating environment and identify areas for improvement. You'll facilitate discussions with leadership and support staff across engineers, other analysts, and stakeholders...\n        "}, {"title": "Senior Infrastructure Architect", "location": "\n            NJ \n", "description": "\n            In this role, you will lead, develop and retain a group of versatilists. Team talents include a broad spectrum of technical skills to address complex technical challenges, insights-driven decisioning, and perpetual learners. As part of the extended and...\n        "}, {"title": "Infrastructure Architect", "location": "\n            TX \n", "description": "\n            5+ years of experience in IT. 4+ years of hands-on experience and 3+ years of management/technical advisory experience. Success in a technical management role in the healthcare, finance, or related highly regulated industry of practical experience.\n        "}, {"title": "Senior Analyst, Cyber Security", "location": "\n            Charlotte, NC \n", "description": "\n            Develop host-based detection content in Microsoft Defender. Analyze network and host activity associated with intrusion attempts by advanced attackers.Perform network traffic analysis utilizing raw packet data, net flow, IDS, and custom sensor output.\n        "}, {"title": "Senior Application Security Engineer - REMOTE", "location": "\n            Charlotte, NC \n", "description": "\n            The Senior Application Security Engineer is responsible for improving the security of our applications and supporting technology platforms. As a globally distributed Application Security Team member, solid communication skills and a strong sense of...\n        "}, {"title": "Data Scientist", "location": "\n            MA \n", "description": "\n            Proactively explore, gather, clean, describe, and analyze data. Develop tools and strategies related to text analytics, machine learning, and semantic enrichment. Develop and maintain strong working relationships across departments and with key...\n        "}, {"title": "Senior Manager, Contact Center Workforce Management - WFM - Process Innovation", "location": "\n            Woonsocket, RI \n", "description": "\n            Overseeing the development and implementation of Contact Center Process Innovation Mgmt. strategy for company's Health Retail portfolio of products across lines of business, including continuous improvement initiatives. Oversee improvement opportunities.\n        "}, {"title": "Cloud and Hosting Services Engineer", "location": "\n            Brazil \n", "description": "\n            This role requires a generalist who can contribute with needs in development, system operations, resiliency testing, security hardening, and performance engineering. The Site Reliability Engineer is comfortable taking on new engineering challenges,...\n        "}, {"title": "Principal AI Scientist", "location": "\n            Poland \n", "description": "\n            Cooperating with a cross-disciplinary team pushing the boundaries of Educational Technology. Hands-on R&D on AI systems that will be used in new products. You will often work on proof of concepts aimed at validating new ideas. Leading a small...\n        "}, {"title": "Senior Software Engineer - Internal Identity and Access", "location": "\n            New York, NY \n", "description": "\n            Develop centralized repository and workflows for storage and application of security policies within company's production environment. Develop the next generation authorization and identity information for production environment. Building infrastructure.\n        "}, {"title": "Marketing Data Analyst", "location": "\n            Lisbon, Portugal \n", "description": "\n            Partner with Growth Marketing Department leaders to ensure campaign success. Partner with Account Management and Sales for Quarterly Business Reviews. Responsible for all campaign pacing and optimization efforts to ensure delivery is met and campaign...\n        "}, {"title": "Digital Marketing Data Analyst", "location": "\n            India \n", "description": "\n            Partner with Growth Marketing Department leaders to ensure campaign success. Partner with Account Management and Sales for Quarterly Business Reviews. Responsible for all campaign pacing and optimization efforts to ensure delivery is met and campaign...\n        "}, {"title": "Software Engineer", "location": "\n            United Kingdom \n", "description": "\n            Develop code Typescript, NodeJS, MySQL, Python that supports the Common Voice platform and dataset. Work directly with  Product Lead to shape and inform all aspects of the product roadmap. Mentor and support other engineers in the team.Create documents.\n        "}, {"title": "Software Engineer", "location": "\n            Canada \n", "description": "\n            Develop code Typescript, NodeJS, MySQL, Python that supports the Common Voice platform and dataset. Work directly with the Product Lead to shape and inform all aspects of the product roadmap. Mentor and support other engineers in the team.\n        "}, {"title": "Data Scientist, Analytics", "location": "\n            US National \n", "description": "\n            Partner with Product to develop metrics and conduct analysis for measuring impact of decisions on KPIs. During feature development, design analytics products and experiments that will appropriately measure impact. Work with Product to establish, reach...\n        "}, {"title": "Director - Reinsurance", "location": "\n            New York, NY, Bloomington, MN \n", "description": "\n             Focus on broking traditional and alternative / structured reinsurance solutions. Is willing to participate in helping in the development of sales and marketing strategy designed to cultivate revenue generation opportunities. Develop relationships.\n        "}, {"title": "Senior Embedded Engineer, Test Fixtures", "location": "\n            Toronto, ON, Canada \n", "description": "\n            You will be a lead player for development and integration of automated software that controls our fixtures in high-volume manufacturing. Aside from test fixture development, you will also be responsible for occasionally supporting test fixtures...\n        "}, {"title": "Senior Software Developer Pharmacy Domain", "location": "\n            Pittsburgh, PA \n", "description": "\n            Design and develop software programs to meet customer and business requirements. Coordinate systems analysis, systems development and implementation activities to ensure customer requirements are met or exceeded. Organize and prepare program and system...\n        "}, {"title": "Data Engineer", "location": "\n            Macedonia \n", "description": "\n            You'll be a catalyst for extracting value from internal and external data sources which in turn will be used to fuel automation pipelines and to help our pizzerias partners run their businesses in a data-driven manner. You'll code daily...\n        "}, {"title": "Data Analytics Professional - Marketing Operations", "location": "\n            Brazil \n", "description": "\n            Create models (dashboards, KPI, statics modes) to drive business goals. Teach about data and generate insights for many teams. Develop and implement data analytics models to maximize the lifetime of the users. Develop A/B tests to understand...\n        "}, {"title": "Support Engineer", "location": "\n            US National \n", "description": "\n            You will be responsible for helping to investigate and triage customer support issues while helping track down any underlying bugs. You will help the team by creating tickets for bugs and working directly with engineers to identify their root cause. \n        "}, {"title": "Cloud Engineer", "location": "\n            Manchester, United Kingdom \n", "description": "\n            We are looking for experienced Cloud Engineers to join our team following continuous growth and success in the UK Government sector. You must be skilled in a range of AWS services, and show a keenness to keep up to date with the latest releases. \n        "}, {"title": "Senior Reporting Analyst - Data, Analytics, and Automation - DAA", "location": "\n            AZ, CT, IL, RI \n", "description": "\n            You will work with pharmacy and member specific claims data including, but not limited to, financial and operational information supporting state and federal compliance reporting. You will be responsible for standard and ad-hoc client and regulatory...\n        "}, {"title": "DevOps Engineer", "location": "\n            Cincinnati, OH \n", "description": "\n            The DevOps Engineer will be working on our client's Application Platform. As part of the platform Data track, we are looking for DevOps Engineers to help us with automating and building scripts to provision infrastructure for Azure data platform services.\n        "}, {"title": "Senior Data Engineer", "location": "\n            Cincinnati, OH \n", "description": "\n            The Senior Data Engineer will present opportunities with cost/benefit analysis to leadership to shape sound architectural decisions, lead the analysis of the technology environment to detect critical deficiencies and recommend solutions...\n        "}, {"title": "Senior-Staff Threat Researcher", "location": "\n            Canada, or US National \n", "description": "\n            Tracking active campaigns from major threat actors against public, private, and government entities and automating collection of data on these topics. Has at least 5-7 years of experience in security research broadly, including hunting threat actors...\n        "}, {"title": "Cyber Security Analyst - IAM, PAM", "location": "\n            Canada \n", "description": "\n            Play an active role in ensuring the integration of services, data flow and functionality for all Credential Management and Identity Administration's platforms.Review, report and remediate data related to Access Certifications.Provide system support.\n        "}, {"title": "Solutions Architect", "location": "\n            Switzerland \n", "description": "\n            Lead your clients through evaluating and adopting the platform. Support your customers by authoring reference architectures, how-tos, and demo applications. Integrate the platform with 3rd-party applications to support customer architectures.\n\n        "}, {"title": "Senior Analytics Manager, Logistics", "location": "\n            US National \n", "description": "\n            Manage, mentor, and build a high performance team of analysts that are able to gather and synthesize data quickly and accurately. Measure impact of throughput through the creation of KPIs to help measure against business outcomes. Deliver insights.\n        "}, {"title": "Senior Software Engineer, Ads Integrity", "location": "\n            BC, Canada \n", "description": "\n            Work with product managers to design and implement Ads products. Collaborate closely with the platform and data teams while building new features. Lead the processes needed to improve operational stability, including improving code quality, delivering...\n        "}, {"title": "Senior DevOps Engineer", "location": "\n            Canada \n", "description": "\n            Worked closely and in full coordination with the IT Eng+ DevOps team to provide follow-the-sun operational coverage in the production support of our AWS Environments and internal IT and Engineering tooling. Built out automated tooling for cloud...\n        "}, {"title": "Staff Software Engineer, Machine Learning - Advertiser Optimization", "location": "\n            ON, Canada \n", "description": "\n            Dive deep into our platform to spot opportunities for improvement. Apply mathematical sophistication to solve our customers' problems. Build applied machine learning models end to end to production. Iterate and tune algorithms and/or models with...\n        "}, {"title": "Staff Software Engineer, Mobile", "location": "\n            Poland \n", "description": "\n            Plan and implement new mobile financial product features. Work cross functionally with colleagues in product, design, analytics, finance, legal, machine learning, and engineering teams. Lead technical solution design across mobile, web, and backend...\n        "}, {"title": "Staff Software Engineer, Backend", "location": "\n            Poland \n", "description": "\n            Design, plan and implement new financial product deliverables. Work cross functionally with colleagues in product, design, analytics, finance, legal, machine learning, and engineering teams. Design & build APIs, services, and data models to work with...\n        "}, {"title": "Senior Test Automation Engineer", "location": "\n            US National \n", "description": "\n                Own and coordinate testing for premium products. Create and execute test automation to support it. Develop automation supporting complex cross team features that support 100,000 users. Drive standards and best practices and ensure quality products. \n        "}, {"title": "Engineering Director", "location": "\n            Brazil \n", "description": "\n            The Engineering Director will build, mentor, and manage a team consisting of individual contributors and one engineering manager. The Director will be hands-on and own the technical roadmap planning and execution in collaboration with the PAC Product...\n        "}, {"title": "Credit Risk Manager", "location": "\n            Canada, Mexico, or US National \n", "description": "\n            Use your analytical skills and experience in consumer credit risk to play a key role in leading Credit and Product strategy for the company's core product, Instant Cash. Lead the development of new strategies to ensure the stability of the company's...\n        "}, {"title": "Senior Data Scientist", "location": "\n            US National \n", "description": "\n            Lead the design, analysis, and interpretation of projects from data requirement gathering to data processing, modeling, and recommendations. Proactively identify gaps and opportunities for marketing teams to optimize existing and create new marketing...\n        "}, {"title": "Senior Imagery Software Engineer", "location": "\n            US National \n", "description": "\n            Ensuring the imagery is properly geolocated on the Earth's surface. Contributing to the design and modeling of new imaging systems and operating modes. Developing and validating image quality metrics. Troubleshooting image quality issues and developing...\n        "}, {"title": "Financial Analyst II", "location": "\n            US National \n", "description": "\n            Perform financial forecasting, reporting, and operational metrics tracking. Analyze financial data and create financial models for decision support. Report on financial performance and prepare for regular leadership reviews. Assist in financial...\n        "}, {"title": "Marketing Data Analytics Specialist", "location": "\n            Brazil \n", "description": "\n            The team designs and implements strategy, for all our 10+ countries, towards increasing revenue generation by creating great experiences. This position is going to help this team drive results through the generation of impactful data insights.\n        "}, {"title": "Senior Director, Media Forecasting and Modeling", "location": "\n            US National \n", "description": "\n            Responsible for applying quantitative methodologies, techniques, and tools to develop best in class insights that inform all types of media activations (social, search, digital, multi-channel, etc). Identify business opportunities, goals, and...\n        "}, {"title": "Architect, Data Analytics", "location": "\n            US National \n", "description": "\n            Analyzes data and develops models, algorithms, visualizations and/or simulations for complex business problems. Performs statistical analysis to establish causal relationships between drivers and outcomes. Build analytics processes for anomaly...\n        "}]