[{"title": "Data Scientist, Analytics", "location": "\n            US National \n", "description": "\n            Partner with Product to develop metrics and conduct analysis for measuring impact of decisions on KPIs. During feature development, design analytics products and experiments that will appropriately measure impact. Work with Product to establish, reach...\n        "}, {"title": "Director - Reinsurance", "location": "\n            New York, NY, Bloomington, MN \n", "description": "\n             Focus on broking traditional and alternative / structured reinsurance solutions. Is willing to participate in helping in the development of sales and marketing strategy designed to cultivate revenue generation opportunities. Develop relationships.\n        "}, {"title": "Senior Embedded Engineer, Test Fixtures", "location": "\n            Toronto, ON, Canada \n", "description": "\n            You will be a lead player for development and integration of automated software that controls our fixtures in high-volume manufacturing. Aside from test fixture development, you will also be responsible for occasionally supporting test fixtures...\n        "}, {"title": "Senior Software Developer Pharmacy Domain", "location": "\n            Pittsburgh, PA \n", "description": "\n            Design and develop software programs to meet customer and business requirements. Coordinate systems analysis, systems development and implementation activities to ensure customer requirements are met or exceeded. Organize and prepare program and system...\n        "}, {"title": "Data Engineer", "location": "\n            Macedonia \n", "description": "\n            You'll be a catalyst for extracting value from internal and external data sources which in turn will be used to fuel automation pipelines and to help our pizzerias partners run their businesses in a data-driven manner. You'll code daily...\n        "}, {"title": "Data Analytics Professional - Marketing Operations", "location": "\n            Brazil \n", "description": "\n            Create models (dashboards, KPI, statics modes) to drive business goals. Teach about data and generate insights for many teams. Develop and implement data analytics models to maximize the lifetime of the users. Develop A/B tests to understand...\n        "}, {"title": "Support Engineer", "location": "\n            US National \n", "description": "\n            You will be responsible for helping to investigate and triage customer support issues while helping track down any underlying bugs. You will help the team by creating tickets for bugs and working directly with engineers to identify their root cause. \n        "}, {"title": "Cloud Engineer", "location": "\n            Manchester, United Kingdom \n", "description": "\n            We are looking for experienced Cloud Engineers to join our team following continuous growth and success in the UK Government sector. You must be skilled in a range of AWS services, and show a keenness to keep up to date with the latest releases. \n        "}, {"title": "Senior Reporting Analyst - Data, Analytics, and Automation - DAA", "location": "\n            AZ, CT, IL, RI \n", "description": "\n            You will work with pharmacy and member specific claims data including, but not limited to, financial and operational information supporting state and federal compliance reporting. You will be responsible for standard and ad-hoc client and regulatory...\n        "}, {"title": "DevOps Engineer", "location": "\n            Cincinnati, OH \n", "description": "\n            The DevOps Engineer will be working on our client's Application Platform. As part of the platform Data track, we are looking for DevOps Engineers to help us with automating and building scripts to provision infrastructure for Azure data platform services.\n        "}, {"title": "Senior Data Engineer", "location": "\n            Cincinnati, OH \n", "description": "\n            The Senior Data Engineer will present opportunities with cost/benefit analysis to leadership to shape sound architectural decisions, lead the analysis of the technology environment to detect critical deficiencies and recommend solutions...\n        "}, {"title": "Senior-Staff Threat Researcher", "location": "\n            Canada, or US National \n", "description": "\n            Tracking active campaigns from major threat actors against public, private, and government entities and automating collection of data on these topics. Has at least 5-7 years of experience in security research broadly, including hunting threat actors...\n        "}, {"title": "Cyber Security Analyst - IAM, PAM", "location": "\n            Canada \n", "description": "\n            Play an active role in ensuring the integration of services, data flow and functionality for all Credential Management and Identity Administration's platforms.Review, report and remediate data related to Access Certifications.Provide system support.\n        "}, {"title": "Solutions Architect", "location": "\n            Switzerland \n", "description": "\n            Lead your clients through evaluating and adopting the platform. Support your customers by authoring reference architectures, how-tos, and demo applications. Integrate the platform with 3rd-party applications to support customer architectures.\n\n        "}, {"title": "Senior Analytics Manager, Logistics", "location": "\n            US National \n", "description": "\n            Manage, mentor, and build a high performance team of analysts that are able to gather and synthesize data quickly and accurately. Measure impact of throughput through the creation of KPIs to help measure against business outcomes. Deliver insights.\n        "}, {"title": "Senior Software Engineer, Ads Integrity", "location": "\n            BC, Canada \n", "description": "\n            Work with product managers to design and implement Ads products. Collaborate closely with the platform and data teams while building new features. Lead the processes needed to improve operational stability, including improving code quality, delivering...\n        "}, {"title": "Senior DevOps Engineer", "location": "\n            Canada \n", "description": "\n            Worked closely and in full coordination with the IT Eng+ DevOps team to provide follow-the-sun operational coverage in the production support of our AWS Environments and internal IT and Engineering tooling. Built out automated tooling for cloud...\n        "}, {"title": "Staff Software Engineer, Machine Learning - Advertiser Optimization", "location": "\n            ON, Canada \n", "description": "\n            Dive deep into our platform to spot opportunities for improvement. Apply mathematical sophistication to solve our customers' problems. Build applied machine learning models end to end to production. Iterate and tune algorithms and/or models with...\n        "}, {"title": "Staff Software Engineer, Mobile", "location": "\n            Poland \n", "description": "\n            Plan and implement new mobile financial product features. Work cross functionally with colleagues in product, design, analytics, finance, legal, machine learning, and engineering teams. Lead technical solution design across mobile, web, and backend...\n        "}, {"title": "Staff Software Engineer, Backend", "location": "\n            Poland \n", "description": "\n            Design, plan and implement new financial product deliverables. Work cross functionally with colleagues in product, design, analytics, finance, legal, machine learning, and engineering teams. Design & build APIs, services, and data models to work with...\n        "}, {"title": "Senior Test Automation Engineer", "location": "\n            US National \n", "description": "\n                Own and coordinate testing for premium products. Create and execute test automation to support it. Develop automation supporting complex cross team features that support 100,000 users. Drive standards and best practices and ensure quality products. \n        "}, {"title": "Engineering Director", "location": "\n            Brazil \n", "description": "\n            The Engineering Director will build, mentor, and manage a team consisting of individual contributors and one engineering manager. The Director will be hands-on and own the technical roadmap planning and execution in collaboration with the PAC Product...\n        "}, {"title": "Credit Risk Manager", "location": "\n            Canada, Mexico, or US National \n", "description": "\n            Use your analytical skills and experience in consumer credit risk to play a key role in leading Credit and Product strategy for the company's core product, Instant Cash. Lead the development of new strategies to ensure the stability of the company's...\n        "}, {"title": "Senior Data Scientist", "location": "\n            US National \n", "description": "\n            Lead the design, analysis, and interpretation of projects from data requirement gathering to data processing, modeling, and recommendations. Proactively identify gaps and opportunities for marketing teams to optimize existing and create new marketing...\n        "}, {"title": "Senior Imagery Software Engineer", "location": "\n            US National \n", "description": "\n            Ensuring the imagery is properly geolocated on the Earth's surface. Contributing to the design and modeling of new imaging systems and operating modes. Developing and validating image quality metrics. Troubleshooting image quality issues and developing...\n        "}, {"title": "Financial Analyst II", "location": "\n            US National \n", "description": "\n            Perform financial forecasting, reporting, and operational metrics tracking. Analyze financial data and create financial models for decision support. Report on financial performance and prepare for regular leadership reviews. Assist in financial...\n        "}, {"title": "Marketing Data Analytics Specialist", "location": "\n            Brazil \n", "description": "\n            The team designs and implements strategy, for all our 10+ countries, towards increasing revenue generation by creating great experiences. This position is going to help this team drive results through the generation of impactful data insights.\n        "}, {"title": "Senior Director, Media Forecasting and Modeling", "location": "\n            US National \n", "description": "\n            Responsible for applying quantitative methodologies, techniques, and tools to develop best in class insights that inform all types of media activations (social, search, digital, multi-channel, etc). Identify business opportunities, goals, and...\n        "}, {"title": "Architect, Data Analytics", "location": "\n            US National \n", "description": "\n            Analyzes data and develops models, algorithms, visualizations and/or simulations for complex business problems. Performs statistical analysis to establish causal relationships between drivers and outcomes. Build analytics processes for anomaly...\n        "}, {"title": "Senior Python Data - Machine Learning Engineer", "location": "\n            Work from Anywhere \n", "description": "\n            Your primary focus will be collaborating with a team of developers in creating and implementing software applications and components. Must have strong Python Data Experience using frameworks like Pandas and NumPy.\n        "}, {"title": "Senior Data Engineer", "location": "\n            Canada \n", "description": "\n            Build data models and patterns for powering self-service data discovery. Design, build and maintain solutions that power batch and real-time processing powering millions of recommendations daily. Improve the data quality and reliability of data...\n        "}, {"title": "Technical Writer", "location": "\n            MA, NH, CA, NJ, CO, CT, NC, FL, ND, ME, OH, IL, PA, IN \n", "description": "\n            Write technical documentation such as API reference manuals, user guides, implementation guides, developer guides, and more for external and internal customer, user, developer, and implementation audiences. Write release notes and FAQs. Create product...\n        "}, {"title": "Senior IT Developer", "location": "\n            Jacksonville, FL \n", "description": "\n            Senior IT Developers are responsible for development, programming, coding of Information Technology solutions. Senior IT Developers are responsible for documenting detailed system specifications, participation in unit testing and maintenance of...\n        "}, {"title": "Senior Data Engineer", "location": "\n            US National \n", "description": "\n            Create a strong partnership with Product Strategy, Data Engineering, IT, and leadership for Data Management technologies for well-managed and effective data platform and tools operations. Lead your team in building data management solutions that span...\n        "}, {"title": "Senior Software Engineer Security", "location": "\n            Canada, United Kingdom, Germany, or US National \n", "description": "\n            Secure the software supply chain in the conda ecosystem, starting from upstream open-source packages, to the build process, to the package manager (conda), to installation and environment management. Identify gaps in our security and work with the...\n        "}, {"title": "Quality Assurance Engineer Manager ", "location": "\n            US National \n", "description": "\n            As our Quality Assurance Engineer Manager (Automation), you'll be developing processes and managing our main QA projects including integrating our growing automation suite into our CD pipeline and automating accessibility and security testing.\n        "}, {"title": "Senior Trademark Analyst", "location": "\n            CA, IL, WA, NY, NJ, TX, FL, PA, MA \n", "description": "\n            In this role, you will work closely with clients and more senior team members to assess clients' business objectives and to tailor project scope, content, and implementation to best address those objectives. Bachelor's degree and 7-10+ years of exp. \n        "}, {"title": "Trademark Analyst", "location": "\n            CA, IL, WA, NY, NJ, TX, FL, PA, MA \n", "description": "\n            Enjoy collaborating with more- and less-experienced team members on consulting projects involving trademark, copyright and domain names, such as assessment and evaluation of trademark, copyright and domain name portfolios, trademark valuations...\n        "}, {"title": "Associate of Enrollment and Billing Optimization ", "location": "\n            AZ, CA, CO, CT, FL, GA, IL, IA, MD, MA, MI, NH, NJ, NM, NY, NC, OH, OR, PA, RI, TN, TX, UT, VA, WA, Washington, DC \n", "description": "\n            Oversee designs and prioritizes technical operations roadmaps working to implement and improve the efficacy and efficiency of existing operational processes or unlock new capabilities. Bachelor's degree and 4+ years of commensurate experience. Remote. \n        "}, {"title": "Senior DevOps Engineer", "location": "\n            Chicago, IL, St. Petersburg, FL \n", "description": "\n            You'll work closely with our engineering, QA, and product teams to provide best practices, tooling, and support, and enable our continued growth. 5+ years of DevOps / SRE experience. 3+ years with high availability, concurrent distributed infrastructure.\n\n        "}, {"title": "Data Analyst", "location": "\n            CA \n", "description": "\n            As a Data Analyst on the Data Operations team, you will work cross-functionally with data engineers, data scientists, business experts, and external vendors to help deliver a better student experience by using data and analytics. Bachelor's degree. \n        "}, {"title": "Software Engineer", "location": "\n            DE, FL, GA, MD, NC, NV, OH, PA, SC, TN, VA, WV \n", "description": "\n            Creating and maintaining business-critical systems, including software written in C#, SQL, TypeScript (React Native), and more. Taking ownership of tasks and projects to ensure requirements are met. Experience with a mainstream programming language.\n        "}, {"title": "Engineering Manager - Education", "location": "\n            US National \n", "description": "\n            Manage a team of software and data engineers. Collaborate with scrum masters, product owners, and leadership to build world-class solutions powering one of the largest online marketplaces for adult learners. Position the engineering team for success...\n        "}, {"title": "Senior Data Analyst", "location": "\n            US National \n", "description": "\n                Work closely with executive stakeholders as a thought partner in scoping and planning and lead development and delivery of quality data products. Build and iterate data products to ensure end-to-end delivery of solid reports in compliance, audit...\n        "}, {"title": "Senior Data Analyst", "location": "\n            US National \n", "description": "\n            Improve the team's productivity and increase the speed of analytics through automated data analytics. Develop data analytics automation using programming languages R and Python. Improve performance and enhance the development of the cloud-based...\n        "}, {"title": "Staff Machine Learning Engineer", "location": "\n            US National \n", "description": "\n            You will help build a state-of-the-art ML infrastructure that performs automated data retrieval, feature extraction, model training, and deployment at scale. 7+ yrs of experience developing mission-critical applications using Java or Python or similar...\n        "}, {"title": "Director of Analytics", "location": "\n            US National \n", "description": "\n            You'll assess our data stack and determine what tools we need to meet our long-term data needs. You'll work closely with business leads across the company to scope data projects and assess their impacts. 6+ years experience. 100% Remote Work.\n        "}, {"title": "Software Engineer III", "location": "\n            Mountain View, CA \n", "description": "\n            Software Engineer III will work closely with product and development teams to create an amazing user experience. Designs and develops software applications. Performs coding, debugging, testing, and troubleshooting throughout the application development...\n        "}, {"title": "Principal Machine Learning Engineer", "location": "\n            US National \n", "description": "\n            Lead AI and data science activities to develop new and innovative approaches to improve the value of care received by the company's Medicare patients. Be the organizational thought leader in the application of machine learning, predictive models...\n        "}, {"title": "Marketing Analytics and Insights Business Analyst", "location": "\n            US National \n", "description": "\n            Contribute to the business marketing measurement function by combining creative problem solving with analytical rigor to drive actionable insights, including developing reporting frameworks and dashboards, performing customer segmentation, completing...\n        "}, {"title": "Revenue Management Data Analyst", "location": "\n            Miami, FL \n", "description": "\n            Revenue Management Data Analyst has responsibility for pricing and revenue management activities involving one or more lines of business at World Fuel Services. The role will have responsibility for managing pricing strategy, designing pricing...\n        "}, {"title": "Python Developer", "location": "\n            Work from Anywhere \n", "description": "\n            Oversee the technical development of our product in the Python universe. You own the python driver and other projects. You evaluate the latest developments and innovations in the Python field to further apply them in your work.\n        "}, {"title": "Go-To-Market Analytics Associate", "location": "\n            US National \n", "description": "\n            Analyze key product operations metrics for ad hoc data requests and pull data from various systems and databases to provide product performance and trend updates to GTM teams. Manage and maintain the central repository of Lyra's business and product...\n        "}, {"title": "Senior Data Analyst", "location": "\n            US National \n", "description": "\n            Responsible for gathering and analyzing data to inform business decisions and drive growth. This includes designing and implementing data collection and analysis processes, creating reports/dashboards, and communicating findings to various stakeholders.\n        "}, {"title": "Digital Analytics Manager", "location": "\n            US National \n", "description": "\n            Develop next generation data pipelines, models and products to elevate our growth marketing initiatives. This high-impact role will inform and influence our product and business decisions through data playing a critical role in our fast growing...\n        "}, {"title": "Senior Data Scientist", "location": "\n            San Francisco, CA \n", "description": "\n            Building statistical and machine learning models that will be pushed into production systems, at-scale. Identifying unique solutions in which data can be transformed and applied into actionable solutions and new product features that drive revenue...\n        "}, {"title": "Senior Environment Technical Artist", "location": "\n            US National \n", "description": "\n            Help create immersive worlds and push the quality and realism of next-gen environment art. You will work in a collaborative environment with talented and hardworking artists and TDs to build an efficient environment pipeline to deliver a visually...\n        "}, {"title": "Data Scientist", "location": "\n            US National \n", "description": "\n            In this role, you will be combining internal and external data to answer questions such as segmenting customers by purchasing behavior, forecasting financial metrics on the scale of months or years, predicting win/loss rates in contract negotiations...\n        "}, {"title": "Staff Data Scientist", "location": "\n            US National \n", "description": "\n            Head up a new initiative around creating our first Ecosystem team, enabling us to grow from where we are to our next major milestones: reaching 100 million+ families, and $100 million+ in revenue, while deepening love for our brand and continuing...\n        "}, {"title": "Market Research Analyst", "location": "\n            US National \n", "description": "\n            Assist in the creation and production of data-centric content for earned media marketing campaigns. Responsible for ideating, researching, compiling, analyzing and telling stories through data, which will then be crafted into promotional campaigns.\n        "}, {"title": "Staff Software Engineer, Backend", "location": "\n            US National \n", "description": "\n            Promote growth of teammates through mentorship and coaching. Develop relationships across engineering teams. Design, build and maintain APIs that drive our user's experience, integrating with services and systems across the engineering teams.\n        "}, {"title": "Staff Software Engineer, Search", "location": "\n            US National \n", "description": "\n            You'll have the opportunity to positively impact those users with your expertise in the services that drive the app's nutrition logging. Majority of the work you will do will be in Scala and Elasticsearch, we also have Java, Ruby, Go, Node and Python.\n        "}, {"title": "Software Engineering Manager, Backend", "location": "\n            US National \n", "description": "\n            Responsible for coaching and leading teams of engineers as we deliver on our roadmap. To thrive in this role, you will execute well in an agile environment where we will depend on you to make pragmatic decisions, establish and use tight feedback...\n        "}, {"title": "Senior Technical Data Quality Analyst", "location": "\n            US National \n", "description": "\n            Perform statistical tests on large datasets to determine data quality and integrity, and quickly identify data anomalies. Evaluate system performance and design, as well as its effect on data quality. Collaborate with data engineers to improve data...\n        "}, {"title": "Senior Production Engineering Manager", "location": "\n            Canada, or US National \n", "description": "\n            Manage 6-8 production engineers especially through the transition to DevOps principles and practices. Hands-on technical to provide mentorship to a development/solution-first team with regular architectural support and coding support. 10+ years of...\n        "}, {"title": "Staff Marketing Analyst", "location": "\n            US National \n", "description": "\n            Define and analyze marketing metrics and KPIs, such as CAC, LTV and payback period. Iterate and improve upon our conversion rate and marketing attribution models. Work with the GTM team to design robust experiments to measure the success...\n        "}, {"title": "Engineering Manager", "location": "\n            US National \n", "description": "\n            We are looking for a Software Engineering Manager to lead 6 - 8 engineers across multiple teams. Engineering Managers are responsible for building an engaging team environment, recruiting talent to the team, and developing staff to their highest...\n        "}, {"title": "Senior Data Engineer", "location": "\n            US National (Not hiring in CA, MA, NJ, NY) \n", "description": "\n            Craft and develop a reliable, effective, and scalable data platform. Create datasets that allow for more sophisticated reporting and analytics capabilities. Mentor other engineers and analysts on data processing, data access, and manipulation techniques.\n        "}, {"title": "Senior Front End Developer ", "location": "\n            Brazil, Colombia, India, Kenya, Malaysia, Mexico, South Africa, Philippines, Nigeria \n", "description": "\n            Responsible for writing well designed, testable, readable, efficient code by using best software development practices. Supports backend data integration including third-party APIs, SDKs, Scripts, etc. 5+ years of demonstrable work experience.\n        "}, {"title": "Senior Staff Application Engineer, Security", "location": "\n            US National \n", "description": "\n            In this role, you will help refine the direction of the application security team, mentor/train the current team, and help with board and executive-level reporting. Relevant engineering work experience and hands-on technical experience. Remote work. \n        "}, {"title": "Lead Engineer, Performance Testing", "location": "\n            Atlanta, GA \n", "description": "\n            Own the design, development, and execution of load and performance testing. Lead a talented team of test engineers in building load and performance testing suites. Continually compare performance tests against production loads to ensure correct behavior.\n\n        "}, {"title": "Business Intelligence Analyst", "location": "\n            Chicago, IL, Saint Petersburg, FL \n", "description": "\n            Using data to conduct deep-dive analysis, identify root causes of business trends, and formulate actionable recommendations for your stakeholders. Being a key data-driven player in structuring an optimized plan of action to deliver comprehensive ...\n        "}, {"title": "Senior Marketing Data Analyst", "location": "\n            US National \n", "description": "\n            Work closely with digital marketing managers and the underlying data to identify growth and optimization opportunities within the marketing budget in order to maximize ROI & LTV. Discover new ways to find answers to longstanding questions. Develop A/B...\n        "}, {"title": "Senior Backend Engineer", "location": "\n            Work from Anywhere \n", "description": "\n            We're hiring across multiple teams - our tech stack across all includes Python, Django, PSQL, AWS, CloudFormation, and Ansible. Commercial experience with Python 3. An excellent understanding of relational databases. Understanding of APIs. Remote work.\n        "}, {"title": "Senior Software Engineer", "location": "\n            US National \n", "description": "\n            You will collaborate with other engineering teams on implementing new features, debugging existing features, and designing new functionality. Strong experience with Python including clear and effective unit tests. Strong communication skills. Remote.\n        "}, {"title": "People Analytics Consultant", "location": "\n            US National \n", "description": "\n            Support complex analytics projects and provide ongoing consulting support to assigned HR stakeholder groups (Field HR, Talent, DEI (Diversity, Equity, and Inclusion), Employee Listening, Compensation Community of Expertise etc.) on data driven insights...\n        "}, {"title": "Solutions Architect", "location": "\n            US National \n", "description": "\n            Partner with sales team to drive technical wins and grow company's customer base. Participate and lead GameDays with potential customers. Educate potential customers on Reliability and Chaos Engineering. Respond to RFPs/RFIs. Create viewable content.\n        "}, {"title": "Senior Software Engineer - Compute", "location": "\n            US National \n", "description": "\n            Work collaboratively with a team of software engineers and systems engineers to create and maintain the foundational platform for running infrastructure. Design, write, and deliver software to improve the availability, scalability, latency, and...\n        "}, {"title": "Software Engineer", "location": "\n            US National \n", "description": "\n            Work directly with the Product Lead to shape and inform all aspects of the product roadmap. Mentor and support other engineers in the team. Partner with the community manager to understand the wide and diverse community of software engineers, language...\n        "}, {"title": "Lead Software Engineer", "location": "\n            US National \n", "description": "\n            Work within a cross-functionalteam of engineers building software in a collaborative & agile development environment. Collaborate with engineering teams, data teams, and data scientists to design and build solutions. 7+ years of software engineering exp.\n        "}, {"title": "Salesforce Administrator", "location": "\n            Work from Anywhere \n", "description": "\n            In this Salesforce Administrator role, you are given governance to expand an already developed enterprise-level Salesforce org and large technical initiatives that greatly impact the company's ability to work at scale. This role has six core functions...\n        "}, {"title": "Senior Associate - Carbon-Free Buildings - Global Cooling Transformation Team", "location": "\n            US National (Not hiring in HI) \n", "description": "\n            Structure and guide the work of more junior team members. Design and create approaches and quantitative models to effectively address key questions and challenges posed by our research goals and clients.\nContribute publicly at conferences...\n        "}, {"title": "Analytics Manager", "location": "\n            US National \n", "description": "\n            Lead multiple work streams across the team with dependencies on different business units. Manage, mentor and develop analysts, and effectively prioritize work across the team. Individually own and drive analyses, workstreams, and high priority projects.\n        "}, {"title": "Backbook Risk Lead", "location": "\n            US National \n", "description": "\n            Develop and implement the feedback loop with Frontbook Risk Strategy, Backbook Risk Strategy, Provisions, and Product based on observed backbook performance in combination with the macroeconomic outlook. Develop, implement, and evolve repayment and...\n        "}, {"title": "Manager, Developer Support Engineering", "location": "\n            Poland \n", "description": "\n            Project manage and provide support to merchants that are executing on proposed integrations. Fix merchant issues that are highly technical and work with engineering teams to improve the developer experience. Creatively seek solutions to emergent...\n        "}, {"title": "Software Engineer", "location": "\n            Work from Anywhere \n", "description": "\n            Design and create new improvements and features, refactor and clean up code, develop web pages and review user needs. Strong skills JavaScript, Python and Django are necessary along with DevOps epp. Fully remote.\n        "}, {"title": "Site Reliability Engineer, CloudOps", "location": "\n            US National \n", "description": "\n            Build robust, easy-to-use foundational platforms and tools that enable engineering teams to provision services rapidly, consistently, and securely.\nExemplify cloud-native site reliability best practices. Write code that is performant, maintainable,...\n        "}, {"title": "Data Analyst", "location": "\n            US National \n", "description": "\n            Reporting to the Senior Business Intelligence Manager, as a Data Analyst you will design and develop metrics, reports, and analyses to drive key business decisions. You will discover trends and patterns in order to make recommendations. And you'll...\n        "}, {"title": "Internal Audit Data Analyst", "location": "\n            US National \n", "description": "\n            Participate in the strategic development of the data analytics program and methodology. Contribute to data analytics methodology and corresponding reference materials. Contribute to recurring training and support for the department. Support data...\n        "}, {"title": "Performance Driven Marketing - Principal Marketing Experimentation", "location": "\n            US National \n", "description": "\n            A key leadership position enabling the development and roll-out of world-class modern marketing capabilities. This individual possesses deep understanding of marketing analytics, testing, measurement, and strategic insights. \n        "}, {"title": "Senior Marketing Data Analyst", "location": "\n            CA, MA \n", "description": "\n            Independently synthesize automated reports and visualizations that provide useful insights in close partnership with marketing and commercial teams to expose opportunities that improve commercial funnel and marketing metrics.\n        "}, {"title": "Senior Actuarial Analyst - Care Management", "location": "\n            US National \n", "description": "\n            Lead data support and analysis underlying the overall performance of Commercial CM programs, providing holistic, end-to-end views, analysis, and insights across operational, clinical, and financial measures. Bachelor's degree & 2+ actuarial exams passed. \n        "}, {"title": "Quality Measurement and Analytics Senior Manager", "location": "\n            US National \n", "description": "\n            Drive the design and development of robust analytical models using tools such as SAS/SQL, R/Python to process large volume of data and apply an analytic mindset to collecting, parsing, managing, and automating data feedback loops in support of business...\n        "}, {"title": "Software Developer", "location": "\n            US National \n", "description": "\n            Understands and applies engineering delivery practices to create robust, predictable, and fit-to-purpose solutions that solve enterprise and market needs. Accelerates delivery time to market through agility, design & coding best practices code reuse,...\n        "}, {"title": "Application and Data Integration Engineer", "location": "\n            US National \n", "description": "\n            Plan, design, and develop data integration solutions using enterprise integration tools. Design integration components that manage data ingestion, real time streaming, batch processing, data extraction, transformation, enrichment, and loading of data...\n        "}, {"title": "Principal Quality Assurance Automation Engineer", "location": "\n            US National \n", "description": "\n            Analyze all project-specific documentation that would help to develop test scenarios and test cases for complex projects.Lead the development of detailed, comprehensive, and well-structured manual and automated test plans and test cases. Mentor others.\n        "}, {"title": "Data Analyst - Retirement Plans", "location": "\n            US National \n", "description": "\n            We are seeking a highly skilled and experienced remote Data Analyst to join Retirement Plan Sales at the company. The Data Analyst will be responsible for collecting, measuring, organizing, and analyzing data, as well as creating and applying the most...\n        "}, {"title": "Java Developer Advisor", "location": "\n            IL \n", "description": "\n            Working in an application development environment, the Java Developer Advisor acts as technical lead for an application within the scope of a project. Oversight of technical aspects for requirements, design, coding, unit testing and system testing. \n        "}, {"title": "Senior Data Scientist", "location": "\n            CT \n", "description": "\n            Develop and/or use algorithms and statistical predictive models and determine analytical approaches and modeling techniques to evaluate scenarios and potential future outcomes. Perform analyses of structured and unstructured data to solve multiple...\n        "}, {"title": "Credit Strategy Analyst", "location": "\n            US National \n", "description": "\n            You will apply your strategic and analytical skills to solve business problems. You will team with world-class professionals to develop and test strategies that ultimately impact the bottom line. You will work in a collaborative environment that values...\n        "}, {"title": "Senior Engineer - Threat Detection Analytics and Engineering ", "location": "\n            US National \n", "description": "\n             In this role, you will work with a team of skilled engineers and analysts to reliably solve complex problems, while getting hands-on experience with cutting edge technologies.We spend our time analyzing data and writing stream processing applications.\n        "}, {"title": "Data Engineer", "location": "\n            US National \n", "description": "\n            Maintain optimal data pipeline architecture. Assemble large, complex data sets that meet functional / non-functional business requirements. Implement internal process improvements in automating manual processes, optimizing data delivery, re-designing...\n        "}, {"title": "Data Engineer, Healthcare Pricing", "location": "\n            US National \n", "description": "\n            Build solutions for ingesting large amounts of healthcare payments data - claims, contract rates and demographics data, to name a few.\nWrite and modify data ingestion scripts in Python to convert raw pricing data into clean, standardized data.\n        "}, {"title": "Senior Cloud Engineer", "location": "\n            US National \n", "description": "\n            Help scale out our infrastructure as well as design and build the APIs and services that extend the capabilities of the company platform. 3+ years of experience in a senior engineering role. Proficient with TypeScript or Python, preferably both. Remote.\n        "}, {"title": "Senior Staff Product Security Engineer", "location": "\n            US National \n", "description": "\n            Product security architecture, design, engineering requirements and processes. Embedded device security testing and review. New product development security needs. Product security parameters, features, configuration policies. Product security testing.\n        "}, {"title": "Environmental Attributes Senior Analyst", "location": "\n            US National \n", "description": "\n            Manages projects with minimal oversight including inputs from peers, direct reports, and superiors. Understands task expectations and how tasks fit in the overall project. Works collaboratively with project team and client to define and achieve...\n        "}, {"title": "Data Reporting Analyst", "location": "\n            US National \n", "description": "\n            Work with various internal departments to collect source data, on a regular basis and as needed. Design and build analyses/trending/forecasting reports using Excel or other technology. Bachelor's degree and 3 - 5 years of relevant, progressive experience.\n        "}, {"title": "Digital Commerce Pricing Analyst", "location": "\n            Elkton, FL \n", "description": "\n            Responsible for performing analytics related to pricing, margin, and profitability for products, categories, and customers within our Digital Commerce businesses. These responsibilities include analysis of competitors in the Digital Commerce space. \n        "}, {"title": "Assessment Item Writer", "location": "\n            US National \n", "description": "\n            You will be responsible for writing individual questions for assessments used across the company platform. You will work with our project manager to write and review sets of questions to a pre-defined and validated specification. You will act as a...\n        "}, {"title": "Senior Python Django Backend Engineer", "location": "\n            Work from Anywhere \n", "description": "\n            Your primary focus will be collaborating with a team of developers to create and implement software applications and components. You'll have the opportunity to choose your hours and work and learn with a team of world-class engineers and designers.\n        "}, {"title": "Senior Android Engineer, Consumer Products", "location": "\n            US National \n", "description": "\n            Work cross-functionally with product, design, and other engineering counterparts to execute on product and business strategy and build novel products and features that our users will love. Contribute to the full development cycle: technical design,...\n        "}, {"title": "Senior Full Stack Engineer", "location": "\n            US National \n", "description": "\n            Shape and revolutionize the future of streaming TV. Build innovative, market-leading technologies to help content companies and streamers succeed. Participate in a 100% open environment where everyone is encouraged to share ideas, big and small. Learn...\n        "}, {"title": "Lead Health Information Management Associate", "location": "\n            US National \n", "description": "\n            Collaborate with analytic and clinical staff in the development of specialized lexicons to support data analytics and reporting. Provide guidance to others in quality metric concept, design, and definition across multiple reports and data products...\n        "}, {"title": "Manager Healthcare Analytics", "location": "\n            US National \n", "description": "\n            This job is responsible for the oversight and operations of the healthcare management analytics function. The incumbent retains responsibility for development, implementation and management of complex analytical, research, and decision support...\n        "}, {"title": "Healthcare Analyst", "location": "\n            US National \n", "description": "\n            Develop reports in Tableau (or Excel using automated formula) based on prior authorization data, complemented by claims data, to demonstrate impact on utilization and medical expense, generated by activities such as nudges, withdrawals and denials.\n        "}, {"title": "Statistical Programming Systems and Standards", "location": "\n            US National \n", "description": "\n            The contractor for System and Standards completes/submits/tracks highly detailed change requests related to security and access, and advises project teams on the appropriate changes for their needs; additionally, understands hierarchical directory...\n        "}, {"title": "Senior Manager Statistical Programming", "location": "\n            US National \n", "description": "\n            In this role, a typical day might include the following: Owning the programming aspect of a project in within the Medical Affairs subteam collaboration with related functions, partners, and external functional service providers for all programming...\n        "}, {"title": "Data Analyst", "location": "\n            US National \n", "description": "\n            Extracting, transforming and loading data from multiple disparate data sources into a common data store for further analysis. Filtering and cleansing data using pattern matching, lookup tables, scripts and complex algorithms. Examining data using a...\n        "}, {"title": "Senior Manager, Actuarial - Voluntary Products", "location": "\n            US National \n", "description": "\n            Demonstrate commitment to career development and growing financial acumen by pursuing actuarial credentials and membership in the Society of Actuaries. Prepare and analyze intermediate level data for use in actuarial experience studies, valuation or...\n        "}, {"title": "Lead Data Engineer", "location": "\n            GA, RI, TX \n", "description": "\n            You will collaborate with business partners to identify opportunities to leverage big data technologies in support of Pharmacy Personalization with a common set of tools and infrastructure to make analytics faster, more insightful, and more efficient...\n        "}, {"title": "Automation Engineer", "location": "\n            AZ, CT, IL, MA, OH, TX \n", "description": "\n            You will develop deep understanding of financial and operational data and processes across Rebate Ops, Fin Ops, and FP&A areas of PBM Finance and execute on automated solutions to improve overall business quality and compliance, create greater...\n        "}, {"title": "Senior Data Reporting Analyst", "location": "\n            US National \n", "description": "\n            This job drives and supports all activities related to collecting, analyzing, and reporting on key performance indicators including developing dashboards, scorecards, forecasting, trending, tracking results, and executive presentations for the purposes...\n        "}, {"title": "Senior Data Scientist", "location": "\n            US National \n", "description": "\n            The Senior Data Scientist role will build machine learning and AI models to deliver value to all these business units and more. Development of GLM and tree-based models to predict the profitability of each insured. Bachelor's degree and 5-7+ years of exp.\n        "}, {"title": "MS SQL Database Administrator", "location": "\n            Work from Anywhere \n", "description": "\n            Ongoing SQL query and index analysis and tuning in cooperation with Developers and Sysadmin Engineers.Provide guidance and support to Application Developers. Install, tune, implement and upgrade DBMS installations.Monitor and maintain system health. \n        "}, {"title": "Senior Information Security Engineer", "location": "\n            US National \n", "description": "\n            Engineering, maturing, and supporting a vulnerability management program for all company brands to include the identification of new vulnerabilities, automated stakeholder notifications, and remediation tracking. Bachelor's degree and 6-8 years of exp. \n        "}, {"title": "Senior Data Engineer", "location": "\n            US National \n", "description": "\n            Build data models and patterns for powering self-service data discovery. Design, build and maintain solutions that power batch and real-time processing powering millions of recommendations daily. Improve the data quality and reliability of data...\n        "}, {"title": "Senior Machine Learning Engineer - Python , ML , DE , GCP", "location": "\n            CT \n", "description": "\n            Contribute to enabling functionality related to the end-to-end ML and Feature lifecycle management on the Google Cloud Platform. Leverage and integrate the cloud native services with other standard operational and automation tools with the goal of ...\n        "}, {"title": "Senior Quality Engineer - Quality Assurance Lead", "location": "\n            Cincinnati, OH \n", "description": "\n             QA Lead will be responsible for understanding how the TMS system integrates with other systems (internal or external), collaborating with QA Tech Leads to devise a test strategy and test plan for these integrations, lead the cross-solution test effort.\n        "}, {"title": "Data Analyst", "location": "\n            New York, NY \n", "description": "\n             Maintain and populate data, create custom scripts for incorporating/ingesting external data into new spatial platforms or software products used by the conservancy employees, record databases and manual files, produce maps and/or other graphic...\n        "}, {"title": "Quality Assurance Consultant", "location": "\n            AZ, KY, MO, PA, TN, TX \n", "description": "\n            Ensure the quality of one or more applications or technologies within the construct of the application including data, platform, function, and system interfaces. Interacts with other areas of the business' technology organization to effectively develop...\n        "}, {"title": "Actuary - IVL Medicare Advantage", "location": "\n            US National \n", "description": "\n             Role is responsible for having the ability to price and certifying Individual Medicare Advantage bids for all products offered by the local market health plan.The actuary will collaborate with business partners to provide sound risk management advice.\n        "}, {"title": "Specialist, Business Insights", "location": "\n            US National \n", "description": "\n            Functions as the specialist in data extraction from databases, tables, data warehouses and other sources through R/SAS/SQL/Python. Develops, produces, and maintains inferential, statistical, ad hoc and custom analyses and modeling for functional...\n        "}, {"title": "AWS DevOps Engineer II", "location": "\n            Philadelphia, PA \n", "description": "\n            Assists in defining automated monitoring, deployment and repair strategies using a wide variety of Ops tools and monitoring platforms.Builds and maintains tools for deployment, monitoring and operations as well as troubleshoots and resolves issues.\n        "}, {"title": "DevOps Site Reliability Engineer", "location": "\n            Australia, Bangladesh, China, Hong Kong, India, Indonesia, Japan, Malaysia, New Zealand, Pakistan, Philippines, Singapore, Sri Lanka, Taiwan, Thailand, Vietnam \n", "description": "\n            Directly reporting to one of our Directors for the Operations Infrastructure Department and in close interaction with our Engineering and Customer Success teams, you will be responsible for: Cloud operations: configure clusters, deploy stuff, follow-up..\n        "}, {"title": "Senior Software Engineer, Internal Tools", "location": "\n            Macedonia \n", "description": "\n            Your day-to-day team will include a collaborative group of Front-end and Back-end Engineers, QA specialists, and a Program Manager working across our Macedonia, New York City, and Belfast offices. The Internal Tools team works on a core application...\n        "}, {"title": "Senior AWS Data Engineer", "location": "\n            Nashville, TN \n", "description": "\n            As a Senior AWS Data Engineer you will conduct Architectural analysis, build blueprints, Data/process flow diagrams and write technical use cases. Implement AWS Security protocols (Data Protections, Governance, Audit trail) for data In-transit and at...\n\n        "}, {"title": "Software Engineer 1 - Ruby", "location": "\n            US National \n", "description": "\n            Design and implement features, in tandem with other engineers and product owners. Maintain and modernize existing code, both in our data center and the cloud. Collaborate with your team to constantly improve our work and process. Program in Ruby...\n        "}, {"title": "Senior Software Engineer, Infrastructure Tools", "location": "\n            ME, NH, MA, RI, CT, NY, NJ, DE, MD, VA, NC, SC, GA, FL \n", "description": "\n            Organize raw data using solutions built by you and others. Improve software used in data pipelines and automation of database management. Prepare data needed for reports and analysis. Incorporate new techniques into...\n        "}, {"title": "Software Engineer", "location": "\n            Poland \n", "description": "\n            Design, build, and a highly durable and strongly consistent structured datastore solution. Collaborate with other teams on their database needs and provide continuous guidance on design and architecture. Design and build structured storage solutions...\n        "}, {"title": "Site Reliability Engineer", "location": "\n            Hong Kong \n", "description": "\n            Build systems for declarative application and infrastructure lifecycle management: continuous deployment, continuous integration, Kubernetes cluster management, service and workload inventory. Prioritize and help troubleshoot problems, downtime, and...\n        "}, {"title": "Senior Software Engineer", "location": "\n            Bengaluru, India \n", "description": "\n            Implement reliable, robust and scalable solutions for external integrations as well add new features, fix bugs, and drive the Degreed product forward. We value individuals who are lifelong learners and passionate about taking new challenges.\n        "}, {"title": "Software Engineer", "location": "\n            Moline, IL \n", "description": "\n            Looking for someone who has software development experience AND someone who has worked with infrastructure (server, network, data center, etc.). Both skill sets are needed to be successful. Working with APIs requires coding experience as well.\n        "}, {"title": "UX Designer", "location": "\n            United Kingdom, Germany \n", "description": "\n            Be the user's voice, designing and validating concepts, and iterating on user feedback. Work with UX Researchers to gather user data and translate outcomes to solutions. Collaborate with the UX team to align the design direction and apply it to the...\n        "}, {"title": "Senior Software Engineer, Machine Learning ", "location": "\n            BC, Canada \n", "description": "\n            Dive deep into our platform to spot opportunities for improvement. Apply mathematical sophistication to solve our customers' problems. Build applied machine learning models end to end to production. Iterate and tune algorithms and/or models with...\n        "}, {"title": "Senior Data Scientist", "location": "\n            Wellesley, MA \n", "description": "\n            The Retail Operations & Immunization Analytics team provides analytics based strategic recommendations on all initiatives in the pharmacy. Over the past year, this has included rolling out nationwide COVID-19 vaccines, testing, & medications at scale...\n        "}, {"title": "Senior Site Reliability Developer", "location": "\n            Canada \n", "description": "\n            Write testable, efficient, and reusable code suitable for continuous integration and automated deployments, that respects best practices. Plan, design and execute solutions within the infrastructure team to reach specific goals agreed upon for SLA and...\n        "}, {"title": "Senior Site Reliability Engineer", "location": "\n            Canada \n", "description": "\n            You have been responsible for running critical services that multiple customers depend upon. You understand the importance and impact that operational optimization can have on a product and the positive ripple effects that it can have across an entire...\n        "}, {"title": "Site Reliability Engineer", "location": "\n            United Kingdom \n", "description": "\n            Build systems for declarative application and infrastructure lifecycle management: continuous deployment, continuous integration, Kubernetes cluster management, service and workload inventory. Prioritize and help troubleshoot problems, downtime...\n        "}, {"title": "Principal, Data Engineer", "location": "\n            TX, OK, AR, LA, TN, MS, AL, GA, FL, KY, WV, VA, DE, MD, NC, SC \n", "description": "\n            Maintain a predictable, transparent, global operating rhythm that ensures always-on access to high-quality data for stakeholders across the company. Responsible for day-to-day data collection, transportation, maintenance/curation and access to the....\n        "}, {"title": "Senior Software Engineer", "location": "\n            US National \n", "description": "\n            Full stack engineering with Python, JavaScript, and Golang. Design, build, maintain, and deploy cloud-based systems hosted on AWS; we use EC2. Enforce coding standards & best practices. Collaborate with other teams to meet deliverables. 4+ years of...\n        "}, {"title": "Senior Analytics Engineer", "location": "\n            US National \n", "description": "\n            Work directly with stakeholders across the organization to understand business priorities and build models to support critical decision making. Create clean data models from new data sources while balancing cost, performance, and maintainability.\n        "}, {"title": "Site Reliability Engineer", "location": "\n            Canada \n", "description": "\n            Build systems for declarative application and infrastructure lifecycle management: continuous deployment, continuous integration, Kubernetes cluster management, service and workload inventory. Prioritize and help troubleshoot problems, downtime...\n        "}, {"title": "Senior Analyst, Product", "location": "\n            US National \n", "description": "\n            You will be responsible for developing insights, driving experiment design and defining KPIs for features designed to help drive better outcomes for our members. This role is for you If you are naturally curious and have an eye for scale.\n        "}, {"title": "Director of People", "location": "\n            US National \n", "description": "\n            Own the global People and Talent acquisition strategy and roadmap, resulting in >70% headcount growth. Lead and develop the People and Recruiting teams through hyper-growth.\nAccountable for organizational learning and development strategy and execution...\n        "}, {"title": "QA Tester", "location": "\n            India, Pakistan, Sri Lanka, Austria, Belgium, Denmark, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Netherlands, Norway, Poland, Portugal, Romania, Spain, Sweden, Switzerland, Ukraine, United Kingdom \n", "description": "\n            Thorough testing of a continuously updated Web service with automated tools. Catching bugs in the user experience, documenting them, and reporting them to the development team. Assisting the development team in testing sprint release candidates.\n        "}, {"title": "Data Engineer, Digitization Technology", "location": "\n            Grand Island, NY \n", "description": "\n            Responsible for delivery of various data driven applications and automations from laboratory instrumentation to the R&D data platform.\nin all phases of the R&D data platform development life cycle as appropriate; including, but not limited to gathering...\n        "}, {"title": "Senior Software Engineer, Shopping Ads Delivery", "location": "\n            Netherlands \n", "description": "\n            Build and deliver Dynamic Shopping Ads that can scale with our ads business over the next several years. Improve performance and providing out of the box automation tools to improve ROAS for Product Ads vertical. 5+ years of experience as a backend...\n        "}, {"title": "COBOL SME with Life and Annuity Domain", "location": "\n            Dallas, TX \n", "description": "\n            Represent the Development team in client discussions along with Business Analyst. Perform application enhancements by referring to the Business Specification document. Conduct Technical Research, Development, and Testing of client's business ...\n        "}, {"title": "Senior Data Scientist", "location": "\n            Germany \n", "description": "\n            Develop Machine Learning models and prototypes for deriving insights and predictions. Create narratives aimed at explaining the findings to the non-technical users of our product. Use statistical analysis, algorithms, as well as modelling techniques...\n        "}, {"title": "Extended Expertise Consultant", "location": "\n            Colorado Springs, CO \n", "description": "\n            Learn & understand the customer's business requirements and the threat landscape that is most applicable to their industry's vertical sector. Interact with Security and IT technologies relating to customer environment. Ability to communicate...\n        "}, {"title": "Staff Software Engineer, Shopping Ads Delivery", "location": "\n            Netherlands \n", "description": "\n            Build and deliver Dynamic Shopping Ads that can scale with our ads business over the next several years. 7+ years of experience as a backend engineer, deep expertise in distributed systems, data/search infrastructure. Remote - The Netherlands. Benefits.\n        "}, {"title": "Senior Financial Analyst, Payments", "location": "\n            US National \n", "description": "\n            Identify patterns in payment processing success, chargeback, and fraud rates by analyzing large quantities of data. Monitor and forecast payment-related metrics, such as acceptance rate and fraud rate, and predict customer behaviors through data...\n        "}, {"title": "Senior Analyst, Marketplace ", "location": "\n            US National \n", "description": "\n            Work with technical partners to design & implement experiments that optimize core marketplace systems like pricing algorithms, dispatch logic, and vehicle positioning.Help develop and execute against an ambitious roadmap of market expansion.Lead process.\n        "}, {"title": "Lead Analytic Consultant - Healthcare", "location": "\n            Wellesley, MA, Chicago, IL, New York, NY \n", "description": "\n            Consults with internal clients to identify opportunities to implement data science solutions to business problems at an advanced level. Acts as an analytics product owner translating business needs into analytics projects and actions.\n\n        "}, {"title": "Site Reliability Engineer - Database", "location": "\n            Work from Anywhere \n", "description": "\n            Operate and improve the RDBMS systems serving Wikimedia projects. Respond to common database issues, following documented procedures. Collaborate with SRE and other teams across the organization to ensure their specific database needs are met. \n        "}, {"title": "Staff Site Reliability Engineer - Traffic", "location": "\n            Work from Anywhere \n", "description": "\n            Performing day-to-day operational/DevOps tasks on Wikimedia's public facing infrastructure (deployment, maintenance, configuration, troubleshooting). Implementing and utilizing configuration management and deployment tools (Puppet, Kubernetes).\n        "}, {"title": "DevOps Engineer", "location": "\n            UT \n", "description": "\n            The successful DevOps Engineer/SRE will join a team focused on tooling, automation, and scripting. They will provide support in release management, deployment, and supporting development teams. The DevOps Engineer/SRE will also support the company's...\n        "}, {"title": "Lead Digital Software Architect - Martech", "location": "\n            Burlington, MA \n", "description": "\n            Lead technical architecture initiatives for multiple value streams (e.g. Agile Release Trains), helping to ensure successful product deliveries. Manage the evolution of architectural roadmaps for your domain, showing how new features are released...\n        "}, {"title": "Senior Data Scientist", "location": "\n            Austria, Belgium, Denmark, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Netherlands, Norway, Poland, Portugal, Romania, Spain, Sweden, Switzerland, Ukraine, United Kingdom \n", "description": "\n            Develop and deploy machine learning models that are able to detect fraudulent behaviours; reducing fraud and risk to the company. Mentor and coach other members of the team. You have extensive experience working with Python and SQL.\n        "}, {"title": "Linux Administrator", "location": "\n            Ogden, UT \n", "description": "\n            In this role, the Linux Administrator will join a great team, with a lot of cohesion and collaboration. This opportunity will also provide the Linux Administrator time to skill-up on technology and grow their career.Monitor system performance.\n        "}, {"title": "Research Data and Documentation Specialist", "location": "\n            Cambridge, MA \n", "description": "\n            Assist the Manager in strategy, policy, implementation, and adoption of research systems and best practices. Implement and maintain procedures and develop training materials to ensure the adoption of research data management best practices. lead planning.\n        "}, {"title": "UX Researcher", "location": "\n            United Kingdom, Germany \n", "description": "\n            Partner with product, design, engineering, plus the broader company to develop and deliver impactful research that informs decisions for key areas of a product.Collaborate and enable team members outside of the team in UX research tools and techniques.\n        "}, {"title": "Software Engineer, New Grad", "location": "\n            Poland \n", "description": "\n            Design and build our Repayments platform to build a major communication platform. Enhance and refactor core modules of the system to make it more extensible, robust and performant.Participate in technical discussions and plans to improve overall software.\n        "}, {"title": "Scientist", "location": "\n            Ridgefield, CT \n", "description": "\n            Select and benchmark methods and tools, define and perform appropriate QC measures. Apply and develop innovative analysis approaches when standard methods are not adequate. Interpret & present analysis results to coworkers and collaborators. Report data.\n        "}, {"title": "Staff Software Engineer", "location": "\n            Poland \n", "description": "\n            Design, develop, and deploy solutions that will help to bring value to the merchants' business. Partner with Analyst, Data Science, and Product engineering teams to build production machine learning models; models will decide on the pricing strategies.\n        "}, {"title": "Senior Talent Business Intelligence Analyst", "location": "\n            US National \n", "description": "\n            Lead in designing complex Business Intelligence information models, dashboards, metrics and reports utilizing standard technologies and methodologies that meet business objectives. Assess current technology for best fit. Develop multiple dashboards.\n        "}, {"title": "Workforce Planning Specialist, Senior or Lead", "location": "\n            US National \n", "description": "\n            Develop, maintain, and administer workforce planning strategies, systems and processes. Discover new opportunities and solutions for workforce planning processes by looking beyond current practices and using expertise in systems and data. Train team.\n        "}, {"title": "Learning, Measurement, and Impact Analyst", "location": "\n            Bethesda, MD \n", "description": "\n            Support an outcomes-based approach to continuous learning and quality improvement by developing and implementing systems and tools that improve our ability to collect, interpret, aggregate/disaggregate data and track progress of organizational...\n        "}, {"title": "Resilience Data Advisor", "location": "\n            US National \n", "description": "\n            Assist in the development and implementation of a data governance framework. Participate in the evaluation and analysis of continuity and resilience data gathered from the internal team and System stakeholders. Develop reporting dashboards or other...\n        "}, {"title": "Senior Data Scientist - Data Engineer, Health Equity", "location": "\n            IL \n", "description": "\n            Work in a fast-paced service-oriented environment; interacting directly with a wide portfolio of clients on solution design, product enhancement ideas, and new features for future product releases. Bachelor's degree and 3+ years of experience. Remote. \n        "}, {"title": "Data Engineer III - Mid-Senior", "location": "\n            Argentina \n", "description": "\n            Our data engineers design and develop data pipelines to integrate data across disparate systems and create tools and data sets to support data science. Work with Python, Spark SQL, Scala, TensorFlow, Keras, SKL (or Scala/DL4J) to build production-grade...\n        "}, {"title": "Data Analyst", "location": "\n            Portugal \n", "description": "\n            Understand the business processes from the marketing, sales and customer success departments. Create valuable dashboards in Tableau to generate recurring value for internal stakeholders. Use Python to identify, analyze, and interpret patterns and...\n        "}, {"title": "Senior Engineer -  Web Application Security", "location": "\n            US National \n", "description": "\n            Collaborating and utilizing your problem-solving skills in an agile environment as you work among a team of skilled engineers and analysts to address complex or difficult problems, while getting hands-on experience with cutting edge technologies.\n        "}, {"title": "Senior Data Analyst, Solution Support", "location": "\n            US National \n", "description": "\n            You will work closely with solution and client specialists, clinicians, program implementation and operation experts, informaticists, data scientists, and actuaries to produce client-facing data-driven quality and utilization intelligence.\n        "}, {"title": "Senior Data Analyst, Cardiology Program", "location": "\n            US National \n", "description": "\n            Identify target patient and provider population, and moment of influence\nDefine outcome and success metrics and set targets with clinical program leaders. Ongoing monitoring of clinical programs and pilots and refine targets. Retrospective formal...\n        "}, {"title": "Full Stack Python Developer", "location": "\n            US National \n", "description": "\n            Development Django-based websites using Python, Postgresql, etc. Work with large data sets, including scripting imports, exports, data cleaning, analysis, etc. Write effective, scalable code. Test and debug programs.\n        "}, {"title": "Data Scientist", "location": "\n            US National \n", "description": "\n            Create data pipelines and connect new data sources (claims, contract rates and demographics data, eg) to empower internal and external business folks. Model payment scenarios with attention to quality, patient volume and market benchmark rates.\n        "}, {"title": "Staff Marketing Data Developer", "location": "\n            US National \n", "description": "\n            Ensure that data collection and data transfer across the Marketing Technology ecosystem supports the organization's needs. Assist with designing, developing, testing, and maintaining data pipelines and datasets. Extract, transform and load data...\n        "}, {"title": "Senior Software Engineer - Backend", "location": "\n            CA \n", "description": "\n            In addition to writing code, you'll have the opportunity to help define the features that we build, through collaboration internally, and in some cases, talking to our customers and members to understand how we can better serve them. Bachelor's degree. \n        "}, {"title": "Aviation Consulting Associate - Airline Commercial Strategy", "location": "\n            Spain \n", "description": "\n            Participate as a member of a consulting team on client-based projects. Gather, analyze, and interpret data in support of assessments. Interface with clients to gather data and present results of studies and analyses. Write reports and presentations to...\n        "}, {"title": "Senior Operations Manager, Payment Integrity", "location": "\n            AZ, CA, CO, CT, FL, GA, IL, IA, MD, MA, MI, NH, NJ, NM, NY, NC, OH, OR, PA, RI, TN, TX, UT, VA, WA, Washington, DC \n", "description": "\n            You will manage operational payment integrity activities across the organization in support of all lines of business. This includes post and pre-pay audit functions, payment recovery processes, COB, Subrogation, medical record review and fraud, waste...\n        "}, {"title": "Senior MuleSoft Developer", "location": "\n            Jacksonville, FL \n", "description": "\n            The Senior MuleSoft Developer will design, build, own and support high-class integrations using MuleSoft technology in a hybrid solution portfolio (build and purchased, on-premise and cloud). Architect, develop, and maintain APIs through their...\n        "}, {"title": "Software Engineer", "location": "\n            San Francisco, CA \n", "description": "\n            Design, build and maintain high-performance components and sub-systems for a highly scalable and reliable data services and infrastructure that power software platform used across businesses. Work with engineering teams and neighborhood operations teams.\n        "}, {"title": "Senior Cloud Engineer", "location": "\n            US National \n", "description": "\n            Maintain and augment existing Infrastructure as a Service (IaaS) architecture for infrastructure provisioning. Architect scalable, highly available and resilient application solutions that leverage public cloud services. Collaborate with the...\n        "}, {"title": "Manager, Software Engineering", "location": "\n            US National \n", "description": "\n            Develop backend systems and moderation tools that allow new user generated content to be processed, enhanced, and rendered on our websites. Collaborate closely with other engineering leaders, designers, and product managers to define innovative ways...\n        "}, {"title": "Software Engineer, Security Engineering", "location": "\n            US National \n", "description": "\n            This job differs from some other security roles in that we want you to be able to implement some of your own suggestions to help automate our security stance. You will be a part of the Production Engineering team. Our team solves problems related to...\n        "}, {"title": "Security Technical Writer", "location": "\n            US National \n", "description": "\n            Ensure the completeness and correctness of the advisory data within the existing database. Review, fully document, curate and publish security advisories, including their descriptions, affected product data, severity, and more using our curation tooling.\n        "}, {"title": "Senior Back End Engineer", "location": "\n            Canada, or US National \n", "description": "\n            Consistently writing production-ready code that is easily testable, easily understood by other engineers, and accounts for edge cases and errors. Own the observability and monitoring for their teams' domain and uses data to suggest improvements.\n        "}, {"title": "Chief Technology Officer", "location": "\n            US National \n", "description": "\n            Lead our global Tech organization and partner with Product to own the technical vision and direction. Grow, manage and mentor a diverse leadership team that builds out Insider's world class engineering organization. Ensure our platforms scale...\n        "}, {"title": "Senior Data Analyst", "location": "\n            US National \n", "description": "\n            Collaborate closely with the product manager responsible for data insights solutions to develop new offers for the market. This will mean not only having a deep understanding of data set, it will also mean supporting the acquisition...\n        "}, {"title": "Senior Analytics Engineer", "location": "\n            US National \n", "description": "\n            Work directly with stakeholders across the organization to understand business priorities and build models to support critical decision making. Create clean data models from new data sources while balancing cost, performance, and maintainability.\n        "}, {"title": "Site Reliability Engineer", "location": "\n            Canada \n", "description": "\n            Build systems for declarative application and infrastructure lifecycle management: continuous deployment, continuous integration, Kubernetes cluster management, service and workload inventory. Prioritize and help troubleshoot problems, downtime...\n        "}, {"title": "Senior Analyst, Product", "location": "\n            US National \n", "description": "\n            You will be responsible for developing insights, driving experiment design and defining KPIs for features designed to help drive better outcomes for our members. This role is for you If you are naturally curious and have an eye for scale.\n        "}, {"title": "Director of People", "location": "\n            US National \n", "description": "\n            Own the global People and Talent acquisition strategy and roadmap, resulting in >70% headcount growth. Lead and develop the People and Recruiting teams through hyper-growth.\nAccountable for organizational learning and development strategy and execution...\n        "}, {"title": "QA Tester", "location": "\n            India, Pakistan, Sri Lanka, Austria, Belgium, Denmark, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Netherlands, Norway, Poland, Portugal, Romania, Spain, Sweden, Switzerland, Ukraine, United Kingdom \n", "description": "\n            Thorough testing of a continuously updated Web service with automated tools. Catching bugs in the user experience, documenting them, and reporting them to the development team. Assisting the development team in testing sprint release candidates.\n        "}, {"title": "Data Engineer, Digitization Technology", "location": "\n            Grand Island, NY \n", "description": "\n            Responsible for delivery of various data driven applications and automations from laboratory instrumentation to the R&D data platform.\nin all phases of the R&D data platform development life cycle as appropriate; including, but not limited to gathering...\n        "}, {"title": "Senior Software Engineer, Shopping Ads Delivery", "location": "\n            Netherlands \n", "description": "\n            Build and deliver Dynamic Shopping Ads that can scale with our ads business over the next several years. Improve performance and providing out of the box automation tools to improve ROAS for Product Ads vertical. 5+ years of experience as a backend...\n        "}, {"title": "COBOL SME with Life and Annuity Domain", "location": "\n            Dallas, TX \n", "description": "\n            Represent the Development team in client discussions along with Business Analyst. Perform application enhancements by referring to the Business Specification document. Conduct Technical Research, Development, and Testing of client's business ...\n        "}, {"title": "Senior Data Scientist", "location": "\n            Germany \n", "description": "\n            Develop Machine Learning models and prototypes for deriving insights and predictions. Create narratives aimed at explaining the findings to the non-technical users of our product. Use statistical analysis, algorithms, as well as modelling techniques...\n        "}, {"title": "Extended Expertise Consultant", "location": "\n            Colorado Springs, CO \n", "description": "\n            Learn & understand the customer's business requirements and the threat landscape that is most applicable to their industry's vertical sector. Interact with Security and IT technologies relating to customer environment. Ability to communicate...\n        "}, {"title": "Staff Software Engineer, Shopping Ads Delivery", "location": "\n            Netherlands \n", "description": "\n            Build and deliver Dynamic Shopping Ads that can scale with our ads business over the next several years. 7+ years of experience as a backend engineer, deep expertise in distributed systems, data/search infrastructure. Remote - The Netherlands. Benefits.\n        "}, {"title": "Senior Financial Analyst, Payments", "location": "\n            US National \n", "description": "\n            Identify patterns in payment processing success, chargeback, and fraud rates by analyzing large quantities of data. Monitor and forecast payment-related metrics, such as acceptance rate and fraud rate, and predict customer behaviors through data...\n        "}, {"title": "Senior Analyst, Marketplace ", "location": "\n            US National \n", "description": "\n            Work with technical partners to design & implement experiments that optimize core marketplace systems like pricing algorithms, dispatch logic, and vehicle positioning.Help develop and execute against an ambitious roadmap of market expansion.Lead process.\n        "}, {"title": "Lead Analytic Consultant - Healthcare", "location": "\n            Wellesley, MA, Chicago, IL, New York, NY \n", "description": "\n            Consults with internal clients to identify opportunities to implement data science solutions to business problems at an advanced level. Acts as an analytics product owner translating business needs into analytics projects and actions.\n\n        "}, {"title": "Site Reliability Engineer - Database", "location": "\n            Work from Anywhere \n", "description": "\n            Operate and improve the RDBMS systems serving Wikimedia projects. Respond to common database issues, following documented procedures. Collaborate with SRE and other teams across the organization to ensure their specific database needs are met. \n        "}, {"title": "Staff Site Reliability Engineer - Traffic", "location": "\n            Work from Anywhere \n", "description": "\n            Performing day-to-day operational/DevOps tasks on Wikimedia's public facing infrastructure (deployment, maintenance, configuration, troubleshooting). Implementing and utilizing configuration management and deployment tools (Puppet, Kubernetes).\n        "}, {"title": "DevOps Engineer", "location": "\n            UT \n", "description": "\n            The successful DevOps Engineer/SRE will join a team focused on tooling, automation, and scripting. They will provide support in release management, deployment, and supporting development teams. The DevOps Engineer/SRE will also support the company's...\n        "}, {"title": "Lead Digital Software Architect - Martech", "location": "\n            Burlington, MA \n", "description": "\n            Lead technical architecture initiatives for multiple value streams (e.g. Agile Release Trains), helping to ensure successful product deliveries. Manage the evolution of architectural roadmaps for your domain, showing how new features are released...\n        "}, {"title": "Senior Data Scientist", "location": "\n            Austria, Belgium, Denmark, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Netherlands, Norway, Poland, Portugal, Romania, Spain, Sweden, Switzerland, Ukraine, United Kingdom \n", "description": "\n            Develop and deploy machine learning models that are able to detect fraudulent behaviours; reducing fraud and risk to the company. Mentor and coach other members of the team. You have extensive experience working with Python and SQL.\n        "}, {"title": "Linux Administrator", "location": "\n            Ogden, UT \n", "description": "\n            In this role, the Linux Administrator will join a great team, with a lot of cohesion and collaboration. This opportunity will also provide the Linux Administrator time to skill-up on technology and grow their career.Monitor system performance.\n        "}, {"title": "Research Data and Documentation Specialist", "location": "\n            Cambridge, MA \n", "description": "\n            Assist the Manager in strategy, policy, implementation, and adoption of research systems and best practices. Implement and maintain procedures and develop training materials to ensure the adoption of research data management best practices. lead planning.\n        "}, {"title": "UX Researcher", "location": "\n            United Kingdom, Germany \n", "description": "\n            Partner with product, design, engineering, plus the broader company to develop and deliver impactful research that informs decisions for key areas of a product.Collaborate and enable team members outside of the team in UX research tools and techniques.\n        "}, {"title": "Software Engineer, New Grad", "location": "\n            Poland \n", "description": "\n            Design and build our Repayments platform to build a major communication platform. Enhance and refactor core modules of the system to make it more extensible, robust and performant.Participate in technical discussions and plans to improve overall software.\n        "}, {"title": "Scientist", "location": "\n            Ridgefield, CT \n", "description": "\n            Select and benchmark methods and tools, define and perform appropriate QC measures. Apply and develop innovative analysis approaches when standard methods are not adequate. Interpret & present analysis results to coworkers and collaborators. Report data.\n        "}, {"title": "Staff Software Engineer", "location": "\n            Poland \n", "description": "\n            Design, develop, and deploy solutions that will help to bring value to the merchants' business. Partner with Analyst, Data Science, and Product engineering teams to build production machine learning models; models will decide on the pricing strategies.\n        "}, {"title": "Senior Talent Business Intelligence Analyst", "location": "\n            US National \n", "description": "\n            Lead in designing complex Business Intelligence information models, dashboards, metrics and reports utilizing standard technologies and methodologies that meet business objectives. Assess current technology for best fit. Develop multiple dashboards.\n        "}, {"title": "Workforce Planning Specialist, Senior or Lead", "location": "\n            US National \n", "description": "\n            Develop, maintain, and administer workforce planning strategies, systems and processes. Discover new opportunities and solutions for workforce planning processes by looking beyond current practices and using expertise in systems and data. Train team.\n        "}, {"title": "Learning, Measurement, and Impact Analyst", "location": "\n            Bethesda, MD \n", "description": "\n            Support an outcomes-based approach to continuous learning and quality improvement by developing and implementing systems and tools that improve our ability to collect, interpret, aggregate/disaggregate data and track progress of organizational...\n        "}, {"title": "Resilience Data Advisor", "location": "\n            US National \n", "description": "\n            Assist in the development and implementation of a data governance framework. Participate in the evaluation and analysis of continuity and resilience data gathered from the internal team and System stakeholders. Develop reporting dashboards or other...\n        "}, {"title": "Senior Data Scientist - Data Engineer, Health Equity", "location": "\n            IL \n", "description": "\n            Work in a fast-paced service-oriented environment; interacting directly with a wide portfolio of clients on solution design, product enhancement ideas, and new features for future product releases. Bachelor's degree and 3+ years of experience. Remote. \n        "}, {"title": "Data Engineer III - Mid-Senior", "location": "\n            Argentina \n", "description": "\n            Our data engineers design and develop data pipelines to integrate data across disparate systems and create tools and data sets to support data science. Work with Python, Spark SQL, Scala, TensorFlow, Keras, SKL (or Scala/DL4J) to build production-grade...\n        "}, {"title": "Data Analyst", "location": "\n            Portugal \n", "description": "\n            Understand the business processes from the marketing, sales and customer success departments. Create valuable dashboards in Tableau to generate recurring value for internal stakeholders. Use Python to identify, analyze, and interpret patterns and...\n        "}, {"title": "Senior Engineer -  Web Application Security", "location": "\n            US National \n", "description": "\n            Collaborating and utilizing your problem-solving skills in an agile environment as you work among a team of skilled engineers and analysts to address complex or difficult problems, while getting hands-on experience with cutting edge technologies.\n        "}, {"title": "Senior Data Analyst, Solution Support", "location": "\n            US National \n", "description": "\n            You will work closely with solution and client specialists, clinicians, program implementation and operation experts, informaticists, data scientists, and actuaries to produce client-facing data-driven quality and utilization intelligence.\n        "}, {"title": "Senior Data Analyst, Cardiology Program", "location": "\n            US National \n", "description": "\n            Identify target patient and provider population, and moment of influence\nDefine outcome and success metrics and set targets with clinical program leaders. Ongoing monitoring of clinical programs and pilots and refine targets. Retrospective formal...\n        "}, {"title": "Full Stack Python Developer", "location": "\n            US National \n", "description": "\n            Development Django-based websites using Python, Postgresql, etc. Work with large data sets, including scripting imports, exports, data cleaning, analysis, etc. Write effective, scalable code. Test and debug programs.\n        "}, {"title": "Data Scientist", "location": "\n            US National \n", "description": "\n            Create data pipelines and connect new data sources (claims, contract rates and demographics data, eg) to empower internal and external business folks. Model payment scenarios with attention to quality, patient volume and market benchmark rates.\n        "}, {"title": "Staff Marketing Data Developer", "location": "\n            US National \n", "description": "\n            Ensure that data collection and data transfer across the Marketing Technology ecosystem supports the organization's needs. Assist with designing, developing, testing, and maintaining data pipelines and datasets. Extract, transform and load data...\n        "}, {"title": "Senior Software Engineer - Backend", "location": "\n            CA \n", "description": "\n            In addition to writing code, you'll have the opportunity to help define the features that we build, through collaboration internally, and in some cases, talking to our customers and members to understand how we can better serve them. Bachelor's degree. \n        "}, {"title": "Aviation Consulting Associate - Airline Commercial Strategy", "location": "\n            Spain \n", "description": "\n            Participate as a member of a consulting team on client-based projects. Gather, analyze, and interpret data in support of assessments. Interface with clients to gather data and present results of studies and analyses. Write reports and presentations to...\n        "}, {"title": "Senior Operations Manager, Payment Integrity", "location": "\n            AZ, CA, CO, CT, FL, GA, IL, IA, MD, MA, MI, NH, NJ, NM, NY, NC, OH, OR, PA, RI, TN, TX, UT, VA, WA, Washington, DC \n", "description": "\n            You will manage operational payment integrity activities across the organization in support of all lines of business. This includes post and pre-pay audit functions, payment recovery processes, COB, Subrogation, medical record review and fraud, waste...\n        "}, {"title": "Senior MuleSoft Developer", "location": "\n            Jacksonville, FL \n", "description": "\n            The Senior MuleSoft Developer will design, build, own and support high-class integrations using MuleSoft technology in a hybrid solution portfolio (build and purchased, on-premise and cloud). Architect, develop, and maintain APIs through their...\n        "}, {"title": "Software Engineer", "location": "\n            San Francisco, CA \n", "description": "\n            Design, build and maintain high-performance components and sub-systems for a highly scalable and reliable data services and infrastructure that power software platform used across businesses. Work with engineering teams and neighborhood operations teams.\n        "}, {"title": "Senior Cloud Engineer", "location": "\n            US National \n", "description": "\n            Maintain and augment existing Infrastructure as a Service (IaaS) architecture for infrastructure provisioning. Architect scalable, highly available and resilient application solutions that leverage public cloud services. Collaborate with the...\n        "}, {"title": "Manager, Software Engineering", "location": "\n            US National \n", "description": "\n            Develop backend systems and moderation tools that allow new user generated content to be processed, enhanced, and rendered on our websites. Collaborate closely with other engineering leaders, designers, and product managers to define innovative ways...\n        "}, {"title": "Software Engineer, Security Engineering", "location": "\n            US National \n", "description": "\n            This job differs from some other security roles in that we want you to be able to implement some of your own suggestions to help automate our security stance. You will be a part of the Production Engineering team. Our team solves problems related to...\n        "}, {"title": "Security Technical Writer", "location": "\n            US National \n", "description": "\n            Ensure the completeness and correctness of the advisory data within the existing database. Review, fully document, curate and publish security advisories, including their descriptions, affected product data, severity, and more using our curation tooling.\n        "}, {"title": "Senior Back End Engineer", "location": "\n            Canada, or US National \n", "description": "\n            Consistently writing production-ready code that is easily testable, easily understood by other engineers, and accounts for edge cases and errors. Own the observability and monitoring for their teams' domain and uses data to suggest improvements.\n        "}, {"title": "Chief Technology Officer", "location": "\n            US National \n", "description": "\n            Lead our global Tech organization and partner with Product to own the technical vision and direction. Grow, manage and mentor a diverse leadership team that builds out Insider's world class engineering organization. Ensure our platforms scale...\n        "}, {"title": "Senior Data Analyst", "location": "\n            US National \n", "description": "\n            Collaborate closely with the product manager responsible for data insights solutions to develop new offers for the market. This will mean not only having a deep understanding of data set, it will also mean supporting the acquisition...\n        "}, {"title": "Senior Marketing Data Analyst", "location": "\n            CA, OR, WA \n", "description": "\n            Work with other data scientist to measure the success of one of the largest products in the company. This includes regular evergreen support. Work with Cloud Security PMs, Engineers, and Designers to help build better products and make data driven...\n        "}, {"title": "Data Analytics Engineer", "location": "\n            US National \n", "description": "\n            Build data models to support our modern clinical health record system - help our clinicians know where to triage and improve on through modeling and BI tools. Implement data pipelines as we work on research publications around our protocols and...\n        "}, {"title": "Software Engineer ", "location": "\n            US National \n", "description": "\n            Participate in the complete software development life cycle. Work with operations team to prepare and execute releases. Contribute ideas to the architecture and design of new systems and tools. Improve and enhance existing systems and tools. \n\n        "}, {"title": "Staff Product Security Developer", "location": "\n            Canada, or US National \n", "description": "\n            Support engineers across the SDL as an application security subject matter expert, including design reviews, threat modeling, code review, and penetration testing. Perform deep, technical security assessments to ensure services follow secure design...\n        "}, {"title": "Senior Backend Developer", "location": "\n            US National \n", "description": "\n            Directly increase revenue and improve our bottom line by rewriting our billing and collections system. Make our business more efficient by building internal software, and automating manual data movements tasks. 4+ years of experience...\n        "}, {"title": "Full-Stack Software Engineer", "location": "\n            US National \n", "description": "\n            Build a modern clinical health record system, EHR - help us bring great user experiences, privacy, and data security to the clinical setting. Work with internal support teams so they can offer the best experience to our members. Passion to tackle...\n        "}, {"title": "Data Scientist - Machine Learning", "location": "\n            US National \n", "description": "\n            Use modern data analytics and business intelligence tools (ex: R, SAS, Python, Splunk, ITSI, Pyramid, Power BI) to mine data from systems, compile and compare data sources, and identify impactful trends or insight related to systems performance...\n        "}, {"title": "Software Engineer", "location": "\n            San Francisco, CA \n", "description": "\n            Work with cross-functional and agile teams to translate product requirements into user-facing applications to support company growth. Analyze users' needs and then design, develop, and test software to meet those needs. Design each piece of application.\n        "}, {"title": "Insights Program Manager", "location": "\n            US National \n", "description": "\n            Creating requirements and project plans for analytic programs, tools, or narratives and re-prioritize based on impact and effort to complete. Leveraging SQL++ to extract necessary data and build out subsequent visualizations in Looker and internal...\n        "}, {"title": "Senior Accountant", "location": "\n            Canada \n", "description": "\n            Perform month-end and quarter-end closing procedures, including consolidation and eliminations. Ensure processing of payments for vendors. Review and post bank and other journal entries. Prepare and review account reconciliations and detailed...\n        "}, {"title": "Implementation Consultant - GRC Solutions ", "location": "\n            US National \n", "description": "\n            The Implementation Consultant directly interfaces with our customers and partners to deliver solutions within current Workiva products that achieve customer outcomes. This role is focused on documentation, continued learning, and enablement for...\n        "}, {"title": "AWS - Cloud Architect", "location": "\n            US National \n", "description": "\n            Responsible for leading a blended team of developers to design and build the company's US Connection Point platform in support of a suite of eligibility and enrollment solutions for federal agencies. Bachelor's degree from an accredited college or...\n        "}, {"title": "Manager, Product Development Analytics", "location": "\n            RI \n", "description": "\n            As a member of the Retail Pharmacy Product Development organization, you will be responsible for the design, development, and delivery of analytic solutions. You will collaborate with business partners from product development and management...\n        "}, {"title": "Lead Software Engineer", "location": "\n            Hartford, CT, Alpharetta, GA, Northbrook, IL, Woonsocket, RI, Irving, TX \n", "description": "\n            The Lead Data Engineer will execute the Data Engineering strategy for the Accordant Rare Disease product, working in partnership with a team of Data Scientists and Sales Leads. 7 or more years of progressively complex related experience.\n        "}, {"title": "Senior Manager, Enterprise Systems Modeling and Forecasting", "location": "\n            US National \n", "description": "\n            The Enterprise Systems Modeling and Forecasting Senior Manager will provide expert review of other team members capacity modeling deliverables and develop statistical and analytical capacity models for assigned systems using proprietary and other tools.\n        "}, {"title": "Senior Software Engineer, Ads, Ad Formats", "location": "\n            ON, Canada \n", "description": "\n            Work with product managers to design and implement Ads products.Collaborate closely with the platform and data teams while building new features.Lead the processes needed to improve operational stability and improving code quality, delivering dashboards.\n        "}, {"title": "Engineering Lead", "location": "\n            Canada \n", "description": "\n            Oversee the technology process and progress throughout any given project, making technical decisions and jumping into the code alongside your team as needed. Lead client presentations and conversations about your team's work. Coach and mentor others.\n        "}, {"title": "Senior Community Advocate", "location": "\n            Bulgaria, Croatia, Cyprus, Czech Republic, Egypt, Israel, Kenya, Lebanon, Luxembourg, Malta, Nigeria, Oman, Qatar, Romania, Saudi Arabia, Serbia, South Africa, Ukraine, United Arab Emirates, United Kingdom \n", "description": "\n            Foster the Community in Europe, Middle East, and Africa (EMEA) with a focus on the Nordics (Netherlands, Denmark, Belgium, Sweden, Finland). Create technical content around the Elastic Stack for talks, blog posts, videos, and demos. Speak at events.\n        "}, {"title": "Python Software Engineer", "location": "\n            US National \n", "description": "\n            Design and write clean, scalable, production code (our backend team primarily works in Python, and our frontend team works primarily in JavaScript). Refactor code for improved performance, stability, and scalability. Develop automatic tests.\n        "}, {"title": "Senior Energy Market Analyst", "location": "\n            US National \n", "description": "\n            Perform quantitative analysis that combines technical considerations, economic factors, market rules, and regulatory/policy developments. \nBe able to work both independently and collaboratively. Take ownership of complex projects. Assimilate information.\n        "}, {"title": "Energy Analytics Developer - Optimization", "location": "\n            US National \n", "description": "\n            Solve complex analytic problems to make mission critical decisions for energy supply by Translating requirements into model formulation, Implementing forecasting and optimization models for operation and valuation of renewable resources.\n        "}, {"title": "Data Engineer", "location": "\n            Sunnyvale, CA \n", "description": "\n            Design, build and launch extremely efficient and reliable data pipelines to move data across a number of platforms including Data Warehouse, online caches and real-time systems. Build data expertise and own data quality for allocated areas of...\n        "}, {"title": "Software Engineer", "location": "\n            US National \n", "description": "\n            Write clear, concise, well-structured, well-tested code that provides new features and improvements to existing services using Python, Javascript, and React. Partner with talented engineers in an Agile environment to help to build a highly scalable...\n        "}, {"title": "Senior Software Engineer", "location": "\n            US National \n", "description": "\n            Work with talented engineers to help to build highly scalable product recommendation services. Write clear, concise, well-structured, and well-tested code that provides new features and improvements to existing services, using Python, JavaScript/React...\n        "}, {"title": "Senior Python Developer", "location": "\n            US National \n", "description": "\n            Write simple, well-structured, well-tested code that provides new features and improvements to existing services, using Python, React, JavaScript, Druid, and SQL. Research and integrate best of breed technologies/frameworks/libraries. Ship code to our...\n        "}, {"title": "Salesforce Enterprise Architect", "location": "\n            US National \n", "description": "\n            Collaborating with solution architects, IT leadership, and delivery teams to ensure alignment with target and reference architectures, provide guidance, solicit feedback, and identify enterprise IT needs.\n        "}, {"title": "Principal Software Engineer", "location": "\n            US National \n", "description": "\n            Lead a technical team of developers engaged in developing software for the bank. Development of IT strategies/solutions for Banking and/or Financial services. Mentor, lead and manage multiple Java teams. Ensure cutting edge solutions using the ...\n        "}, {"title": "Senior Cloud Engineer", "location": "\n            US National \n", "description": "\n            Architect, design, implement and support business critical cloud-based Platform solutions with automation-first mindset, observability, container design patterns and best of breed cloud tools and architecture practices. Contribute to container, micro...\n        "}, {"title": "Software Engineer I", "location": "\n            US National \n", "description": "\n            Design, modify, develop and implement technology solutions; building modern, architecturally sound components, tools, and applications to meet mission-driven strategic business goals. Participate in an environment rapidly transforming to the Agile ...\n        "}, {"title": "Senior Software Engineer - Backend", "location": "\n            US National \n", "description": "\n            Build, evolve, deploy, monitor, and maintain backend services to power critical user experiences with focus on high availability, low latency and scalability. Provide backend services technical leadership for your cross-functional team.\n        "}, {"title": "Senior Financial Data Analyst", "location": "\n            US National \n", "description": "\n            Engage with leadership to identify areas where analytics can drive business value, frame business problems into analytic questions, and influence strategic decision making by presenting sophisticated data analytics in a simple, clear, and meaningful way.\n\n        "}, {"title": "Principal Scientist", "location": "\n            US National \n", "description": "\n            Manage researchers and engineers implementing research prototypes: identify risks, plan work, monitor progress, review designs and code used in prototypes, as well as adapt plans as we learn more about the sponsor's needs and the benefits/deficiencies...\n        "}, {"title": "Senior DevOps Engineer", "location": "\n            Work from Anywhere \n", "description": "\n            Consulting with management on the operational requirements of software solutions. Effectively communicating with multiple teams, departments, and management representatives. Contributing expertise on information system options, risk, and operational...\n        "}, {"title": "DevOps Manager - Architect", "location": "\n            Work from Anywhere \n", "description": "\n            Managing the team of DevOps engineers. DevOps project planning and management with best practices in mind: prioritize work based on business and developer requirements.\nEffectively communicating with multiple teams, departments, and management...\n        "}, {"title": "Network Specialist", "location": "\n            Germany \n", "description": "\n            In this role, you will be an important building block in providing our free and professional services to our customers. You will also provide the foundation for our researchers to train new, even more sophisticated neural networks.\n        "}, {"title": "Data Analyst", "location": "\n            United Kingdom \n", "description": "\n            Execution: You will assist with manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources. You will drive the corporate security posture by telling stories with data using data visualization tools, verbal ability...\n        "}, {"title": "Actuary - Medicare", "location": "\n            IL, NC, NJ \n", "description": "\n            A qualified candidate in this role will assist in preparing a monthly report that summarizes the experience for Medicare line of business.Data is pulled at the member level and then bucketed according to various attributes to help assist with analysis.\n        "}, {"title": "Senior Demand Planning Modelling Analyst", "location": "\n            Needham, MA \n", "description": "\n            Maintain detailed forecast accuracy matrix including PE- Percentage Error, APE  Absolute Percent Error, MAPE  Mean Absolute Percent Error and WMAPE- Weighted Mean Absolute Percent Error across product Categories and account teams.\n        "}, {"title": "DevOps Engineer", "location": "\n            Germany, United Kingdom \n", "description": "\n            Experience in System Engineering or Backend Engineering role. GitOps mindset with a desire to reduce toil and automate everything. Results-driven, self-starter approach to new projects. Deep Linux system administrator knowledge and experience.\n        "}, {"title": "Software Engineer", "location": "\n            Poland \n", "description": "\n            Design and build our Repayments platform to build a major communication platform for vendors.Enhance and refactor core modules of the system to make it more extensible, robust and performant.Participate in technical discussions and plans. Plan software.\n        "}, {"title": "Senior Cloud Security Engineer", "location": "\n            San Francisco, CA \n", "description": "\n            Deploy services to provision secure by default infrastructure that meets needs of both security, backend and product engineering teams.Design and implement security monitoring for Amazon Web Services (AWS) Cloud Infrastructure, Kubernetes, and Serverless.\n        "}, {"title": "Actuarial Associate III", "location": "\n            US National \n", "description": "\n            Responsible for equity hedging program for Fixed Indexed Annuity from an ALM perspective.Responsible for Key Rate Duration reporting.Contribute to the preparation, review, and analysis of various reports related to ALM.Document existing processes.\n        "}, {"title": "Business Intelligence Analyst 2", "location": "\n            US National \n", "description": "\n            You will be part of a highly motivated, innovative, and high-performing team where each team member is responsible for partnering with stakeholders and leaders to execute on strategic or non-strategic initiatives. Gather business needs. Analyze data.\n        "}, {"title": "Software Engineer, Developer Advocate, Minsk", "location": "\n            Belarus \n", "description": "\n            Championing best practices for building and deploying services at scale.Design, build and maintain tooling and services to improve efficiency and reliability of our platform.Work with product engineering teams to understand their use cases,. Debug issues.\n        "}, {"title": "Data Scientist ,Rider App, Minsk", "location": "\n            Belarus \n", "description": "\n             You will identify and scope opportunities, shape priorities, recommend solutions, design experiments, and measure impact. Leverage data and analytic frameworks to identify opportunities for growth and efficiency. Associate's degree and 3+ years of exp. \n        "}, {"title": "Staff Software Engineer, Backend - Comms Platform", "location": "\n            Poland \n", "description": "\n            Build and maintain mission critical services, tooling and data pipelines that deliver effective, compliant transactional and engagement messages to customers. Lead efforts to help shape the future technical direction of the team. Drive project planning. \n        "}, {"title": "Senior Software Engineer, Backend - Comms Platform", "location": "\n            Poland \n", "description": "\n            Build and maintain mission-critical services, tooling, and data pipelines that deliver effective, compliant transactional and engagement messages to our customers. 4-6 yrs as a software engineer with leadership responsibilities and experience mentoring...\n        "}, {"title": "Senior Staff Site Reliability Engineer", "location": "\n            San Jose, CA \n", "description": "\n            Operational duties for our cloud based products - deployments, on-call, incident management. Design and deploy various platform related systems - data stores, monitoring tools, event streaming platforms, etc. Management of container-based architecture.\n        "}, {"title": "Data Scientist", "location": "\n            San Francisco, CA \n", "description": "\n            Conduct in-depth analysis on Company data, analyzing community growth, platform engagement, and trust and & safety questions. Partner with cross-functional teams to support product development efforts (including product, design, engineering, marketing...\n        "}, {"title": "Senior Technical Artist ", "location": "\n            Work from Anywhere \n", "description": "\n            As a Senior Technical Artist, you will collaborate across art disciplines to identify best practices for content creation, develop scripts/tools and automation for artists and animators, and collaborate with the engineering team to develop best...\n        "}]