[{"title": "Senior DevOps Engineer", "location": "\n            Work from Anywhere \n", "description": "\n            Consulting with management on the operational requirements of software solutions. Effectively communicating with multiple teams, departments, and management representatives. Contributing expertise on information system options, risk, and operational...\n        "}, {"title": "DevOps Manager - Architect", "location": "\n            Work from Anywhere \n", "description": "\n            Managing the team of DevOps engineers. DevOps project planning and management with best practices in mind: prioritize work based on business and developer requirements.\nEffectively communicating with multiple teams, departments, and management...\n        "}, {"title": "Network Specialist", "location": "\n            Germany \n", "description": "\n            In this role, you will be an important building block in providing our free and professional services to our customers. You will also provide the foundation for our researchers to train new, even more sophisticated neural networks.\n        "}, {"title": "Data Analyst", "location": "\n            United Kingdom \n", "description": "\n            Execution: You will assist with manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources. You will drive the corporate security posture by telling stories with data using data visualization tools, verbal ability...\n        "}, {"title": "Actuary - Medicare", "location": "\n            IL, NC, NJ \n", "description": "\n            A qualified candidate in this role will assist in preparing a monthly report that summarizes the experience for Medicare line of business.Data is pulled at the member level and then bucketed according to various attributes to help assist with analysis.\n        "}, {"title": "Senior Demand Planning Modelling Analyst", "location": "\n            Needham, MA \n", "description": "\n            Maintain detailed forecast accuracy matrix including PE- Percentage Error, APE  Absolute Percent Error, MAPE  Mean Absolute Percent Error and WMAPE- Weighted Mean Absolute Percent Error across product Categories and account teams.\n        "}, {"title": "DevOps Engineer", "location": "\n            Germany, United Kingdom \n", "description": "\n            Experience in System Engineering or Backend Engineering role. GitOps mindset with a desire to reduce toil and automate everything. Results-driven, self-starter approach to new projects. Deep Linux system administrator knowledge and experience.\n        "}, {"title": "Software Engineer", "location": "\n            Poland \n", "description": "\n            Design and build our Repayments platform to build a major communication platform for vendors.Enhance and refactor core modules of the system to make it more extensible, robust and performant.Participate in technical discussions and plans. Plan software.\n        "}, {"title": "Senior Cloud Security Engineer", "location": "\n            San Francisco, CA \n", "description": "\n            Deploy services to provision secure by default infrastructure that meets needs of both security, backend and product engineering teams.Design and implement security monitoring for Amazon Web Services (AWS) Cloud Infrastructure, Kubernetes, and Serverless.\n        "}, {"title": "Actuarial Associate III", "location": "\n            US National \n", "description": "\n            Responsible for equity hedging program for Fixed Indexed Annuity from an ALM perspective.Responsible for Key Rate Duration reporting.Contribute to the preparation, review, and analysis of various reports related to ALM.Document existing processes.\n        "}, {"title": "Business Intelligence Analyst 2", "location": "\n            US National \n", "description": "\n            You will be part of a highly motivated, innovative, and high-performing team where each team member is responsible for partnering with stakeholders and leaders to execute on strategic or non-strategic initiatives. Gather business needs. Analyze data.\n        "}, {"title": "Software Engineer, Developer Advocate, Minsk", "location": "\n            Belarus \n", "description": "\n            Championing best practices for building and deploying services at scale.Design, build and maintain tooling and services to improve efficiency and reliability of our platform.Work with product engineering teams to understand their use cases,. Debug issues.\n        "}, {"title": "Data Scientist ,Rider App, Minsk", "location": "\n            Belarus \n", "description": "\n             You will identify and scope opportunities, shape priorities, recommend solutions, design experiments, and measure impact. Leverage data and analytic frameworks to identify opportunities for growth and efficiency. Associate's degree and 3+ years of exp. \n        "}, {"title": "Staff Software Engineer, Backend - Comms Platform", "location": "\n            Poland \n", "description": "\n            Build and maintain mission critical services, tooling and data pipelines that deliver effective, compliant transactional and engagement messages to customers. Lead efforts to help shape the future technical direction of the team. Drive project planning. \n        "}, {"title": "Senior Software Engineer, Backend - Comms Platform", "location": "\n            Poland \n", "description": "\n            Build and maintain mission-critical services, tooling, and data pipelines that deliver effective, compliant transactional and engagement messages to our customers. 4-6 yrs as a software engineer with leadership responsibilities and experience mentoring...\n        "}, {"title": "Senior Staff Site Reliability Engineer", "location": "\n            San Jose, CA \n", "description": "\n            Operational duties for our cloud based products - deployments, on-call, incident management. Design and deploy various platform related systems - data stores, monitoring tools, event streaming platforms, etc. Management of container-based architecture.\n        "}, {"title": "Data Scientist", "location": "\n            San Francisco, CA \n", "description": "\n            Conduct in-depth analysis on Company data, analyzing community growth, platform engagement, and trust and & safety questions. Partner with cross-functional teams to support product development efforts (including product, design, engineering, marketing...\n        "}, {"title": "Senior Technical Artist ", "location": "\n            Work from Anywhere \n", "description": "\n            As a Senior Technical Artist, you will collaborate across art disciplines to identify best practices for content creation, develop scripts/tools and automation for artists and animators, and collaborate with the engineering team to develop best...\n        "}, {"title": "Site Reliability Engineer, Services", "location": "\n            US National \n", "description": "\n            Write and ship code in Python. Manage infrastructure in AWS and GCP using Terraform and Helm. Diagnose and debug production incidents and then improve systems to prevent the problem from recurring. Work with other SREs and software development teams...\n        "}, {"title": "Senior Site Reliability Engineer", "location": "\n            US National \n", "description": "\n            Design, maintain and improve automation code in Python. Build CI/CD orchestration. Diagnose and debug production incidents and then improve systems to prevent the problem from recurring. Be part of a 24/7 on-call support team. Collaborate with software...\n        "}, {"title": "Enterprise Search - Ingestion - Software Engineer II", "location": "\n            Bulgaria, Croatia, Cyprus, Czech Republic, Egypt, Israel, Kenya, Lebanon, Luxembourg, Malta, Nigeria, Oman, Qatar, Romania, Saudi Arabia, Serbia, South Africa, Ukraine, United Arab Emirates, United Kingdom \n", "description": "\n            You will be building product enhancements for the ingestion mechanisms for Enterprise Search. It could be new features for the connector framework or the web crawler, new third-party integrations, or building developer tools to ease data ingestion.\n        "}, {"title": "Director of Cloud Operations", "location": "\n            US National \n", "description": "\n            Define the cloud operations strategy and ongoing improvement programs that enable partners to rapidly deliver products using repeatable, scalable, observable, and secure industry-standard solutions, while ensuring cost and resource utilization efficiency.\n        "}, {"title": "Senior Security Engineer - Security Applications Development", "location": "\n            US National \n", "description": "\n            This position will be responsible for writing and maintaining code in areas like cryptography, cloud security automation, detection, and other security areas. As a security engineer you will also work closely with the rest of the SecEng team and other...\n        "}, {"title": "Cloud Field Engineer - Americas", "location": "\n            US National \n", "description": "\n            Work across the entire Linux stack, from kernel, networking, storage, to applications. Coach and develop your colleagues where you have insights. University degree in Computer Science or related software engineering expertise. \n        "}, {"title": "Business Information Consultant", "location": "\n            GA, FL, VA \n", "description": "\n            Creates and maintains databases to track business performance. Analyzes data and summarizes performance using summary statistical procedures. Develops and analyzes business performance reports (e.g. for claims data, provider data, utilization data) and...\n        "}, {"title": "Business Data Analyst I", "location": "\n            Mountain View, CA \n", "description": "\n            Looking for a Business Data Analyst. Strong SQL and Python skills. Significant experience building reports using dashboard tools such as Tableau. Experience setting up automated workflows and ETL jobs using tools such as Tidal. Pay Rate :$60- $67/hr.\n        "}, {"title": "Automation Engineer", "location": "\n            Argentina, Bolivia, Brazil, Chile, Colombia, Ecuadaor, Guyana, Paraguay, Peru, Suriname, Uruguay, Venezeula \n", "description": "\n            For this role, your primary focus will be collaborating with a team of developers to create and implement software applications and components. You'll have the opportunity to choose your hours and work and learn with a team of world-class engineers and...\n        "}, {"title": "Director of Sales", "location": "\n            US National \n", "description": "\n            You'll continuously analyze the sales funnel to determine opportunities for growth. You'll speak with lots of customers and listen to customer calls. You have several years of experience in management consulting, finance, growth marketing, product...\n        "}, {"title": "Principal Software Developer", "location": "\n            TX \n", "description": "\n            The Principal Software Developer (PSD) is responsible for the delivery of solutions that result in a remarkable experience for client's members within a highly collaborative agile software development environment. Expertise with SOA patterns and...\n        "}, {"title": "Senior Environmental, Social, and Governance Analyst, Power Sector", "location": "\n            US National \n", "description": "\n            Compiling data and performing timely in-house analysis on investor-owned utilities and independent power producers, their climate targets, net zero strategies and investment plans.Developing a deep understanding of the utility business model. \n        "}, {"title": "Senior Growth Marketing Analyst", "location": "\n            United Kingdom \n", "description": "\n            Be a partner to everyone on the Marketing team to help make important strategic decisions, own & track user acquisition and activation metrics, and proactively discover new data trends. You have advanced data analysis skills. Communication skills. \n        "}, {"title": "Staff Software Engineer, Ads - Product Catalogs", "location": "\n            Netherlands \n", "description": "\n            Work with product managers to design and implement Ads products. Collaborate closely with the platform and data teams while building new features. 7+ years of software development experience in one or more general-purpose programming languages. Remote. \n        "}, {"title": "Principal Data Scientist", "location": "\n            Ireland \n", "description": "\n            Query, organize, integrate and clean data from multiple sources including both structured and unstructured data. Leading data science initiatives throughout the entire model life cycle to improve the performance of the revenue operations group in...\n        "}, {"title": "Go-To-Market Strategy Data Analyst, Systems", "location": "\n            Ireland \n", "description": "\n            You will be the data expert, responsible for building robust data models to define and report on key success metrics for the product teams, answer complex business questions using data, and identify strategic opportunities to accelerate GTM efficiency...\n        "}, {"title": "Data Scientist II", "location": "\n            Ann Arbor, MI \n", "description": "\n            Analyze, build, test, and implement models that utilize various and diverse data sets to solve problems related to autonomous and shared transportation. Build and implement machine learning and statistical models that extract meaningful insights from...\n        "}, {"title": "Senior IT Operations Engineer", "location": "\n            ON, Canada, BC, Canada \n", "description": "\n            Administer, keep up to date on new features and releases, and identify opportunities for better automation or features on a wide variety of SaaS applications. Seize opportunities across the IT Operations & Services teams to eliminate manual work.\n        "}, {"title": "Senior Data Infrastructure Engineer", "location": "\n            Mexico \n", "description": "\n            Hands on deployment of data warehouse systems and tools like SiSense Fusion, Databricks, Tableau. Building infrastructure as code framework using Chef, Terraform, EKS and generally containerized deployments collaborating with our SRE, Cloud...\n        "}, {"title": "Senior IT Engineer", "location": "\n            ON, Canada, BC, Canada \n", "description": "\n            Administer, keep up to date on new features and releases, and identify opportunities for better automation or features on a wide variety of SaaS applications (OKTA, g-suite, slack, JIRA etc.). Seize opportunities across the IT Operations & Services...\n        "}, {"title": "Epidemiologist", "location": "\n            Titusville, NJ \n", "description": "\n            Partner with other groups at company to design and execute epidemiologic studies using real world data to assess safety. A priority focus is on surveillance studies to meet requirements using claims, electronic medical records, registries, and...\n        "}, {"title": "Chief Architect", "location": "\n            US National \n", "description": "\n            Help the company set its future technical direction, anticipating what problems we need to solve today to support development 1-2 years out. You'll partner with Engineering, Product, and Data Science leadership to develop requirements and ...\n        "}, {"title": "Data Analytics Facilitator", "location": "\n            London, United Kingdom \n", "description": "\n            Create and deliver engaging, authentic industry-leading webinars aligned to their areas of deep expertise. Ensure learner understanding of the curriculum, course content and key concepts. Bring the content to life through a real-life relevance lens...\n        "}, {"title": "Data Analytics Assistant Facilitator ", "location": "\n            London, United Kingdom \n", "description": "\n            The Assistant Facilitator will support social learning discussions by posting and responding to comments throughout the career accelerator, via the course platform. Bachelor's degree and extensive full lifecycle Data Analytics experience. Remote work. \n        "}, {"title": "Senior Insurance Data Scientist", "location": "\n            AZ, CO, CT, FL, GA, IA, IL, IN, KS, MA, MI, MN, MO, NC, NJ, OK, SC, TN, TX, UT, WI \n", "description": "\n            Working alongside our actuarial and insurance product management teams, you'll leverage statistical techniques to more accurately segment our customers and build new pricing features. Experience in Property and Casualty and 3+ years of experience. Remote.\n        "}, {"title": "Senior Auto Data Scientist, Pricing Research and Development", "location": "\n            AZ, CO, CT, FL, GA, IA, IL, IN, KS, MA, MI, MN, MO, NC, NJ, OK, SC, TN, TX, UT, WI \n", "description": "\n            Working alongside our actuarial and insurance product management teams, you'll leverage statistical techniques to more accurately segment our customers and build new pricing features. 3+ years of experience with applying advanced quantitative or...\n        "}, {"title": "Senior Sales Engineer", "location": "\n            US National \n", "description": "\n            Assess prospective customer needs and uncover requirements for solutions. Remove technology-related buying objections from the sales opportunity. Demonstrate products to technical and non-technical audiences, at executive and/or technical levels...\n        "}, {"title": "Senior Software Engineer, Data Platform", "location": "\n            US National \n", "description": "\n            Design and implement large scale, high-performance data processing systems. Design and implement platform data services with reliability, flexibility, and scalability. 12 years of relevant experience in data engineering, data processing and data...\n        "}, {"title": "Principal Software Engineer", "location": "\n            US National \n", "description": "\n            Work closely in our engineering team to tackle a wide variety of technical challenges in building efficient and scalable software, delivering quality features and a great customer experience. Lead the design, development, deployment of complex...\n        "}, {"title": "Software Developer Consultant", "location": "\n            US National \n", "description": "\n            5-7 activities and outcomes that require a significant amount of time and/or periodic tasks and outcomes that are critical to the job. Directs work on all phases of application development. Serves as the technical expert on large-scale efforts across...\n        "}, {"title": "Senior Research Scientist", "location": "\n            US National \n", "description": "\n            Define the data strategy, including creating metrics with existing systems to understand our products and policies, and designing the next-generation intelligent systems to improve our real estate pricing and operations practices. Build models...\n        "}, {"title": "Backend Engineer", "location": "\n            US National \n", "description": "\n            We are looking for an experienced, talented, and dedicated backend engineer to join our development team. This role is ideal for a detailed oriented developer who is comfortable with a mix of coding, devops, and QA/data validation. Our business has...\n        "}]