[{"title": "Director - Reinsurance", "location": "\n            New York, NY, Bloomington, MN \n", "description": "\n             Focus on broking traditional and alternative / structured reinsurance solutions. Is willing to participate in helping in the development of sales and marketing strategy designed to cultivate revenue generation opportunities. Develop relationships.\n        "}, {"title": "Senior Embedded Engineer, Test Fixtures", "location": "\n            Toronto, ON, Canada \n", "description": "\n            You will be a lead player for development and integration of automated software that controls our fixtures in high-volume manufacturing. Aside from test fixture development, you will also be responsible for occasionally supporting test fixtures...\n        "}, {"title": "Senior Software Developer Pharmacy Domain", "location": "\n            Pittsburgh, PA \n", "description": "\n            Design and develop software programs to meet customer and business requirements. Coordinate systems analysis, systems development and implementation activities to ensure customer requirements are met or exceeded. Organize and prepare program and system...\n        "}, {"title": "Data Engineer", "location": "\n            Macedonia \n", "description": "\n            You'll be a catalyst for extracting value from internal and external data sources which in turn will be used to fuel automation pipelines and to help our pizzerias partners run their businesses in a data-driven manner. You'll code daily...\n        "}, {"title": "Data Analytics Professional - Marketing Operations", "location": "\n            Brazil \n", "description": "\n            Create models (dashboards, KPI, statics modes) to drive business goals. Teach about data and generate insights for many teams. Develop and implement data analytics models to maximize the lifetime of the users. Develop A/B tests to understand...\n        "}, {"title": "Support Engineer", "location": "\n            US National \n", "description": "\n            You will be responsible for helping to investigate and triage customer support issues while helping track down any underlying bugs. You will help the team by creating tickets for bugs and working directly with engineers to identify their root cause. \n        "}, {"title": "Cloud Engineer", "location": "\n            Manchester, United Kingdom \n", "description": "\n            We are looking for experienced Cloud Engineers to join our team following continuous growth and success in the UK Government sector. You must be skilled in a range of AWS services, and show a keenness to keep up to date with the latest releases. \n        "}, {"title": "Senior Reporting Analyst - Data, Analytics, and Automation - DAA", "location": "\n            AZ, CT, IL, RI \n", "description": "\n            You will work with pharmacy and member specific claims data including, but not limited to, financial and operational information supporting state and federal compliance reporting. You will be responsible for standard and ad-hoc client and regulatory...\n        "}, {"title": "DevOps Engineer", "location": "\n            Cincinnati, OH \n", "description": "\n            The DevOps Engineer will be working on our client's Application Platform. As part of the platform Data track, we are looking for DevOps Engineers to help us with automating and building scripts to provision infrastructure for Azure data platform services.\n        "}, {"title": "Senior Data Engineer", "location": "\n            Cincinnati, OH \n", "description": "\n            The Senior Data Engineer will present opportunities with cost/benefit analysis to leadership to shape sound architectural decisions, lead the analysis of the technology environment to detect critical deficiencies and recommend solutions...\n        "}, {"title": "Senior-Staff Threat Researcher", "location": "\n            Canada, or US National \n", "description": "\n            Tracking active campaigns from major threat actors against public, private, and government entities and automating collection of data on these topics. Has at least 5-7 years of experience in security research broadly, including hunting threat actors...\n        "}, {"title": "Cyber Security Analyst - IAM, PAM", "location": "\n            Canada \n", "description": "\n            Play an active role in ensuring the integration of services, data flow and functionality for all Credential Management and Identity Administration's platforms.Review, report and remediate data related to Access Certifications.Provide system support.\n        "}, {"title": "Solutions Architect", "location": "\n            Switzerland \n", "description": "\n            Lead your clients through evaluating and adopting the platform. Support your customers by authoring reference architectures, how-tos, and demo applications. Integrate the platform with 3rd-party applications to support customer architectures.\n\n        "}, {"title": "Senior Analytics Manager, Logistics", "location": "\n            US National \n", "description": "\n            Manage, mentor, and build a high performance team of analysts that are able to gather and synthesize data quickly and accurately. Measure impact of throughput through the creation of KPIs to help measure against business outcomes. Deliver insights.\n        "}, {"title": "Senior Software Engineer, Ads Integrity", "location": "\n            BC, Canada \n", "description": "\n            Work with product managers to design and implement Ads products. Collaborate closely with the platform and data teams while building new features. Lead the processes needed to improve operational stability, including improving code quality, delivering...\n        "}, {"title": "Senior DevOps Engineer", "location": "\n            Canada \n", "description": "\n            Worked closely and in full coordination with the IT Eng+ DevOps team to provide follow-the-sun operational coverage in the production support of our AWS Environments and internal IT and Engineering tooling. Built out automated tooling for cloud...\n        "}, {"title": "Staff Software Engineer, Machine Learning - Advertiser Optimization", "location": "\n            ON, Canada \n", "description": "\n            Dive deep into our platform to spot opportunities for improvement. Apply mathematical sophistication to solve our customers' problems. Build applied machine learning models end to end to production. Iterate and tune algorithms and/or models with...\n        "}, {"title": "Staff Software Engineer, Mobile", "location": "\n            Poland \n", "description": "\n            Plan and implement new mobile financial product features. Work cross functionally with colleagues in product, design, analytics, finance, legal, machine learning, and engineering teams. Lead technical solution design across mobile, web, and backend...\n        "}, {"title": "Staff Software Engineer, Backend", "location": "\n            Poland \n", "description": "\n            Design, plan and implement new financial product deliverables. Work cross functionally with colleagues in product, design, analytics, finance, legal, machine learning, and engineering teams. Design & build APIs, services, and data models to work with...\n        "}, {"title": "Senior Test Automation Engineer", "location": "\n            US National \n", "description": "\n                Own and coordinate testing for premium products. Create and execute test automation to support it. Develop automation supporting complex cross team features that support 100,000 users. Drive standards and best practices and ensure quality products. \n        "}, {"title": "Engineering Director", "location": "\n            Brazil \n", "description": "\n            The Engineering Director will build, mentor, and manage a team consisting of individual contributors and one engineering manager. The Director will be hands-on and own the technical roadmap planning and execution in collaboration with the PAC Product...\n        "}, {"title": "Credit Risk Manager", "location": "\n            Canada, Mexico, or US National \n", "description": "\n            Use your analytical skills and experience in consumer credit risk to play a key role in leading Credit and Product strategy for the company's core product, Instant Cash. Lead the development of new strategies to ensure the stability of the company's...\n        "}, {"title": "Senior Data Scientist", "location": "\n            US National \n", "description": "\n            Lead the design, analysis, and interpretation of projects from data requirement gathering to data processing, modeling, and recommendations. Proactively identify gaps and opportunities for marketing teams to optimize existing and create new marketing...\n        "}, {"title": "Senior Imagery Software Engineer", "location": "\n            US National \n", "description": "\n            Ensuring the imagery is properly geolocated on the Earth's surface. Contributing to the design and modeling of new imaging systems and operating modes. Developing and validating image quality metrics. Troubleshooting image quality issues and developing...\n        "}, {"title": "Financial Analyst II", "location": "\n            US National \n", "description": "\n            Perform financial forecasting, reporting, and operational metrics tracking. Analyze financial data and create financial models for decision support. Report on financial performance and prepare for regular leadership reviews. Assist in financial...\n        "}, {"title": "Marketing Data Analytics Specialist", "location": "\n            Brazil \n", "description": "\n            The team designs and implements strategy, for all our 10+ countries, towards increasing revenue generation by creating great experiences. This position is going to help this team drive results through the generation of impactful data insights.\n        "}, {"title": "Senior Director, Media Forecasting and Modeling", "location": "\n            US National \n", "description": "\n            Responsible for applying quantitative methodologies, techniques, and tools to develop best in class insights that inform all types of media activations (social, search, digital, multi-channel, etc). Identify business opportunities, goals, and...\n        "}, {"title": "Architect, Data Analytics", "location": "\n            US National \n", "description": "\n            Analyzes data and develops models, algorithms, visualizations and/or simulations for complex business problems. Performs statistical analysis to establish causal relationships between drivers and outcomes. Build analytics processes for anomaly...\n        "}, {"title": "Senior Python Data - Machine Learning Engineer", "location": "\n            Work from Anywhere \n", "description": "\n            Your primary focus will be collaborating with a team of developers in creating and implementing software applications and components. Must have strong Python Data Experience using frameworks like Pandas and NumPy.\n        "}, {"title": "Senior Data Engineer", "location": "\n            Canada \n", "description": "\n            Build data models and patterns for powering self-service data discovery. Design, build and maintain solutions that power batch and real-time processing powering millions of recommendations daily. Improve the data quality and reliability of data...\n        "}, {"title": "Technical Writer", "location": "\n            MA, NH, CA, NJ, CO, CT, NC, FL, ND, ME, OH, IL, PA, IN \n", "description": "\n            Write technical documentation such as API reference manuals, user guides, implementation guides, developer guides, and more for external and internal customer, user, developer, and implementation audiences. Write release notes and FAQs. Create product...\n        "}, {"title": "Senior IT Developer", "location": "\n            Jacksonville, FL \n", "description": "\n            Senior IT Developers are responsible for development, programming, coding of Information Technology solutions. Senior IT Developers are responsible for documenting detailed system specifications, participation in unit testing and maintenance of...\n        "}, {"title": "Senior Data Engineer", "location": "\n            US National \n", "description": "\n            Create a strong partnership with Product Strategy, Data Engineering, IT, and leadership for Data Management technologies for well-managed and effective data platform and tools operations. Lead your team in building data management solutions that span...\n        "}, {"title": "Senior Software Engineer Security", "location": "\n            Canada, United Kingdom, Germany, or US National \n", "description": "\n            Secure the software supply chain in the conda ecosystem, starting from upstream open-source packages, to the build process, to the package manager (conda), to installation and environment management. Identify gaps in our security and work with the...\n        "}, {"title": "Quality Assurance Engineer Manager ", "location": "\n            US National \n", "description": "\n            As our Quality Assurance Engineer Manager (Automation), you'll be developing processes and managing our main QA projects including integrating our growing automation suite into our CD pipeline and automating accessibility and security testing.\n        "}, {"title": "Senior Trademark Analyst", "location": "\n            CA, IL, WA, NY, NJ, TX, FL, PA, MA \n", "description": "\n            In this role, you will work closely with clients and more senior team members to assess clients' business objectives and to tailor project scope, content, and implementation to best address those objectives. Bachelor's degree and 7-10+ years of exp. \n        "}, {"title": "Trademark Analyst", "location": "\n            CA, IL, WA, NY, NJ, TX, FL, PA, MA \n", "description": "\n            Enjoy collaborating with more- and less-experienced team members on consulting projects involving trademark, copyright and domain names, such as assessment and evaluation of trademark, copyright and domain name portfolios, trademark valuations...\n        "}, {"title": "Associate of Enrollment and Billing Optimization ", "location": "\n            AZ, CA, CO, CT, FL, GA, IL, IA, MD, MA, MI, NH, NJ, NM, NY, NC, OH, OR, PA, RI, TN, TX, UT, VA, WA, Washington, DC \n", "description": "\n            Oversee designs and prioritizes technical operations roadmaps working to implement and improve the efficacy and efficiency of existing operational processes or unlock new capabilities. Bachelor's degree and 4+ years of commensurate experience. Remote. \n        "}, {"title": "Senior DevOps Engineer", "location": "\n            Chicago, IL, St. Petersburg, FL \n", "description": "\n            You'll work closely with our engineering, QA, and product teams to provide best practices, tooling, and support, and enable our continued growth. 5+ years of DevOps / SRE experience. 3+ years with high availability, concurrent distributed infrastructure.\n\n        "}, {"title": "Data Analyst", "location": "\n            CA \n", "description": "\n            As a Data Analyst on the Data Operations team, you will work cross-functionally with data engineers, data scientists, business experts, and external vendors to help deliver a better student experience by using data and analytics. Bachelor's degree. \n        "}, {"title": "Software Engineer", "location": "\n            DE, FL, GA, MD, NC, NV, OH, PA, SC, TN, VA, WV \n", "description": "\n            Creating and maintaining business-critical systems, including software written in C#, SQL, TypeScript (React Native), and more. Taking ownership of tasks and projects to ensure requirements are met. Experience with a mainstream programming language.\n        "}, {"title": "Engineering Manager - Education", "location": "\n            US National \n", "description": "\n            Manage a team of software and data engineers. Collaborate with scrum masters, product owners, and leadership to build world-class solutions powering one of the largest online marketplaces for adult learners. Position the engineering team for success...\n        "}, {"title": "Senior Data Analyst", "location": "\n            US National \n", "description": "\n                Work closely with executive stakeholders as a thought partner in scoping and planning and lead development and delivery of quality data products. Build and iterate data products to ensure end-to-end delivery of solid reports in compliance, audit...\n        "}, {"title": "Senior Data Analyst", "location": "\n            US National \n", "description": "\n            Improve the team's productivity and increase the speed of analytics through automated data analytics. Develop data analytics automation using programming languages R and Python. Improve performance and enhance the development of the cloud-based...\n        "}, {"title": "Staff Machine Learning Engineer", "location": "\n            US National \n", "description": "\n            You will help build a state-of-the-art ML infrastructure that performs automated data retrieval, feature extraction, model training, and deployment at scale. 7+ yrs of experience developing mission-critical applications using Java or Python or similar...\n        "}, {"title": "Director of Analytics", "location": "\n            US National \n", "description": "\n            You'll assess our data stack and determine what tools we need to meet our long-term data needs. You'll work closely with business leads across the company to scope data projects and assess their impacts. 6+ years experience. 100% Remote Work.\n        "}, {"title": "Software Engineer III", "location": "\n            Mountain View, CA \n", "description": "\n            Software Engineer III will work closely with product and development teams to create an amazing user experience. Designs and develops software applications. Performs coding, debugging, testing, and troubleshooting throughout the application development...\n        "}, {"title": "Principal Machine Learning Engineer", "location": "\n            US National \n", "description": "\n            Lead AI and data science activities to develop new and innovative approaches to improve the value of care received by the company's Medicare patients. Be the organizational thought leader in the application of machine learning, predictive models...\n        "}, {"title": "Marketing Analytics and Insights Business Analyst", "location": "\n            US National \n", "description": "\n            Contribute to the business marketing measurement function by combining creative problem solving with analytical rigor to drive actionable insights, including developing reporting frameworks and dashboards, performing customer segmentation, completing...\n        "}, {"title": "Revenue Management Data Analyst", "location": "\n            Miami, FL \n", "description": "\n            Revenue Management Data Analyst has responsibility for pricing and revenue management activities involving one or more lines of business at World Fuel Services. The role will have responsibility for managing pricing strategy, designing pricing...\n        "}]