[{"title": "Scriptwriter", "location": "\n            Work from Anywhere \n", "description": "\n            Develop ideas and scripts based on keywords, briefs and educational material. Write video scripts to be read and acted out by our video hosts. Be ready to experiment and change on the basis of data and team discussions. Interact with creators.\n        "}, {"title": "Product Manager", "location": "\n            Work from Anywhere \n", "description": "\n            Help come up with product priorities. Create wireframes. Think through edge cases. Refine tasks and user stories.Conduct user tests and summarize results. Work with designers who implement the wireframes. Reply to developers about implementation.\n        "}, {"title": "Hubspot Administrator", "location": "\n            Work from Anywhere \n", "description": "\n            Assist with CRM implementation and onboarding. Permission and set up user roles in your HubSpot account Customize views, properties, and workflows in our HubSpot account. Implement HubSpot automation to support business processes. Integrate other...\n        "}, {"title": "Senior Python Data - Machine Learning Engineer", "location": "\n            Work from Anywhere \n", "description": "\n            Your primary focus will be collaborating with a team of developers in creating and implementing software applications and components. Must have strong Python Data Experience using frameworks like Pandas and NumPy.\n        "}, {"title": "Digital Content Coordinator", "location": "\n            Work from Anywhere \n", "description": "\n            Responsible for assisting the Content Strategist throughout the web redesign process and will take ownership of collecting, organizing and integrating all of the client's website content. Additionally, the Digital Content Coordinator will need to have...\n        "}, {"title": "Financial Planning and Analysis Manager", "location": "\n            Work from Anywhere \n", "description": "\n            Own the consolidated financial models, build forecasts for revenue and cost drivers, and regularly update financial reporting. Provide insights and analytical support, highlight trends, opportunities and risks to assess the health of the business and... \n        "}, {"title": "Accountant, Mid-Senior", "location": "\n            Work from Anywhere \n", "description": "\n            Work with and assist your peers to develop world-class content, with a focus on innovation and creativity. Question and seek information from peers. Constructively contribute to team culture through positive attitude.\nArticulate concepts and ideas in a...\n        "}, {"title": "Partnerships Manager", "location": "\n            Work from Anywhere \n", "description": "\n            You will be the founding member of the business development team and will report to our CEO and Co-founder. You will create meaningful relationships with key brands and industry leaders, onboarding them and engaging them with our product.\n        "}, {"title": "Senior User Acquisition Manager", "location": "\n            Work from Anywhere \n", "description": "\n            Work on the strategic and tactical plans of user acquisition for our two products: Highrise and Everskies. You will identify the best approach to increase users and revenue to our unique virtual worlds by planning the UA budget, setting and tracking KPIs.\n        "}, {"title": "Creator Success Manager", "location": "\n            Work from Anywhere \n", "description": "\n            Oversee the customer lifecycle to proactively drive adoption and ensure ongoing client satisfaction and retention of a portfolio of assigned creators. Drive revenue expansion by increasing average products per creator across all go-to-market ready...\n        "}, {"title": "Manager, Payroll Implementations", "location": "\n            Work from Anywhere \n", "description": "\n            Coordinate the migration from external providers to internal services. Investigate and resolve any blocking issues to ensure project advances on time. Work experience in regional/global payroll operations. Understanding of global payroll best practices. \n        "}, {"title": "Talent Scout - Recruiter", "location": "\n            Work from Anywhere \n", "description": "\n            Owns the recruitment process, manages advertising for all open positions, and creatively sources and effectively screens all candidates in a crazy efficient manner. Have at least 2 years of remote recruiting experience. Competitive starting wage. Remote.\n        "}, {"title": "Technical Advisor I – Infrastructure, Shelter and Settlements", "location": "\n            Work from Anywhere \n", "description": "\n            Support the development and contribute to the implementation of agency-wide strategies, standards, tools and best practices in Shelter and Settlements, and Infrastructure that effectively engage partners, donors, and governments. Help mitigate risk...\n        "}, {"title": "Lead Backend Engineer - Laravel", "location": "\n            Work from Anywhere \n", "description": "\n            Own the development and maintenance of existing integrations with 3rd party tools, from start to finish. Maintain and improve the existing application code. Design and develop new features, and integrate them into the core product. Develop our own API...\n        "}, {"title": "User Experience Researcher", "location": "\n            Work from Anywhere \n", "description": "\n            This is a hands-on role, and includes planning and executing research, data collection, synthesis and analysis, and delivery of recommendations. Create, organise and manage rigorous customer research where the team can access research outputs and...\n        "}, {"title": "Product Marketer", "location": "\n            Work from Anywhere \n", "description": "\n            Analyze the existing marketing efforts and identify strengths, gaps and opportunities to the processes and to the people. Understand the gaps and opportunities on the marketing site and work with front-end/content resources to improve the copy, design,\n        "}, {"title": "Senior Product Designer", "location": "\n            Work from Anywhere \n", "description": "\n            Work with the team to define products and features, not just execute solutions. Own design problems end to end, from concept through shipping and beyond. Build multiple prototypes and iterate to solve complex problems. Work with developers during build.\n        "}, {"title": "Content Partner", "location": "\n            Work from Anywhere \n", "description": "\n            Set up and build our initial organic marketing engine across long-form content, product update communication, white glove email marketing. Lead content creation strategy and operations, ensuring the highest-quality content across our blog...\n        "}, {"title": "Senior Compensation Manager", "location": "\n            Work from Anywhere \n", "description": "\n            Lead a small team of Compensation professionals with responsibility for hiring, coaching, rewarding, developing, and inspiring the team. Lead and ensure effective management of various compensation workstreams including annual salary benchmarking...\n        "}, {"title": "Senior Web Designer", "location": "\n            Work from Anywhere \n", "description": "\n            Craft novel moments of storytelling and delight for our digital properties like chain.link, case studies, product pages, and more. Partner with our Marketing team to define information architecture and tell the right stories.\n        "}, {"title": "Senior Product Manager, Open Source", "location": "\n            Work from Anywhere \n", "description": "\n            Senior-level position managing product and open source projects for a global platform. Telecommute role requires software engineering experience and good interpersonal, presentation, and communication skills. Great benefits offered.\n        "}, {"title": "Senior Program Manager", "location": "\n            Work from Anywhere \n", "description": "\n            PMs will handle all client communication, take ownership of planning and reporting, as well as obtain all necessary information to ensure delivery on time, under budget, and in line with our quality standards. Furthermore, they will manage capacity...\n        "}, {"title": "Business Operations Associate", "location": "\n            Work from Anywhere \n", "description": "\n            You will own billing operations for our 2000+ customers across 20+ countries. This will range from the day-to-day work of setting up customers and responding to billing queries, to the big picture of automating our processes and enabling us to grow...\n        "}, {"title": "Senior UI Designer", "location": "\n            Work from Anywhere \n", "description": "\n            Make design decisions based on sound judgment, experience, research, and data. Take complete ownership of the UI design of our core product. 5+ years of experience in UI Designing and a strong understanding of UI best practices. 100% Remote Work.\n        "}, {"title": "DevOps Engineer", "location": "\n            Work from Anywhere \n", "description": "\n            Freelance, remote position. Responsibilities include participating in scrums comprised of cross-functional teams, ensuring that features are delivered efficiently, and participating in architectural design & review. Bachelor's degree required.\n        "}, {"title": "Technical Animator", "location": "\n            Work from Anywhere \n", "description": "\n            As a Technical Animator, you are highly proficient in rigging and skinning for games. You will use your experience in character articulation, animation technology, game development and software languages and packages to help animators achieve their goals.\n        "}, {"title": "Technical Director", "location": "\n            Work from Anywhere \n", "description": "\n            Architect, design and implement functionality for AAA external clients. Plan and execute delivery of projects within their unit/client base. Support the CTO as required on technical discussions with prospective clients. \n        "}, {"title": "Senior Java Engineer", "location": "\n            Work from Anywhere \n", "description": "\n            The mission for the Senior Backend Engineer is to build and improve the products and services of the platform as a member of an agile team that serves carriers and shippers in the Vehicle Transportation Industry of the United States.\n        "}, {"title": "Director of Content Marketing", "location": "\n            Work from Anywhere \n", "description": "\n            You will shape our full-funnel content marketing strategy and operations, leading an existing team of two squads: one focused on audience growth, community building, and lead generation, and the other focused on sales enablement and product/customer...\n        "}, {"title": "Quality Assurance Engineer", "location": "\n            Work from Anywhere \n", "description": "\n            As a Quality Assurance Engineer, you'll work to ensure only our best work makes it to our customers. You'll engage with a collaborative, high powered team to develop and execute test plans and automation suites for projects with a reach of millions.\n        "}, {"title": "Product Manager", "location": "\n            Work from Anywhere \n", "description": "\n            Develop deep knowledge and empathy for users needs in the areas they tackle. This involves reviewing existing issues, tickets, docs, engaging in lots of interviews and evaluating quantitative data. Understand the underlying mechanics of the product at...\n        "}, {"title": "Full Stack Developer", "location": "\n            Work from Anywhere \n", "description": "\n            Seeking a full stack developer to work remotely and assist with editing a single page SPA web app created with React.js. Responsibilities include implementing new features by writing code and testing the front and a back end (server). \n        "}, {"title": "Frontend Developer - React.js", "location": "\n            Work from Anywhere \n", "description": "\n            Perform frontend development with React.js to create an information graphics SPA. Write code, perform testing, and conduct research. Must have relevant experience with vector graphics, functional programming, and JavaScript. Telecommute role.\n        "}, {"title": "Senior Business Analyst", "location": "\n            Work from Anywhere \n", "description": "\n            We are looking for a Sr Business Analyst who can Support Product & Tech teams to build & improve products from top to bottom by: Providing useful information regarding user behavior, market, and technology. Planning tech projects, capturing the...\n        "}, {"title": "Accounting Analyst", "location": "\n            Work from Anywhere \n", "description": "\n            Support in the accounting closing process, to accomplish timely month-end, quarter-end, and year-end close procedures for certain key balance sheet and income statement accounts (including preparing journal entries and account reconciliations)...\n        "}, {"title": "IT Agile Project Manager", "location": "\n            Work from Anywhere \n", "description": "\n            We are looking for an IT Agile Project Manager as a member of the PMO, assigned to work mainly on IT-related initiatives, and be an ambassador of the Operational Framework created by the PMO. Scrum Master certification and 4+ years of experience. \n        "}, {"title": "Community and Content Manager", "location": "\n            Work from Anywhere \n", "description": "\n            Create a creative communication strategy in our social channels to drive incremental reach and views and build the desire in consumers to know about the brand and make a purchase with a performance-driven mindset. Collaborate with the Content...\n        "}, {"title": "Business Development Specialist II", "location": "\n            Work from Anywhere \n", "description": "\n            Provide BD expertise in positioning, capture planning and proposal preparation for specific opportunities with institutional donors. Serve as a lead or support writer on proposals, contributing both technical and non-technical content. Train staff.\n        "}, {"title": "Technical Advisor III – Health and Nutrition", "location": "\n            Work from Anywhere \n", "description": "\n            Contribute to the design, advocate for, and ensure implementation of agency-wide strategies, standards, tools, and best practices in health and nutrition that effectively engage partners, donors, and governments. Ensure a cross-sectoral approach that...\n        "}, {"title": "Senior UI - UX Designer", "location": "\n            Work from Anywhere \n", "description": "\n            Content Authoring Tools: Design tools that allow writers to add visuals, audio, interactivity, and monetization to stories. Publishing: Visualize data to provide writers with interesting insights into their stories. You'll be giving writers...\n        "}, {"title": "Lead Product Designer", "location": "\n            Work from Anywhere \n", "description": "\n            This role is the first product hire at Tales. You'll be stepping into the founding CEO's shoes and leveling up our products from MVPs to software that can deliver on our ambitions. You have the talent for understanding writers' needs and delivering...\n        "}, {"title": "Brand Marketing Manager", "location": "\n            Work from Anywhere \n", "description": "\n            Manage the brand development of marketing campaigns, social media and PR activities. Assist in the development and analysis of consumer insights. Integrated marketing campaign development across channels. Assist with developing brand voice and strategy.\n        "}, {"title": "Director of Business Development", "location": "\n            Work from Anywhere \n", "description": "\n            Build strategic recommendations for leadership on new business opportunities and partnerships for company including a review of the landscape and P&L projections. Navigate and cultivate relationships with key stakeholders and decision makers at...\n        "}, {"title": "Software Engineer, Backend", "location": "\n            Work from Anywhere \n", "description": "\n            You'll be expected to ship major features end to end across our JavaScript and Clojure codebase, as well as deal with some of our trickier backend issues as they arise. Some familiarity with machine learning, compiler theory and modern big data...\n        "}, {"title": "Technical Writer", "location": "\n            Work from Anywhere \n", "description": "\n            We're looking for a Technical Content Writer to help us take it to the next level and help us reach a wider audience. This role is part of our overall Technical Writing bench, and will be at least initially focused on Growth initiatives, writing for...\n        "}, {"title": "Software Engineer, Frontend", "location": "\n            Work from Anywhere \n", "description": "\n            You'll make tools that people rely on for their real jobs. You'll get to work in open source and get feedback directly from users and customers out in the open. The company is growing and so is the business. We're adding new remote team members from...\n        "}, {"title": "Head of Data Engineering", "location": "\n            Work from Anywhere \n", "description": "\n            Lead and develop a team of talented data/software engineers to design, plan, develop, and deploy improvements to back-end platform services related to data ingestion, data processing, and analytics. Design the architecture and then lead the implementa...\n        "}]