[
{"title": "Associate Operations Engineer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Looking for passionate DevOps systems engineers and systems administrators to help us grow our second-to-<b>none</b> Cloud hosting services. We manage over 18,000 AWS EC2 servers powering some of the world's most popular Drupal web sites.\n        </div>"},
{"title": "Director of Equity, Diversity and Inclusion", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Director of EDI will design new programs and governance structures where <b>none</b> existed before. The focus of this position is to continuously strengthen our organizational culture and effectivenes through a holistic Equity, Diversity and Inclusion...\n        </div>"},
{"title": "Payroll Data Compliance Analyst", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            Responsible for researching and summarising payroll-related data globally in order to maintain our products and support the business as we grow, delivering both an employee and customer experience second-to-<b>none</b>, driving service delivery excellence...\n        </div>"},
{"title": "Patient Financial Service Specialist ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Patient Financial Service Specialist will perform daily tasks including: verification of patient eligibility, benefits, and accumulations; ABN completion; verification if CPT codes require authorization, predetermination or PCP referral...\n        </div>"},
{"title": "Actuarial Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop queries to obtain data that is appropriate to the purpose with minimal assistance and oversight. Develop studies, analyses, and presentation materials needed to appropriately inform decision makers. Seek input and assistance as required to...\n        </div>"},
{"title": "Lead Copywriter", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide subject-matter direction and guidance to other copywriters. May train employees, assign, monitor and review progress and accuracy of work. 8 years of relevant, progressive experience in the area of specialization including leading projects of...\n        </div>"},
{"title": "Customer Experience Analyst - Content Writer, Communications Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Execute a Customer Experience (CX) vision for the Health enterprise. Using customer research and a deep understanding of business needs, this person will support the CX team as they define and socialize a transformational healthcare experience...\n        </div>"},
{"title": "Senior Financial Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Coordinate with other departments, locations, and divisions. Communicate with other departments and/or outside agencies to resolve problems. Advise management of expected outcomes, and recommending ways to improve the outcomes.\n        </div>"},
{"title": "Business Analyst - Strategy Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Work with business/ market owners to identify key business issues, articulate problem, apply right analytical framework, develop solution and recommendations, represent findings to stakeholders and own the outcome. Provide periodic informal...\n\n        </div>"},
{"title": "Financial Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Advise management of expected outcomes, and recommending ways to improve the outcomes. Conduct presentation to all levels of management in order to provide a summary of analysis regarding financial results and trends.\n\n        </div>"},
{"title": "Value-Based Reimbursement Communications Consultant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            This job develops and implements communications strategies that support the department's strategy and business priorities. The incumbent focuses on internal and external audiences by analyzing, designing, developing, and providing communication...\n        </div>"},
{"title": "Senior Account Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Meet or exceed revenue and target requirements for all assigned client accounts. Cultivate and maintain strong working relationships with all clients. Own all aspects of client relationships including onboarding, training, and ongoing support,...\n        </div>"},
{"title": "Manager Actuarial", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Responsible for overseeing assigned actuarial staff and projects, hiring and training actuarial staff, and providing specialized reports and analysis of data. Accountable for developing employees, preparing rate filings, providing actuarial support...\n        </div>"},
{"title": "Website Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Management of web and social updates across websites. A mixture of advice, execution of changes to website briefing of technical changes to website. Management of internal stakeholders. Process improvement. Determine appropriate analytics, provide...\n        </div>"},
{"title": "Actuary", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            This job is an ASA Certified actuary position that initiates and leads the development of actuarial studies and analyses. Gives direction to less experienced staff and will represent the department's perspectives and needs in cross-disciplinary settings. \n        </div>"},
{"title": "Digital Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Management of web and social updates across websites. A mixture of advice, execution of changes to website briefing of technical changes to website. Management of internal stakeholders. Process improvement. Determine appropriate analytics, provide...\n        </div>"},
{"title": "Behavioral Health Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Function as a primary contact for members with behavioral health needs with the depth of engagement ranging from coaching interventions to intensive case management interventions. The overall goal is to help members navigate the health care system and...\n        </div>"},
{"title": "Associate Manager - Accounting", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Reviews, evaluates, analyzes and advises on complex Acct./Financial/Technical information. Plans, implements and manages large-scale projects. Assures alignment with department and or corporate goals. Leverages the impact of the Insurance Industry.\n        </div>"},
{"title": "Design Manager – Clinician Experience", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Drive a customer-value standard of quality and help product teams efficiently advance a launch, learn, and re-launch philosophy. Lead a team to hypothesize and ideate innovative experiences that unlock possibilities for members, healthcare...\n        </div>"},
{"title": "Business Solutions Consultant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Contribute to the delivery and execution of complex, large-scale, multi-year client enterprise transformation programs by gathering required data through direct observation and/or inquiry and synthesizing data into meaningful observation; analyzing...\n        </div>"},
{"title": "Certified Tumor Registrar - Level 1 Trauma Hospital", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Abstract and reviews cases of malignancies and reportable benign tumors diagnosed and/or treated. Translate medical terminology into standardized codes to capture patient diagnosis and treatment information. Complies with state and federal mandates.\n\n        </div>"},
{"title": "Workday - Associate Director", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Assists in the organization, development and implementation of departmental initiatives that support overall goals and objectives. Hire, lead, and serve as people manager to consulting team. Contribute to Workday practice operations\n\n        </div>"},
{"title": "Biostatistician", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Contract, work from home position. Will prepare analysis plans, identify software, maintain relationships, adhere to processes and collaborate with team. Master's degree and 4+ years' related experience required. Part-time.\n        </div>"},
{"title": "Inpatient Hospital Coder", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Assures that all services documented in the patient's chart are coded with appropriate ICD-10/PCS codes. When services/diagnoses are not documented appropriately, seeks to attain proper documentation in a timely manner according to facility standards.\n\n        </div>"},
{"title": "Pro Fee Coder - Interventional Radiology", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The remote Interventional Radiology Pro Fee Coder must be proficient in E/M coding for all Interventional Radiology cases. Will review clinical documentation and diagnostic results as appropriate to extract data and apply appropriate ICD-10 Diagnosis...\n        </div>"},
{"title": "English - Spanish Interpreter", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Handling telephone calls on demand in a quiet home office. Help translate Spanish/English conversations for a wide range of industries including Healthcare, Government, Insurance Financial, Travel &amp; Hospitality and government entities. Translating...\n        </div>"},
{"title": "Senior Manager Customer Insights and Data Analytics", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Partner with multiple departments across all lines of business to create the strategy and structure for the new customer communications email program. Determine the make-up of audience lists for all customer communications. Manage compliance...\n        </div>"},
{"title": "Pashto - Afghanistan Interpreter", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide interpreting services in a remote capacity as an independent contractor. Translate between Pashto Afghanistan and English languages on a variety of issues. Must have experience, certification, or education in the subject area. Flexible hours.\n        </div>"},
{"title": "Insurance Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Insurance billing follow up in compliance with government rules and regulations. Submits, processes, and resolves claim rejections and denials. Verifies patient insurance eligibility for denial resolution. Completes the appeal process. Monitors and...\n        </div>"},
{"title": "Clinical Documentation Integrity - CDI Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Reviews daily admissions to assigned unit, performs initial code assignment for a working DRG and completes CDI software data entry for initial and follow up case reviews per facility prioritization (and worksheet to include code and DRG assignment).\n        </div>"},
{"title": "Email Development Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Build, test and deploy personalized email marketing modules via SFMC Content Builder. Develop Content Builder email templates and respective content blocks; requires strong HTML/CSS, AMP for Email, AMPscript, Guide template Language, Server-Side...\n        </div>"},
{"title": "Technical Writer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Design and write technical illustrations as needed to facilitate understanding of technical material and upon customer request. Develop other documentations as requested by the customer. Demonstrated ability to produce quality documents within...\n        </div>"},
{"title": "Pro Fee Coder - ENT", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Will review clinical documentation and diagnostic results as appropriate to extract data and apply appropriate ICD-10 diagnosis codes, along with CPT/HCPCS codes as defined for the service type, for coding, billing, internal and external reporting...\n        </div>"},
{"title": "Graphics Developer", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            Graphics Developer is needed for a remote opportunity. Candidate will focus on Linux related graphics. Must have a good understanding of open-source development model and practices. Prior relevant experience is required.\n        </div>"},
{"title": "Director of Finance", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Prepare a monthly presentation for CFO of organization's financial performance compared to budget and prior year including financials and bridges of the drivers as well as other exhibits. Create and update forecasts for monthly and multi-year P&amp;L's and...\n        </div>"},
{"title": "Logistics Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Responsible for the development, maintenance, and day-to-day execution of our Business to Consumer (B2C) logistics network to include forecasting &amp; reporting; peak season planning &amp; execution; as well as the continued development and optimization of...\n        </div>"},
{"title": "Senior Tax Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Responsible for all aspects of the tax compliance function and tax accounting function, including the performance of tax research and planning. In performing these duties, the individual will need to keep abreast of changes in tax law and will be...\n        </div>"},
{"title": "SEO Copywriter", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The SEO Copywriting contractor is a freelance role that works with the SEO Copywriting team to create unique content for SEO clients based on strategy goals identified by SEO Specialists. Copywriting contractors work under the supervision of the Copy...\n        </div>"},
{"title": "Contracts Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Drafting and negotiating of software license agreements, professional services agreements, and contract addenda in region; routinely exercising discretion and independent judgment. Reviewing RFPs, Tenders, RFIs, and RFQs, offering appropriate...\n        </div>"},
{"title": "Collections Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Collections Specialist will be responsible for ensuring payment on open invoices. This role will utilize Aging Reports to contact clients when invoices are past due. The Collections Specialist will facilitate resolution for payment, post receipts...\n        </div>"},
{"title": "Business Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Critically reviews, analyzes, and evaluates business systems and user needs, ultimately producing clearly documented requirements and deliverables. Facilitates elicitation discussions with various stakeholders to clarify project scope resulting in flow...\n        </div>"},
{"title": "Python, Django Developer", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            Seeking experienced Python developer to participate in two projects primarily utilizing Python and Django, performing front-end/back-end development. jQuery skills are a big plus, along with solid SQL skills. Full time, long-term, freelance position.\n        </div>"},
{"title": "Senior Graphic Designer Consultant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Collaborating with clients and consulting teams to understand the problem and develop the appropriate creative solution or visualization. Managing your workload, timelines and client/consulting team expectations, with support and collaboration from the...\n        </div>"},
{"title": "Director, Proposal Writing", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Supervises internal writers, including HR-related activities such as workload and performance evaluations. Manages company's relationship with externally-contracted writing staff, ensuring their work is meeting or exceeding expectations. \n        </div>"},
{"title": "Market Conduct Senior Consultant I", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provides leadership, oversight and high-level consultation for Market Conduct matters. The Senior Consultant I is responsible for the day-to-day management of market conduct matters, including strategy development, team process oversight and response...\n        </div>"},
{"title": "Director of Brand Sales", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            As our Brand Sales Director, you will report to the SVP of Sales and you will have responsibility for bringing on new accounts and partnerships. We are seeking a passionate and motivated results-oriented Brand Sales Director with a track record in...\n        </div>"},
{"title": "Developmental Editor", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Razor-sharp editing of student- and teacher-facing mathematics curriculum and support materials for grades PK-12. Providing feedback to curriculum writers during the editing process. BA/MA in English, journalism, education, or related field. \n        </div>"},
{"title": "Director of Brand and Content Strategy", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            We're looking for a brilliant marketer with a strong perspective and point of view to define, build, and guide our brand and content strategy. 5-8 years of SaaS marketing experience. Demonstrated ability to lead a team and scale a content motion. Remote. \n        </div>"},
{"title": "Associate Director, Marketing", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Cultivate relationships with customers and stakeholders. Coordinate regular touch points with Radius sales, patient access, payer, medical teams to integrate real time feedback and learning's into marketing campaigns and efforts. Accumulates in-depth...\n        </div>"},
{"title": "Finance Manager ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Builds, updates and maintains monthly forecast models for areas of responsibility. Provides accurate and appropriate materials to meet the monthly/quarterly/annual close deadlines. Researches and prepares variance analysis and explanations.\n        </div>"},
{"title": "Salesforce Business Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Perform discovery on requests submitted or communicated from business stakeholders and from the discovery make recommendations of potential Salesforce solutions. Minimum 2 years experience writing/translating business requirements.\n        </div>"},
{"title": "Marketing Operations Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Perform market, customer and industry research using internal and external databases, secondary resources and the internet, while maintaining and documenting data sources to ensure sustainable ongoing updates.\n\n        </div>"},
{"title": "Reviews Editor", "location": "\n            New York City, NY, or US National ", "description": "<div class=\"job-description\">\n            Assign and edit book reviews for daily publication on publishersweekly.com and in the weekly print edition. Assign and edit author interviews. Manage a team of freelance reviewers and recruit new reviewers as required.Generate feature story ideas.\n        </div>"},
{"title": "Technical Writer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop Section 508 compliant accessible online help, user guides and training materials using Adobe RoboHelp and Microsoft Office products. Review technical enhancements and bug fixes from developer repositories (e.g. GitHub, TeamForge) to create...\n        </div>"},
{"title": "Compliance Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Assist with critical compliance services to clients, including the licensing and registration of RIAs/BDs and representatives. Support the timely completion of client deliverables, meeting delivery commitments while allowing time for review and...\n        </div>"},
{"title": "Accounting Operations Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Manages contracting needs for various shared service departments in the organization. Serve as the primary point of contact for diverse set of contracts. Collaborates with internal stakeholders, including Procurement, Finance and Legal to facilitate...\n        </div>"},
{"title": "Corporate Travel Consultant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide professional, accurate, cost-effective travel arrangements for internal customers within company guidelines and standards for excellent customer service. This position will require a flexible schedule: shift work, evening hours, Saturdays...\n        </div>"},
{"title": "Tax Supervisor", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Lead tax compliance engagements in accordance with firm and professional standards. Work directly with management and clients to build and maintain relationships. BS/BA in Accounting, CPA, and 2 years within a public accounting firm. Remote work. \n        </div>"},
{"title": "Tax Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Lead tax compliance engagements in accordance with firm and professional standards. Work directly with management and clients to build and maintain relationships. Perform detailed reviews of tax returns and workpapers. Review tax returns, research...\n        </div>"},
{"title": "Food and Beverage Sales Director", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The food and beverage sales director will have the responsibility for bringing on new accounts and partnerships. Manage a pipeline of prospects. Utilize data to refine strategy and deal criteria. Need 2+ years of sales experience and a BA/BS MBA degree...\n        </div>"},
{"title": "RN Case Manager - Special Needs Plan", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Engaging with high-risk members (primarily telephonically) to understand their needs, supported by technology and data tools. An unrestricted, compact RN license and willingness to obtain non-compact state licenses if needed. Health insurance experience.\n        </div>"},
{"title": "Customer Support Specialist ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Answering phone calls when customers call in for help. Develop expertise in services and products and the initiative to take an active role in sharing this knowledge with customers. Achieve individual and team service level goals. Track and document...\n        </div>"},
{"title": "SEO Copywriter", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The SEO Copywriter is an individual contributor role inside the SEO Department, responsible for creating unique content for SEO clients based on strategic goals identified by SEO Specialists. Copywriters work under the supervision of the Copy...\n        </div>"},
{"title": "Customer Support Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide service and support to internal and external customers via phone and email, managing and documenting member interactions using Salesforce. As part of a team, support over 900,000 global Bookshare members with varying technical skill levels with...\n        </div>"},
{"title": "Paid Media Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Monitor the latest trends in social media, including advertising formats, product updates, new channels and technologies in order to improve campaign performance and provide recommendations on how to best leverage new tools and services.\n\n        </div>"},
{"title": "Lifecycle Strategist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Be primarily responsible for email campaign setup, audit and launch - This role will actively work on creating new or edit existing templates. Partner with an internal design team and external agency to optimize and build email templates. Manage and...\n        </div>"},
{"title": "Billing Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Billing Specialist will work with the Revenue Accounting team to ensure accurate and timely invoices for clients. The Billing Specialist will receive data from multiple inputs and will use that information to generate invoices. This role will...\n        </div>"},
{"title": "Copywriter", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop copy and narratives that captivate and educate prospects and clients interested in real estate investing, and personal finance as well as preserving and protecting their business. Work with internal clients to ensure an understanding of...\n        </div>"},
{"title": "Senior Firmware Engineer I", "location": "\n            Canada, or US National ", "description": "<div class=\"job-description\">\n            Firmware Design and Development of IoT infrastructure for current and next-gen Camera-related products. Develop Firmware in C, C++ for Microcontrollers, System-on-Chips and System-on-Modules. Develop Firmware in C, C++ for Cellular LTE, Wi-Fi,...\n        </div>"},
{"title": "Senior Firmware Engineer II", "location": "\n            Canada, or US National ", "description": "<div class=\"job-description\">\n            Develop Firmware in C, C++ for Cellular LTE, Wi-Fi, Bluetooth BLE, Sub-GHz, GNSS and related RF technologies. Support Electrical Engineering with Board Bring-up and Hardware Debugging Support. Collaborate with distributed teams such as Embedded Product...\n        </div>"},
{"title": "Accounting Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Oversee accounts payable, including review of the accounting treatment/classification of accounts payable and procurement card transactions as well as identifying and implementing improvements to the accounts payable and procurement processes. Manage...\n        </div>"},
{"title": "Senior Software Engineer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Work collaboratively with cross-functional teams to create education products, create ideas to solve engineering challenges, identify and implement best practices and support an existing platform. Remote position. \n        </div>"},
{"title": "Software Engineer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Looking for a highly skilled Software Engineer that can lead a diverse team in creating a new testing platform for ACT &amp; SAT so that all students can achieve college-ready prep scores. 100% remote position.                                     \n        </div>"},
{"title": "Accounting Manager, Global Payroll", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The accounting manager will lead and manage all aspects of global payroll accounting operations for our rapidly growing company and must be a strategic and tactical leader, with a successful track record. They will drive timely, accurate, and compliant...\n        </div>"},
{"title": "Junior UI - UX Designer", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            Discuss and plan the visual identity of new features across multiple projects; Create high fidelity designs to be implemented in the platform; Create low fidelity drafts to be used as a proof of concept; Validate your design outputs, testing and...\n        </div>"},
{"title": "Operations Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The purpose of this position is to assist with various projects and initiatives within the eligibility services department. The role will act in a strategic capacity to analyze business needs and recommend improvement/solutions to business processes. \n        </div>"},
{"title": "Principal Salesforce Engineer, Architect CRM", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Developing a technical vision and roadmap to match overall company strategy and vision. Guiding the direction, quality, and approach for architecture of Salesforce across the company with clear deliverables like architecture diagrams and documentation.\n        </div>"},
{"title": "Enrollment Advisor ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Build and manage a mature, active pipeline of leads. Advise prospective students using a consultative process. Experience within a blended contact center handling inbound &amp; outbound calls as well as instant chat inquiries - previous experience preferred.\n        </div>"},
{"title": "Senior Android Engineer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Collaborate with the design &amp; product teams to build an experience that stands out among the best applications on Android. Work on new features and updates to the Android app. Work with our partner teams and venues to deliver the experience...\n\n\n        </div>"},
{"title": "Freelance Writer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Primary responsibilities will include proofreading articles, supporting special projects, and other relevant job functions. Friendly freelance writer with strong communication and interpersonal skills is needed for a stay at home opportunity. \n        </div>"},
{"title": "Marketing Communications Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Collaborate on digital marketing campaigns through the creation of (writing, design, layout) digital marketing content, such as email campaigns and landing pages. At least 2-4 years of relevant experience in a marketing or communications role.\n        </div>"},
{"title": "Senior Accountant ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Senior Accountant is responsible for financial statement preparation and review of K12 managed schools. You must be an energetic team player who listens and values the opinions of others and a self-starter who effectively prioritizes and works well...\n        </div>"},
{"title": "Manager, OEM Programs - DI", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Create, propose, and build out digital marketing strategies for clients. Stay current on industry trends to continually grow knowledge of new strategies and success metrics. Provide management-level presence in meetings with clients when necessary.\n        </div>"},
{"title": "Senior Product Marketing Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop positioning, messaging, and value proposition that differentiates and is resonate with key personas. End-to-end planning and launch of products and releases; cross-functional implementation of the product marketing plan. Design and ...\n        </div>"},
{"title": "Digital Analytics Manager ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            This will include implementing and validating pixels, as well as collecting, interpreting, and analyzing data for various line of business that we offer. This person would be the subject matter expert who utilizes analytics to drive insights and...\n        </div>"},
{"title": "Manager - Financial Planning and Analysis", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide financial analysis and commentary used for communication with partners. Responsible for budget and forecast development, tracking and oversight, working to ensure fiscal responsibility, accuracy and success. Partners with customer's external...\n        </div>"},
{"title": "Senior Manager, Financial Planning and Analysis", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide company-wide financial analysis and commentary used for communication with partners such as Clearway Board and Executive Leadership Team. Develops, mentors and manages FP&amp;A team resources, ensuring effective and efficient department systems...\n        </div>"},
{"title": "Distance Learning Instructor", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide virtual instruction on regional and culture subjects, using modern communicative and blended-learning methodologies. Provide instruction based on designated POI. Develop lesson plans or other learning material, as required. \n        </div>"},
{"title": "Distance Learning Associate Language Instructor ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Japanese Distance Learning Associate Language Instructor will assist with an ongoing requirement for live virtual Distance Learning (DL) Foreign Language, Regional Expertise, and Cultural (LREC) instruction and LREC program support services. Part-time. \n        </div>"},
{"title": "Distance Learning Instructor", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide virtual language instruction to improve foreign language proficiency skills across the modalities of Listening, Reading, and Speaking (L/R/S) as measured by the Defense Language Proficiency Test (DLPT), ACTFL or Oral Proficiency Interview (OPI).\n\n        </div>"},
{"title": "Distance Learning Instructor", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide virtual language instruction to improve foreign language proficiency skills across the modalities of Listening, Reading, and Speaking (L/R/S) as measured by the Defense Language Proficiency Test (DLPT), ACTFL or Oral Proficiency Interview (OPI)...\n        </div>"},
{"title": "Financial Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Financial Analyst will play a role in various aspects of financial planning, which may include the development of the annual operating budget and multi-year financial plan, capital expenditure planning, and new program evaluations.\n        </div>"},
{"title": "Technical Writer - Copy Editor", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Copy edit course content including core course instruction, assessments, multimedia, and/or practice games; Use brand authoring tools and processes as well as adhere to the instructional design guidelines set forth by the company team; Accept and...\n        </div>"},
{"title": "Director, OEM Programs", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Create, propose, and develop digital marketing strategies for OEM program clients. Measure the performance of each of the programs under your leadership and execute the strategies to increase value delivery and program growth. Stay current on industry...\n        </div>"},
{"title": "Visual Effects Artist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            You'll use your background in VFX to analyze our current pipelines and determine the best tools to get the job done moving forward. You'll create high-quality VFX based on references and use your creativity to help define the VFX style for each project. \n        </div>"},
{"title": "Talent Acquisition Specialist II", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Manage full cycle recruitment to include screening resumes, sourcing candidates, conducting phone screens, extending employment offers and other recruiting projects as needed. 4 years' experience as a full cycle recruiter, including Boolean...\n        </div>"},
{"title": "PR Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n             Secure coverage in national, local, and trade publications to boost profile, build our reputation, and demonstrate our research capabilities.  Draft press releases, thought pieces, and statements to generate positive press coverage. \n        </div>"},
{"title": "Physician", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            You should have: board certification in Internal Medicine, Family Practice; active California, Illinois, and Texas license, and DEA with the ability to get licensed in all 50 states and DC by our licensing vendor; 5+ years of clinical practice...\n        </div>"},
{"title": "Senior Financial Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide financial planning and analysis support for several business units. Prepare monthly analysis of revenue and cost variances to forecast, budget and prior year. Three to five years of relevant experience. Bachelor's degree in Finance, Accounting...\n        </div>"},
{"title": "Senior Manager, Fuel Performance", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Looking for an analytical and self motivated individual for our Fuel Performance Management team. This individual must love working with people, building relationships, and be driven by client success. Experience in digital media and client relations...\n        </div>"},
{"title": "Revenue Recognition Accountant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            In this role, you will provide leadership in the development and improvement of accounting policy, operational process effectiveness, and internal control environment related to the revenue recognition process. Oversee the month and quarter-end...\n        </div>"},
{"title": "Senior Accountant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Oversees and performs specialized accounting and financial activities on complex accounts and funds in accordance with generally accepted accounting principles and our policies and procedures. Performs or serves as team leader in assembling...\n        </div>"},
{"title": "Accountant I", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Complete assigned duties as part of the accounting close process. Apply knowledge of accounting policies and procedures to assigned tasks which include recording journal entries, and performing research and analysis. Interpret variances.\n        </div>"},
{"title": "Environmental Project Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Preparation of documents such as Phase I, Phase II, RAR reports and workplans with minimal oversight, synthesize analytical data, and develop conceptual site models. 8+ years of experience in the environmental industry with at least 3+ years in a...\n        </div>"},
{"title": "Senior Financial Analyst - Pharmacy", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Senior Financial Analyst will play a key role in various aspects of financial planning, which may include the development of the annual operating budget and multi-year financial plan, capital expenditure planning, and new program evaluations.\n        </div>"},
{"title": "Instructional Designer II", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Looking for an Instructional Designer II to join our Talent Management Team. The ideal candidate will be an individual contributor primarily responsible for designing and developing highly impactful learning solutions. You will design and develop...\n        </div>"},
{"title": "Senior Executive Assistant ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Executive Assistant (EA) provides highly skilled administrative support to the President, Clearway Health, LLC, and exemplifies model core role model at all times. The EA also serves as the key support for leadership to ensure efficient and proper...\n        </div>"},
{"title": "Content Development Strategist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Improve visibility and penetration with C-level executives via integrated campaigns and digital marketing strategies. Lead the planning and implementation of the digital content strategy for Technology Advisory marketing team. Work closely with...\n        </div>"},
{"title": "Senior Site Reliability Engineer II", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Own the CI/CD pipeline machinery for all SaaS products and elevate it from current capabilities to world-class level. 7+ years of hands-on experience working in a software development organization that builds large-scale distributed systems...\n        </div>"},
{"title": "Manager, Business and Accreditation Operations", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            You will help develop innovative solutions to challenges in delivering high-quality, scalable, and accessible virtual healthcare. You will also help build the foundations for streamlined compliant operational processes and procedures.\n        </div>"},
{"title": "Project Manager II", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Lead and develop the enrollment project plan specifying goals, strategy, scheduling, identification of risks and allocation of available resources\nWork closely with stakeholders, enrollment operations and marketing support teams (Communications, Design...\n        </div>"},
{"title": "Junior Technical Writer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Gather, analyze, translate and compose technical information into clear and concise language that is easily understood by technical and non-technical personnel, but also follow government guidelines and directives, to include: Ensure that successful...\n        </div>"},
{"title": "Workforce Planning Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Maintain workforce management software and tools to provide partners ability to manage intra-day staffing levels and to determine the most effective methods for staffing adjustments. Create and maintain call center tools that observe agents actual...\n        </div>"},
{"title": "Digital Copywriter, B2B Tech - Cybersecurity", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Draft compelling copy for our website, landing pages, emails, digital ads, and other campaign materials such as event promotional collateral. Conduct SEO research to optimize copy for SEO performance, and contribute to our overall keyword research and...\n        </div>"},
{"title": "Technical Writer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n             Develop comprehensive API Technical documentation that meets organizational standards. Create client facing documentation for Mastercard products, as part of creating a quality developer experience. Obtain a deep understanding of products and service...\n        </div>"},
{"title": "Financial Data Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Responsible for completing a monthly enrollment forecasting process, as well as researching, understanding, and performing analysis on the trends within our business. This resource will evaluate performance of actual vs plan, identify drivers of...\n        </div>"},
{"title": "Project Manager ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Lead large, global, and often, virtual groups of multi-disciplinary teams of highly-talented professionals; Develop and refine project plans that specify goals, strategy, staffing, scheduling, identification of risks, contingency plans, and allocation...\n        </div>"},
{"title": "Senior Professional Services Technical Consultant, Federal", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Act as the internal customer advocate for problem resolution, new product features, and future product direction. Use and create knowledgebase articles based on field incidents, and/or common or critical issues.\n        </div>"},
{"title": "Learning Coach Engagement, Senior Director", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Define the product strategy and roadmap. Lead, define and implement the program plan in order to achieve the goals. Lead in the management of changes to the program scope, prioritization, schedule, and costs to keep the community updated. Determine and...\n        </div>"},
{"title": "Digital Marketing Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop, maintain and optimize marketing calendar. Manage email unsubscribes in accordance to CASL, CAN-SPAM and GDPR. Build and manage accurate contact segments for various email campaigns. Manage performance reporting and analysis  using data to...\n        </div>"},
{"title": "Chief Pricing Analyst ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Development of cost proposals, both the pricing models as well as the cost volume narrative. Advise internal clients on risk mitigation and the development of winning price strategies. Facilitates pricing reviews and provides pricing guidance to...\n        </div>"},
{"title": "Senior Product Designer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Experience building products, developing component-based design systems and adapting brand guidelines to create scalable systems across products. Employ design thinking to translate insights into detailed user journey maps and experience flows that...\n        </div>"},
{"title": "Esports Coordinator", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Esports Coordinator is responsible for supporting and facilitating virtual socialization experiences for schools and students related to esports. Maintain actively running tournaments and competitions. Help create, maintain, and oversee competitive...\n        </div>"},
{"title": "Curriculum Champion", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Curriculum Champion leverages their in-depth knowledge of our curriculum products and portfolio to develop presentation and training materials, both internally and externally, to highlight and educate stakeholders on our core product offering. \n        </div>"},
{"title": "Career Learning Coordinator", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide operational support to ensure team members have necessary tools to complete quality work; Develop and refine program/project plans that specify goals, strategy, identification of risks, contingency plans and allocation of available resources.\n        </div>"},
{"title": "Product Designer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            As a Product Designer, you will be responsible for creating exceptionally designed user experiences for our suite of applications, catering to our customers: students, parents, learning coaches, and teachers. You will work closely with designers...\n        </div>"},
{"title": "Software Engineer, Frontend", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            You'll make tools that people rely on for their real jobs. You'll get to work in open source and get feedback directly from users and customers out in the open. The company is growing and so is the business. We're adding new remote team members from...\n        </div>"},
{"title": "Regional Safeguarding Advisor II", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Lead/co-lead on the design and implementation of training and capacity building plans for CRS staff, affiliates and partners. Support country programs on the in-take and assessment of safeguarding reports and in preparing and conducting investigations...\n        </div>"},
{"title": "Group Underwriting Consultant I", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Underwrites small size cases for new and renewal business developing proposals, add-on business and contract revisions, and other policy owner services within limited authority levels under minimal supervision. \n        </div>"},
{"title": "Staff Software Engineer DEMS", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Set a high technical bar for the team through deep technical insights and architecture design reviews. Mentor engineers. Work across teams with Product, Design, and Engineering to solve some of our biggest technical challenges for our customers.\n\n        </div>"},
{"title": "School Operations Admin 1", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Assist in the development of a network of providers throughout the state within the private sector as well as local school districts for programs. Negotiate rates with providers based on market value of services rendered. Maintain awareness of current...\n        </div>"},
{"title": "Proposal Coordinator and Technical Writer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop a project plan, outline each stage of the proposal, and create a schedule to meet all necessary deadlines to deliver winning proposals. Guide teams through the collaborative process to develop responses to RFI, RFQs and RFPs. Analyze criteria.\n        </div>"},
{"title": "Vice President of Operations and Sales", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop GTM for various verticals that report to you, focusing on short-term goals while building long-term plans to capture market share. Set revenue and KPI expectations, prioritize efforts, hold the team accountable for building pipeline and...\n        </div>"},
{"title": "Inside Sales Representative", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Utilize lead information to identify prospects and reach decision-makers with whom he/she develops effective consultative relationships. Drive revenue by selling the organization's products and/or services to established customers or new prospects via...\n        </div>"},
{"title": "Demand Generation Marketing Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop, maintain, and execute demand generation plans aligned with business goals. Design, plan, manage, and optimize integrated digital campaigns across multiple channels such as SEO, SEM, organic and paid social media, email marketing, affiliate...\n        </div>"},
{"title": "Senior IT Project Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Responsible for the delivery and management of multiple medium-sized IT projects (annual project(s) portfolio size up to $5M) running concurrently. Develops the project approval documentation, integrated project plan, resource plan, contingency plan...\n        </div>"},
{"title": "Case Manager - Absence Management", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Case Manager is responsible for delivering best in class leave of absence, worker's compensation and accommodation services by effectively managing assigned case load in coordination with the vendor to provide a compliant and a smooth experience...\n        </div>"},
{"title": "Senior Marketing Automation Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Assist in managing the technical aspects of our marketing technology stack, including Marketing Automation, Customer Relationship Management (CRM), AdTech, ABM, and all complementary technologies\nProvide guidance on tools stack and where we have gaps...\n        </div>"},
{"title": "Senior Digital Designer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Design lead for wide range of projects including branding, website properties, digital assets, presentations, email, and social campaigns, landing page experience, digital advertising and more. Minimum 10 years user experience designer, art director...\n        </div>"},
{"title": "Chief Operating Officer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Create and manage budgets, overseeing and managing cash flow, accounts payable and receivable. Collaborate with senior leadership on budgeting priorities and ongoing budgeting needs to support fundraising efforts.\n        </div>"},
{"title": "Senior Product Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Establish the vision and strategy for cloud platform services or a group of cloud services based on the value we can provide.Develop strong partnerships with internal stakeholders and product teams to ensure requirements are captured and prioritized.\n        </div>"},
{"title": "Senior Corporate Counsel, Public Sector", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Draw on public sector and technology transactions experience to provide leadership and ownership over dedicated comprehensive legal support for our North American public sector sales program and transactions, including go-to-market counseling...\n        </div>"},
{"title": "Contract and Grant Associate", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Review extramural funding proposals for completion, accuracy, and compliance with sponsor guidelines, internal policy and external regulations; communicate and facilitate a coordinated approach to proposal submissions with all relevant parties.\n        </div>"},
{"title": "Product Marketing Manager, Retention ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Product Marketing Manager, Retention will be primarily responsible for planning, supporting, and executing middle of the funnel [post enrollment] strategy through nurture, conversational marketing, content marketing, and event promotion. This...\n        </div>"},
{"title": "Senior Tax Accountant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Assist in implementing our corporate tax strategy. Prepares quarterly and year-end US tax provision supporting workpapers under ASC 740. Prepares relevant workpapers and tax returns for federal and state tax obligations, ensuring compliance with...\n        </div>"},
{"title": "Marketing-Performance Media Strategy - Associate Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Responsible for the planning, execution and optimization of Paid Search (SEM), Lead Aggregators and Affiliate Marketing tactics. Responsible for the strategy, planning, execution, measurement and optimization of performance media campaigns.\n        </div>"},
{"title": "Principal User Experience Designer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Principal UX Designer will lead and oversee the work of other designers on a major initiative while also being a key contributor: leading product discovery; initiating user research; facilitating design sessions; translating user goals...\n        </div>"},
{"title": "Senior User Experience Designer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            This position will work with a team dedicated to enabling and enhancing a new Student Information System (SIS), ensuring the best experience for school administrators, teachers, and brand staff across multiple business lines. Working knowledge of the...\n        </div>"},
{"title": "Business Development Specialist II", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            Provide BD expertise in positioning, capture planning and proposal preparation for specific opportunities with institutional donors. Serve as a lead or support writer on proposals, contributing both technical and non-technical content. Train staff.\n        </div>"},
{"title": "Actuarial Quantitative Analysis Senior Manager, Claim Reserves", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provides thought and/or technical leadership, including contributions to improvement, development and innovation, and often serves as a subject matter expert across the organization. Uses best practices to develop and ensure appropriateness of highly... \n        </div>"},
{"title": "Technical Advisor II, Youth Livelihoods", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Contribute to the development and implementation of agency-wide strategies, standards, tools, and best practices. Provide technical solutions to teams, remotely and on-site, for strategic planning and how to apply program design and implementation...\n        </div>"},
{"title": "Manager, User Experience Design", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Create an open, inclusive, and trusting environment where teamwork and cooperation are valued. Define user goals and ways to measure success. Seven years of experience in planning and executing successful web applications/managing design.\n        </div>"},
{"title": "Technical Advisor III – Health and Nutrition", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            Contribute to the design, advocate for, and ensure implementation of agency-wide strategies, standards, tools, and best practices in health and nutrition that effectively engage partners, donors, and governments. Ensure a cross-sectoral approach that...\n        </div>"},
{"title": "Senior Product Manager, Real Time Operations", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Spend time with customers to understand how their needs differ from each other and craft a vision for scaling our solution to the entire market. 7+ years relevant Software Product Management experience ideally shipping complex, multi-product/system...\n        </div>"},
{"title": "Humanitarian Operations Technical Advisor I", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            You will provide technical advice and support to a range of program design and implementation issues in the area of Humanitarian Response, with special dedication to the HRD EMPOWER LAC program working in Latin America and the Caribbean...\n        </div>"},
{"title": "Assistant Vice President, Product and Platform Risk Management", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Maintains knowledge on current and emerging developments/trends, assesses the impact, and collaborates with senior management to incorporate new trends and developments in current and future strategies. Directs and enhances organizational initiatives...\n        </div>"},
{"title": "Assistant Vice President, Investor Relations", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Reporting to the VP, Head of Investor Relations, this role is accountable for developing key external messages for LFG relating to quarterly and annual financial results. The position will interface with the investment community and LFG senior...\n        </div>"}
][
{"title": "Associate Operations Engineer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Looking for passionate DevOps systems engineers and systems administrators to help us grow our second-to-<b>none</b> Cloud hosting services. We manage over 18,000 AWS EC2 servers powering some of the world's most popular Drupal web sites.\n        </div>"},
{"title": "Director of Equity, Diversity and Inclusion", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Director of EDI will design new programs and governance structures where <b>none</b> existed before. The focus of this position is to continuously strengthen our organizational culture and effectivenes through a holistic Equity, Diversity and Inclusion...\n        </div>"},
{"title": "Payroll Data Compliance Analyst", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            Responsible for researching and summarising payroll-related data globally in order to maintain our products and support the business as we grow, delivering both an employee and customer experience second-to-<b>none</b>, driving service delivery excellence...\n        </div>"},
{"title": "Patient Financial Service Specialist ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Patient Financial Service Specialist will perform daily tasks including: verification of patient eligibility, benefits, and accumulations; ABN completion; verification if CPT codes require authorization, predetermination or PCP referral...\n        </div>"},
{"title": "Actuarial Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop queries to obtain data that is appropriate to the purpose with minimal assistance and oversight. Develop studies, analyses, and presentation materials needed to appropriately inform decision makers. Seek input and assistance as required to...\n        </div>"},
{"title": "Lead Copywriter", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide subject-matter direction and guidance to other copywriters. May train employees, assign, monitor and review progress and accuracy of work. 8 years of relevant, progressive experience in the area of specialization including leading projects of...\n        </div>"},
{"title": "Customer Experience Analyst - Content Writer, Communications Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Execute a Customer Experience (CX) vision for the Health enterprise. Using customer research and a deep understanding of business needs, this person will support the CX team as they define and socialize a transformational healthcare experience...\n        </div>"},
{"title": "Senior Financial Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Coordinate with other departments, locations, and divisions. Communicate with other departments and/or outside agencies to resolve problems. Advise management of expected outcomes, and recommending ways to improve the outcomes.\n        </div>"},
{"title": "Business Analyst - Strategy Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Work with business/ market owners to identify key business issues, articulate problem, apply right analytical framework, develop solution and recommendations, represent findings to stakeholders and own the outcome. Provide periodic informal...\n\n        </div>"},
{"title": "Financial Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Advise management of expected outcomes, and recommending ways to improve the outcomes. Conduct presentation to all levels of management in order to provide a summary of analysis regarding financial results and trends.\n\n        </div>"},
{"title": "Value-Based Reimbursement Communications Consultant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            This job develops and implements communications strategies that support the department's strategy and business priorities. The incumbent focuses on internal and external audiences by analyzing, designing, developing, and providing communication...\n        </div>"},
{"title": "Senior Account Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Meet or exceed revenue and target requirements for all assigned client accounts. Cultivate and maintain strong working relationships with all clients. Own all aspects of client relationships including onboarding, training, and ongoing support,...\n        </div>"},
{"title": "Manager Actuarial", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Responsible for overseeing assigned actuarial staff and projects, hiring and training actuarial staff, and providing specialized reports and analysis of data. Accountable for developing employees, preparing rate filings, providing actuarial support...\n        </div>"},
{"title": "Website Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Management of web and social updates across websites. A mixture of advice, execution of changes to website briefing of technical changes to website. Management of internal stakeholders. Process improvement. Determine appropriate analytics, provide...\n        </div>"},
{"title": "Actuary", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            This job is an ASA Certified actuary position that initiates and leads the development of actuarial studies and analyses. Gives direction to less experienced staff and will represent the department's perspectives and needs in cross-disciplinary settings. \n        </div>"},
{"title": "Digital Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Management of web and social updates across websites. A mixture of advice, execution of changes to website briefing of technical changes to website. Management of internal stakeholders. Process improvement. Determine appropriate analytics, provide...\n        </div>"},
{"title": "Behavioral Health Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Function as a primary contact for members with behavioral health needs with the depth of engagement ranging from coaching interventions to intensive case management interventions. The overall goal is to help members navigate the health care system and...\n        </div>"},
{"title": "Associate Manager - Accounting", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Reviews, evaluates, analyzes and advises on complex Acct./Financial/Technical information. Plans, implements and manages large-scale projects. Assures alignment with department and or corporate goals. Leverages the impact of the Insurance Industry.\n        </div>"},
{"title": "Design Manager – Clinician Experience", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Drive a customer-value standard of quality and help product teams efficiently advance a launch, learn, and re-launch philosophy. Lead a team to hypothesize and ideate innovative experiences that unlock possibilities for members, healthcare...\n        </div>"},
{"title": "Business Solutions Consultant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Contribute to the delivery and execution of complex, large-scale, multi-year client enterprise transformation programs by gathering required data through direct observation and/or inquiry and synthesizing data into meaningful observation; analyzing...\n        </div>"},
{"title": "Certified Tumor Registrar - Level 1 Trauma Hospital", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Abstract and reviews cases of malignancies and reportable benign tumors diagnosed and/or treated. Translate medical terminology into standardized codes to capture patient diagnosis and treatment information. Complies with state and federal mandates.\n\n        </div>"},
{"title": "Workday - Associate Director", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Assists in the organization, development and implementation of departmental initiatives that support overall goals and objectives. Hire, lead, and serve as people manager to consulting team. Contribute to Workday practice operations\n\n        </div>"},
{"title": "Biostatistician", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Contract, work from home position. Will prepare analysis plans, identify software, maintain relationships, adhere to processes and collaborate with team. Master's degree and 4+ years' related experience required. Part-time.\n        </div>"},
{"title": "Inpatient Hospital Coder", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Assures that all services documented in the patient's chart are coded with appropriate ICD-10/PCS codes. When services/diagnoses are not documented appropriately, seeks to attain proper documentation in a timely manner according to facility standards.\n\n        </div>"},
{"title": "Pro Fee Coder - Interventional Radiology", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The remote Interventional Radiology Pro Fee Coder must be proficient in E/M coding for all Interventional Radiology cases. Will review clinical documentation and diagnostic results as appropriate to extract data and apply appropriate ICD-10 Diagnosis...\n        </div>"},
{"title": "English - Spanish Interpreter", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Handling telephone calls on demand in a quiet home office. Help translate Spanish/English conversations for a wide range of industries including Healthcare, Government, Insurance Financial, Travel &amp; Hospitality and government entities. Translating...\n        </div>"},
{"title": "Senior Manager Customer Insights and Data Analytics", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Partner with multiple departments across all lines of business to create the strategy and structure for the new customer communications email program. Determine the make-up of audience lists for all customer communications. Manage compliance...\n        </div>"},
{"title": "Pashto - Afghanistan Interpreter", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide interpreting services in a remote capacity as an independent contractor. Translate between Pashto Afghanistan and English languages on a variety of issues. Must have experience, certification, or education in the subject area. Flexible hours.\n        </div>"},
{"title": "Insurance Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Insurance billing follow up in compliance with government rules and regulations. Submits, processes, and resolves claim rejections and denials. Verifies patient insurance eligibility for denial resolution. Completes the appeal process. Monitors and...\n        </div>"},
{"title": "Clinical Documentation Integrity - CDI Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Reviews daily admissions to assigned unit, performs initial code assignment for a working DRG and completes CDI software data entry for initial and follow up case reviews per facility prioritization (and worksheet to include code and DRG assignment).\n        </div>"},
{"title": "Email Development Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Build, test and deploy personalized email marketing modules via SFMC Content Builder. Develop Content Builder email templates and respective content blocks; requires strong HTML/CSS, AMP for Email, AMPscript, Guide template Language, Server-Side...\n        </div>"},
{"title": "Technical Writer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Design and write technical illustrations as needed to facilitate understanding of technical material and upon customer request. Develop other documentations as requested by the customer. Demonstrated ability to produce quality documents within...\n        </div>"},
{"title": "Pro Fee Coder - ENT", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Will review clinical documentation and diagnostic results as appropriate to extract data and apply appropriate ICD-10 diagnosis codes, along with CPT/HCPCS codes as defined for the service type, for coding, billing, internal and external reporting...\n        </div>"},
{"title": "Graphics Developer", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            Graphics Developer is needed for a remote opportunity. Candidate will focus on Linux related graphics. Must have a good understanding of open-source development model and practices. Prior relevant experience is required.\n        </div>"},
{"title": "Director of Finance", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Prepare a monthly presentation for CFO of organization's financial performance compared to budget and prior year including financials and bridges of the drivers as well as other exhibits. Create and update forecasts for monthly and multi-year P&amp;L's and...\n        </div>"},
{"title": "Logistics Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Responsible for the development, maintenance, and day-to-day execution of our Business to Consumer (B2C) logistics network to include forecasting &amp; reporting; peak season planning &amp; execution; as well as the continued development and optimization of...\n        </div>"},
{"title": "Senior Tax Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Responsible for all aspects of the tax compliance function and tax accounting function, including the performance of tax research and planning. In performing these duties, the individual will need to keep abreast of changes in tax law and will be...\n        </div>"},
{"title": "SEO Copywriter", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The SEO Copywriting contractor is a freelance role that works with the SEO Copywriting team to create unique content for SEO clients based on strategy goals identified by SEO Specialists. Copywriting contractors work under the supervision of the Copy...\n        </div>"},
{"title": "Contracts Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Drafting and negotiating of software license agreements, professional services agreements, and contract addenda in region; routinely exercising discretion and independent judgment. Reviewing RFPs, Tenders, RFIs, and RFQs, offering appropriate...\n        </div>"},
{"title": "Collections Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Collections Specialist will be responsible for ensuring payment on open invoices. This role will utilize Aging Reports to contact clients when invoices are past due. The Collections Specialist will facilitate resolution for payment, post receipts...\n        </div>"},
{"title": "Business Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Critically reviews, analyzes, and evaluates business systems and user needs, ultimately producing clearly documented requirements and deliverables. Facilitates elicitation discussions with various stakeholders to clarify project scope resulting in flow...\n        </div>"},
{"title": "Python, Django Developer", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            Seeking experienced Python developer to participate in two projects primarily utilizing Python and Django, performing front-end/back-end development. jQuery skills are a big plus, along with solid SQL skills. Full time, long-term, freelance position.\n        </div>"},
{"title": "Senior Graphic Designer Consultant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Collaborating with clients and consulting teams to understand the problem and develop the appropriate creative solution or visualization. Managing your workload, timelines and client/consulting team expectations, with support and collaboration from the...\n        </div>"},
{"title": "Director, Proposal Writing", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Supervises internal writers, including HR-related activities such as workload and performance evaluations. Manages company's relationship with externally-contracted writing staff, ensuring their work is meeting or exceeding expectations. \n        </div>"},
{"title": "Market Conduct Senior Consultant I", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provides leadership, oversight and high-level consultation for Market Conduct matters. The Senior Consultant I is responsible for the day-to-day management of market conduct matters, including strategy development, team process oversight and response...\n        </div>"},
{"title": "Director of Brand Sales", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            As our Brand Sales Director, you will report to the SVP of Sales and you will have responsibility for bringing on new accounts and partnerships. We are seeking a passionate and motivated results-oriented Brand Sales Director with a track record in...\n        </div>"},
{"title": "Developmental Editor", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Razor-sharp editing of student- and teacher-facing mathematics curriculum and support materials for grades PK-12. Providing feedback to curriculum writers during the editing process. BA/MA in English, journalism, education, or related field. \n        </div>"},
{"title": "Director of Brand and Content Strategy", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            We're looking for a brilliant marketer with a strong perspective and point of view to define, build, and guide our brand and content strategy. 5-8 years of SaaS marketing experience. Demonstrated ability to lead a team and scale a content motion. Remote. \n        </div>"},
{"title": "Associate Director, Marketing", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Cultivate relationships with customers and stakeholders. Coordinate regular touch points with Radius sales, patient access, payer, medical teams to integrate real time feedback and learning's into marketing campaigns and efforts. Accumulates in-depth...\n        </div>"},
{"title": "Finance Manager ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Builds, updates and maintains monthly forecast models for areas of responsibility. Provides accurate and appropriate materials to meet the monthly/quarterly/annual close deadlines. Researches and prepares variance analysis and explanations.\n        </div>"},
{"title": "Salesforce Business Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Perform discovery on requests submitted or communicated from business stakeholders and from the discovery make recommendations of potential Salesforce solutions. Minimum 2 years experience writing/translating business requirements.\n        </div>"},
{"title": "Marketing Operations Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Perform market, customer and industry research using internal and external databases, secondary resources and the internet, while maintaining and documenting data sources to ensure sustainable ongoing updates.\n\n        </div>"},
{"title": "Reviews Editor", "location": "\n            New York City, NY, or US National ", "description": "<div class=\"job-description\">\n            Assign and edit book reviews for daily publication on publishersweekly.com and in the weekly print edition. Assign and edit author interviews. Manage a team of freelance reviewers and recruit new reviewers as required.Generate feature story ideas.\n        </div>"},
{"title": "Technical Writer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop Section 508 compliant accessible online help, user guides and training materials using Adobe RoboHelp and Microsoft Office products. Review technical enhancements and bug fixes from developer repositories (e.g. GitHub, TeamForge) to create...\n        </div>"},
{"title": "Compliance Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Assist with critical compliance services to clients, including the licensing and registration of RIAs/BDs and representatives. Support the timely completion of client deliverables, meeting delivery commitments while allowing time for review and...\n        </div>"},
{"title": "Accounting Operations Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Manages contracting needs for various shared service departments in the organization. Serve as the primary point of contact for diverse set of contracts. Collaborates with internal stakeholders, including Procurement, Finance and Legal to facilitate...\n        </div>"},
{"title": "Corporate Travel Consultant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide professional, accurate, cost-effective travel arrangements for internal customers within company guidelines and standards for excellent customer service. This position will require a flexible schedule: shift work, evening hours, Saturdays...\n        </div>"},
{"title": "Tax Supervisor", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Lead tax compliance engagements in accordance with firm and professional standards. Work directly with management and clients to build and maintain relationships. BS/BA in Accounting, CPA, and 2 years within a public accounting firm. Remote work. \n        </div>"},
{"title": "Tax Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Lead tax compliance engagements in accordance with firm and professional standards. Work directly with management and clients to build and maintain relationships. Perform detailed reviews of tax returns and workpapers. Review tax returns, research...\n        </div>"},
{"title": "Food and Beverage Sales Director", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The food and beverage sales director will have the responsibility for bringing on new accounts and partnerships. Manage a pipeline of prospects. Utilize data to refine strategy and deal criteria. Need 2+ years of sales experience and a BA/BS MBA degree...\n        </div>"},
{"title": "RN Case Manager - Special Needs Plan", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Engaging with high-risk members (primarily telephonically) to understand their needs, supported by technology and data tools. An unrestricted, compact RN license and willingness to obtain non-compact state licenses if needed. Health insurance experience.\n        </div>"},
{"title": "Customer Support Specialist ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Answering phone calls when customers call in for help. Develop expertise in services and products and the initiative to take an active role in sharing this knowledge with customers. Achieve individual and team service level goals. Track and document...\n        </div>"},
{"title": "SEO Copywriter", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The SEO Copywriter is an individual contributor role inside the SEO Department, responsible for creating unique content for SEO clients based on strategic goals identified by SEO Specialists. Copywriters work under the supervision of the Copy...\n        </div>"},
{"title": "Customer Support Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide service and support to internal and external customers via phone and email, managing and documenting member interactions using Salesforce. As part of a team, support over 900,000 global Bookshare members with varying technical skill levels with...\n        </div>"},
{"title": "Paid Media Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Monitor the latest trends in social media, including advertising formats, product updates, new channels and technologies in order to improve campaign performance and provide recommendations on how to best leverage new tools and services.\n\n        </div>"},
{"title": "Lifecycle Strategist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Be primarily responsible for email campaign setup, audit and launch - This role will actively work on creating new or edit existing templates. Partner with an internal design team and external agency to optimize and build email templates. Manage and...\n        </div>"},
{"title": "Billing Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Billing Specialist will work with the Revenue Accounting team to ensure accurate and timely invoices for clients. The Billing Specialist will receive data from multiple inputs and will use that information to generate invoices. This role will...\n        </div>"},
{"title": "Copywriter", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop copy and narratives that captivate and educate prospects and clients interested in real estate investing, and personal finance as well as preserving and protecting their business. Work with internal clients to ensure an understanding of...\n        </div>"},
{"title": "Senior Firmware Engineer I", "location": "\n            Canada, or US National ", "description": "<div class=\"job-description\">\n            Firmware Design and Development of IoT infrastructure for current and next-gen Camera-related products. Develop Firmware in C, C++ for Microcontrollers, System-on-Chips and System-on-Modules. Develop Firmware in C, C++ for Cellular LTE, Wi-Fi,...\n        </div>"},
{"title": "Senior Firmware Engineer II", "location": "\n            Canada, or US National ", "description": "<div class=\"job-description\">\n            Develop Firmware in C, C++ for Cellular LTE, Wi-Fi, Bluetooth BLE, Sub-GHz, GNSS and related RF technologies. Support Electrical Engineering with Board Bring-up and Hardware Debugging Support. Collaborate with distributed teams such as Embedded Product...\n        </div>"},
{"title": "Accounting Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Oversee accounts payable, including review of the accounting treatment/classification of accounts payable and procurement card transactions as well as identifying and implementing improvements to the accounts payable and procurement processes. Manage...\n        </div>"},
{"title": "Senior Software Engineer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Work collaboratively with cross-functional teams to create education products, create ideas to solve engineering challenges, identify and implement best practices and support an existing platform. Remote position. \n        </div>"},
{"title": "Software Engineer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Looking for a highly skilled Software Engineer that can lead a diverse team in creating a new testing platform for ACT &amp; SAT so that all students can achieve college-ready prep scores. 100% remote position.                                     \n        </div>"},
{"title": "Accounting Manager, Global Payroll", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The accounting manager will lead and manage all aspects of global payroll accounting operations for our rapidly growing company and must be a strategic and tactical leader, with a successful track record. They will drive timely, accurate, and compliant...\n        </div>"},
{"title": "Junior UI - UX Designer", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            Discuss and plan the visual identity of new features across multiple projects; Create high fidelity designs to be implemented in the platform; Create low fidelity drafts to be used as a proof of concept; Validate your design outputs, testing and...\n        </div>"},
{"title": "Operations Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The purpose of this position is to assist with various projects and initiatives within the eligibility services department. The role will act in a strategic capacity to analyze business needs and recommend improvement/solutions to business processes. \n        </div>"},
{"title": "Principal Salesforce Engineer, Architect CRM", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Developing a technical vision and roadmap to match overall company strategy and vision. Guiding the direction, quality, and approach for architecture of Salesforce across the company with clear deliverables like architecture diagrams and documentation.\n        </div>"},
{"title": "Enrollment Advisor ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Build and manage a mature, active pipeline of leads. Advise prospective students using a consultative process. Experience within a blended contact center handling inbound &amp; outbound calls as well as instant chat inquiries - previous experience preferred.\n        </div>"},
{"title": "Senior Android Engineer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Collaborate with the design &amp; product teams to build an experience that stands out among the best applications on Android. Work on new features and updates to the Android app. Work with our partner teams and venues to deliver the experience...\n\n\n        </div>"},
{"title": "Freelance Writer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Primary responsibilities will include proofreading articles, supporting special projects, and other relevant job functions. Friendly freelance writer with strong communication and interpersonal skills is needed for a stay at home opportunity. \n        </div>"},
{"title": "Marketing Communications Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Collaborate on digital marketing campaigns through the creation of (writing, design, layout) digital marketing content, such as email campaigns and landing pages. At least 2-4 years of relevant experience in a marketing or communications role.\n        </div>"},
{"title": "Senior Accountant ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Senior Accountant is responsible for financial statement preparation and review of K12 managed schools. You must be an energetic team player who listens and values the opinions of others and a self-starter who effectively prioritizes and works well...\n        </div>"},
{"title": "Manager, OEM Programs - DI", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Create, propose, and build out digital marketing strategies for clients. Stay current on industry trends to continually grow knowledge of new strategies and success metrics. Provide management-level presence in meetings with clients when necessary.\n        </div>"},
{"title": "Senior Product Marketing Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop positioning, messaging, and value proposition that differentiates and is resonate with key personas. End-to-end planning and launch of products and releases; cross-functional implementation of the product marketing plan. Design and ...\n        </div>"},
{"title": "Digital Analytics Manager ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            This will include implementing and validating pixels, as well as collecting, interpreting, and analyzing data for various line of business that we offer. This person would be the subject matter expert who utilizes analytics to drive insights and...\n        </div>"},
{"title": "Manager - Financial Planning and Analysis", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide financial analysis and commentary used for communication with partners. Responsible for budget and forecast development, tracking and oversight, working to ensure fiscal responsibility, accuracy and success. Partners with customer's external...\n        </div>"},
{"title": "Senior Manager, Financial Planning and Analysis", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide company-wide financial analysis and commentary used for communication with partners such as Clearway Board and Executive Leadership Team. Develops, mentors and manages FP&amp;A team resources, ensuring effective and efficient department systems...\n        </div>"},
{"title": "Distance Learning Instructor", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide virtual instruction on regional and culture subjects, using modern communicative and blended-learning methodologies. Provide instruction based on designated POI. Develop lesson plans or other learning material, as required. \n        </div>"},
{"title": "Distance Learning Associate Language Instructor ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Japanese Distance Learning Associate Language Instructor will assist with an ongoing requirement for live virtual Distance Learning (DL) Foreign Language, Regional Expertise, and Cultural (LREC) instruction and LREC program support services. Part-time. \n        </div>"},
{"title": "Distance Learning Instructor", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide virtual language instruction to improve foreign language proficiency skills across the modalities of Listening, Reading, and Speaking (L/R/S) as measured by the Defense Language Proficiency Test (DLPT), ACTFL or Oral Proficiency Interview (OPI).\n\n        </div>"},
{"title": "Distance Learning Instructor", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide virtual language instruction to improve foreign language proficiency skills across the modalities of Listening, Reading, and Speaking (L/R/S) as measured by the Defense Language Proficiency Test (DLPT), ACTFL or Oral Proficiency Interview (OPI)...\n        </div>"},
{"title": "Financial Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Financial Analyst will play a role in various aspects of financial planning, which may include the development of the annual operating budget and multi-year financial plan, capital expenditure planning, and new program evaluations.\n        </div>"},
{"title": "Technical Writer - Copy Editor", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Copy edit course content including core course instruction, assessments, multimedia, and/or practice games; Use brand authoring tools and processes as well as adhere to the instructional design guidelines set forth by the company team; Accept and...\n        </div>"},
{"title": "Director, OEM Programs", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Create, propose, and develop digital marketing strategies for OEM program clients. Measure the performance of each of the programs under your leadership and execute the strategies to increase value delivery and program growth. Stay current on industry...\n        </div>"},
{"title": "Visual Effects Artist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            You'll use your background in VFX to analyze our current pipelines and determine the best tools to get the job done moving forward. You'll create high-quality VFX based on references and use your creativity to help define the VFX style for each project. \n        </div>"},
{"title": "Talent Acquisition Specialist II", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Manage full cycle recruitment to include screening resumes, sourcing candidates, conducting phone screens, extending employment offers and other recruiting projects as needed. 4 years' experience as a full cycle recruiter, including Boolean...\n        </div>"},
{"title": "PR Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n             Secure coverage in national, local, and trade publications to boost profile, build our reputation, and demonstrate our research capabilities.  Draft press releases, thought pieces, and statements to generate positive press coverage. \n        </div>"},
{"title": "Physician", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            You should have: board certification in Internal Medicine, Family Practice; active California, Illinois, and Texas license, and DEA with the ability to get licensed in all 50 states and DC by our licensing vendor; 5+ years of clinical practice...\n        </div>"},
{"title": "Senior Financial Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide financial planning and analysis support for several business units. Prepare monthly analysis of revenue and cost variances to forecast, budget and prior year. Three to five years of relevant experience. Bachelor's degree in Finance, Accounting...\n        </div>"},
{"title": "Senior Manager, Fuel Performance", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Looking for an analytical and self motivated individual for our Fuel Performance Management team. This individual must love working with people, building relationships, and be driven by client success. Experience in digital media and client relations...\n        </div>"},
{"title": "Revenue Recognition Accountant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            In this role, you will provide leadership in the development and improvement of accounting policy, operational process effectiveness, and internal control environment related to the revenue recognition process. Oversee the month and quarter-end...\n        </div>"},
{"title": "Senior Accountant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Oversees and performs specialized accounting and financial activities on complex accounts and funds in accordance with generally accepted accounting principles and our policies and procedures. Performs or serves as team leader in assembling...\n        </div>"},
{"title": "Accountant I", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Complete assigned duties as part of the accounting close process. Apply knowledge of accounting policies and procedures to assigned tasks which include recording journal entries, and performing research and analysis. Interpret variances.\n        </div>"},
{"title": "Environmental Project Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Preparation of documents such as Phase I, Phase II, RAR reports and workplans with minimal oversight, synthesize analytical data, and develop conceptual site models. 8+ years of experience in the environmental industry with at least 3+ years in a...\n        </div>"},
{"title": "Senior Financial Analyst - Pharmacy", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Senior Financial Analyst will play a key role in various aspects of financial planning, which may include the development of the annual operating budget and multi-year financial plan, capital expenditure planning, and new program evaluations.\n        </div>"},
{"title": "Instructional Designer II", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Looking for an Instructional Designer II to join our Talent Management Team. The ideal candidate will be an individual contributor primarily responsible for designing and developing highly impactful learning solutions. You will design and develop...\n        </div>"},
{"title": "Senior Executive Assistant ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Executive Assistant (EA) provides highly skilled administrative support to the President, Clearway Health, LLC, and exemplifies model core role model at all times. The EA also serves as the key support for leadership to ensure efficient and proper...\n        </div>"},
{"title": "Content Development Strategist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Improve visibility and penetration with C-level executives via integrated campaigns and digital marketing strategies. Lead the planning and implementation of the digital content strategy for Technology Advisory marketing team. Work closely with...\n        </div>"},
{"title": "Senior Site Reliability Engineer II", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Own the CI/CD pipeline machinery for all SaaS products and elevate it from current capabilities to world-class level. 7+ years of hands-on experience working in a software development organization that builds large-scale distributed systems...\n        </div>"},
{"title": "Manager, Business and Accreditation Operations", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            You will help develop innovative solutions to challenges in delivering high-quality, scalable, and accessible virtual healthcare. You will also help build the foundations for streamlined compliant operational processes and procedures.\n        </div>"},
{"title": "Project Manager II", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Lead and develop the enrollment project plan specifying goals, strategy, scheduling, identification of risks and allocation of available resources\nWork closely with stakeholders, enrollment operations and marketing support teams (Communications, Design...\n        </div>"},
{"title": "Junior Technical Writer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Gather, analyze, translate and compose technical information into clear and concise language that is easily understood by technical and non-technical personnel, but also follow government guidelines and directives, to include: Ensure that successful...\n        </div>"},
{"title": "Workforce Planning Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Maintain workforce management software and tools to provide partners ability to manage intra-day staffing levels and to determine the most effective methods for staffing adjustments. Create and maintain call center tools that observe agents actual...\n        </div>"},
{"title": "Digital Copywriter, B2B Tech - Cybersecurity", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Draft compelling copy for our website, landing pages, emails, digital ads, and other campaign materials such as event promotional collateral. Conduct SEO research to optimize copy for SEO performance, and contribute to our overall keyword research and...\n        </div>"},
{"title": "Technical Writer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n             Develop comprehensive API Technical documentation that meets organizational standards. Create client facing documentation for Mastercard products, as part of creating a quality developer experience. Obtain a deep understanding of products and service...\n        </div>"},
{"title": "Financial Data Analyst", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Responsible for completing a monthly enrollment forecasting process, as well as researching, understanding, and performing analysis on the trends within our business. This resource will evaluate performance of actual vs plan, identify drivers of...\n        </div>"},
{"title": "Project Manager ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Lead large, global, and often, virtual groups of multi-disciplinary teams of highly-talented professionals; Develop and refine project plans that specify goals, strategy, staffing, scheduling, identification of risks, contingency plans, and allocation...\n        </div>"},
{"title": "Senior Professional Services Technical Consultant, Federal", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Act as the internal customer advocate for problem resolution, new product features, and future product direction. Use and create knowledgebase articles based on field incidents, and/or common or critical issues.\n        </div>"},
{"title": "Learning Coach Engagement, Senior Director", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Define the product strategy and roadmap. Lead, define and implement the program plan in order to achieve the goals. Lead in the management of changes to the program scope, prioritization, schedule, and costs to keep the community updated. Determine and...\n        </div>"},
{"title": "Digital Marketing Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop, maintain and optimize marketing calendar. Manage email unsubscribes in accordance to CASL, CAN-SPAM and GDPR. Build and manage accurate contact segments for various email campaigns. Manage performance reporting and analysis  using data to...\n        </div>"},
{"title": "Chief Pricing Analyst ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Development of cost proposals, both the pricing models as well as the cost volume narrative. Advise internal clients on risk mitigation and the development of winning price strategies. Facilitates pricing reviews and provides pricing guidance to...\n        </div>"},
{"title": "Senior Product Designer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Experience building products, developing component-based design systems and adapting brand guidelines to create scalable systems across products. Employ design thinking to translate insights into detailed user journey maps and experience flows that...\n        </div>"},
{"title": "Esports Coordinator", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Esports Coordinator is responsible for supporting and facilitating virtual socialization experiences for schools and students related to esports. Maintain actively running tournaments and competitions. Help create, maintain, and oversee competitive...\n        </div>"},
{"title": "Curriculum Champion", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Curriculum Champion leverages their in-depth knowledge of our curriculum products and portfolio to develop presentation and training materials, both internally and externally, to highlight and educate stakeholders on our core product offering. \n        </div>"},
{"title": "Career Learning Coordinator", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provide operational support to ensure team members have necessary tools to complete quality work; Develop and refine program/project plans that specify goals, strategy, identification of risks, contingency plans and allocation of available resources.\n        </div>"},
{"title": "Product Designer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            As a Product Designer, you will be responsible for creating exceptionally designed user experiences for our suite of applications, catering to our customers: students, parents, learning coaches, and teachers. You will work closely with designers...\n        </div>"},
{"title": "Software Engineer, Frontend", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            You'll make tools that people rely on for their real jobs. You'll get to work in open source and get feedback directly from users and customers out in the open. The company is growing and so is the business. We're adding new remote team members from...\n        </div>"},
{"title": "Regional Safeguarding Advisor II", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Lead/co-lead on the design and implementation of training and capacity building plans for CRS staff, affiliates and partners. Support country programs on the in-take and assessment of safeguarding reports and in preparing and conducting investigations...\n        </div>"},
{"title": "Group Underwriting Consultant I", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Underwrites small size cases for new and renewal business developing proposals, add-on business and contract revisions, and other policy owner services within limited authority levels under minimal supervision. \n        </div>"},
{"title": "Staff Software Engineer DEMS", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Set a high technical bar for the team through deep technical insights and architecture design reviews. Mentor engineers. Work across teams with Product, Design, and Engineering to solve some of our biggest technical challenges for our customers.\n\n        </div>"},
{"title": "School Operations Admin 1", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Assist in the development of a network of providers throughout the state within the private sector as well as local school districts for programs. Negotiate rates with providers based on market value of services rendered. Maintain awareness of current...\n        </div>"},
{"title": "Proposal Coordinator and Technical Writer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop a project plan, outline each stage of the proposal, and create a schedule to meet all necessary deadlines to deliver winning proposals. Guide teams through the collaborative process to develop responses to RFI, RFQs and RFPs. Analyze criteria.\n        </div>"},
{"title": "Vice President of Operations and Sales", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop GTM for various verticals that report to you, focusing on short-term goals while building long-term plans to capture market share. Set revenue and KPI expectations, prioritize efforts, hold the team accountable for building pipeline and...\n        </div>"},
{"title": "Inside Sales Representative", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Utilize lead information to identify prospects and reach decision-makers with whom he/she develops effective consultative relationships. Drive revenue by selling the organization's products and/or services to established customers or new prospects via...\n        </div>"},
{"title": "Demand Generation Marketing Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Develop, maintain, and execute demand generation plans aligned with business goals. Design, plan, manage, and optimize integrated digital campaigns across multiple channels such as SEO, SEM, organic and paid social media, email marketing, affiliate...\n        </div>"},
{"title": "Senior IT Project Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Responsible for the delivery and management of multiple medium-sized IT projects (annual project(s) portfolio size up to $5M) running concurrently. Develops the project approval documentation, integrated project plan, resource plan, contingency plan...\n        </div>"},
{"title": "Case Manager - Absence Management", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Case Manager is responsible for delivering best in class leave of absence, worker's compensation and accommodation services by effectively managing assigned case load in coordination with the vendor to provide a compliant and a smooth experience...\n        </div>"},
{"title": "Senior Marketing Automation Specialist", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Assist in managing the technical aspects of our marketing technology stack, including Marketing Automation, Customer Relationship Management (CRM), AdTech, ABM, and all complementary technologies\nProvide guidance on tools stack and where we have gaps...\n        </div>"},
{"title": "Senior Digital Designer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Design lead for wide range of projects including branding, website properties, digital assets, presentations, email, and social campaigns, landing page experience, digital advertising and more. Minimum 10 years user experience designer, art director...\n        </div>"},
{"title": "Chief Operating Officer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Create and manage budgets, overseeing and managing cash flow, accounts payable and receivable. Collaborate with senior leadership on budgeting priorities and ongoing budgeting needs to support fundraising efforts.\n        </div>"},
{"title": "Senior Product Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Establish the vision and strategy for cloud platform services or a group of cloud services based on the value we can provide.Develop strong partnerships with internal stakeholders and product teams to ensure requirements are captured and prioritized.\n        </div>"},
{"title": "Senior Corporate Counsel, Public Sector", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Draw on public sector and technology transactions experience to provide leadership and ownership over dedicated comprehensive legal support for our North American public sector sales program and transactions, including go-to-market counseling...\n        </div>"},
{"title": "Contract and Grant Associate", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Review extramural funding proposals for completion, accuracy, and compliance with sponsor guidelines, internal policy and external regulations; communicate and facilitate a coordinated approach to proposal submissions with all relevant parties.\n        </div>"},
{"title": "Product Marketing Manager, Retention ", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Product Marketing Manager, Retention will be primarily responsible for planning, supporting, and executing middle of the funnel [post enrollment] strategy through nurture, conversational marketing, content marketing, and event promotion. This...\n        </div>"},
{"title": "Senior Tax Accountant", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Assist in implementing our corporate tax strategy. Prepares quarterly and year-end US tax provision supporting workpapers under ASC 740. Prepares relevant workpapers and tax returns for federal and state tax obligations, ensuring compliance with...\n        </div>"},
{"title": "Marketing-Performance Media Strategy - Associate Manager", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Responsible for the planning, execution and optimization of Paid Search (SEM), Lead Aggregators and Affiliate Marketing tactics. Responsible for the strategy, planning, execution, measurement and optimization of performance media campaigns.\n        </div>"},
{"title": "Principal User Experience Designer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            The Principal UX Designer will lead and oversee the work of other designers on a major initiative while also being a key contributor: leading product discovery; initiating user research; facilitating design sessions; translating user goals...\n        </div>"},
{"title": "Senior User Experience Designer", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            This position will work with a team dedicated to enabling and enhancing a new Student Information System (SIS), ensuring the best experience for school administrators, teachers, and brand staff across multiple business lines. Working knowledge of the...\n        </div>"},
{"title": "Business Development Specialist II", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            Provide BD expertise in positioning, capture planning and proposal preparation for specific opportunities with institutional donors. Serve as a lead or support writer on proposals, contributing both technical and non-technical content. Train staff.\n        </div>"},
{"title": "Actuarial Quantitative Analysis Senior Manager, Claim Reserves", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Provides thought and/or technical leadership, including contributions to improvement, development and innovation, and often serves as a subject matter expert across the organization. Uses best practices to develop and ensure appropriateness of highly... \n        </div>"},
{"title": "Technical Advisor II, Youth Livelihoods", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Contribute to the development and implementation of agency-wide strategies, standards, tools, and best practices. Provide technical solutions to teams, remotely and on-site, for strategic planning and how to apply program design and implementation...\n        </div>"},
{"title": "Manager, User Experience Design", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Create an open, inclusive, and trusting environment where teamwork and cooperation are valued. Define user goals and ways to measure success. Seven years of experience in planning and executing successful web applications/managing design.\n        </div>"},
{"title": "Technical Advisor III – Health and Nutrition", "location": "\n            Work from Anywhere ", "description": "<div class=\"job-description\">\n            Contribute to the design, advocate for, and ensure implementation of agency-wide strategies, standards, tools, and best practices in health and nutrition that effectively engage partners, donors, and governments. Ensure a cross-sectoral approach that...\n        </div>"},
{"title": "Senior Product Manager, Real Time Operations", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Spend time with customers to understand how their needs differ from each other and craft a vision for scaling our solution to the entire market. 7+ years relevant Software Product Management experience ideally shipping complex, multi-product/system...\n        </div>"},
{"title": "Humanitarian Operations Technical Advisor I", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            You will provide technical advice and support to a range of program design and implementation issues in the area of Humanitarian Response, with special dedication to the HRD EMPOWER LAC program working in Latin America and the Caribbean...\n        </div>"},
{"title": "Assistant Vice President, Product and Platform Risk Management", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Maintains knowledge on current and emerging developments/trends, assesses the impact, and collaborates with senior management to incorporate new trends and developments in current and future strategies. Directs and enhances organizational initiatives...\n        </div>"},
{"title": "Assistant Vice President, Investor Relations", "location": "\n            US National ", "description": "<div class=\"job-description\">\n            Reporting to the VP, Head of Investor Relations, this role is accountable for developing key external messages for LFG relating to quarterly and annual financial results. The position will interface with the investment community and LFG senior...\n        </div>"}
]